furjie/Single-BLDC-driver-and-app/s6e1a1.h
/*******************************************************************************
* Copyright (C) 2013 Spansion LLC. All Rights Reserved. 
*
* This software is owned and published by: 
* Spansion LLC, 915 DeGuigne Dr. Sunnyvale, CA  94088-3453 ("Spansion").
*
* BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND 
* BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
*
* This software contains source code for use with Spansion 
* components. This software is licensed by Spansion to be adapted only 
* for use in systems utilizing Spansion components. Spansion shall not be 
* responsible for misuse or illegal use of this software for devices not 
* supported herein.  Spansion is providing this software "AS IS" and will 
* not be responsible for issues arising from incorrect user implementation 
* of the software.  
*
* SPANSION MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
* REGARDING THE SOFTWARE (INCLUDING ANY ACOOMPANYING WRITTEN MATERIALS), 
* ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING, 
* WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED 
* WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED 
* WARRANTY OF NONINFRINGEMENT.  
* SPANSION SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT, 
* NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT 
* LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION, 
* LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR 
* INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT, 
* INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA, 
* SAVINGS OR PROFITS, 
* EVEN IF SPANSION HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. 
* YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
* INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED 
* FROM, THE SOFTWARE.  
*
* This software may be replicated in part or whole for the licensed use, 
* with the restriction that this Disclaimer and Copyright notice must be 
* included with each copy of this software, whether used in part or whole, 
* at all times.  
*/

/************************************************************************/
/*                                                                      */
/*  Header File for Device S6E1A1                                       */
/*  Version V1.9                                                        */
/*  Date    2014-05-08                                                  */
/*                                                                      */
/************************************************************************/

/******************************************************************************
 * History
 * Date       Ver Description
 * 2013-12-17 1.0 Initial
 * 2013-12-26 1.1 Revise RDR, TDR register's structure definition of 
 *                MFS (UART, CSIO, LIN, I2C)
 * 2014-01-03 1.2 Revise Flash I/F CRTRMM_TRMM; 
 *                Delete bit-banding definition of Fast IO;
 *                Delete redundant prefix for MFT macro;
 *                Revise GPIO: Py --> Pxy format;
 * 2014-01-07 1.3 Add PRTSL and SCTSL register in ADC12 module;
 * 2014-01-08 1.4 Add IRQCMODE register definition;
 *                Refine naming of IRQ Handler;
 *                Modify MFT_PPG: TRG ==> TRG0, RG6O ==> TRG6O;
 *                Register definition of TTCR0
 * 2014-01-13 1.5 Typo: WCMPRCR ==> WCMPCR in ADC12 module;
 *                Add QPRC0_NF part;
 *                Revise offset address of MFT module from 0x20000 to 0x20100;
 *                Accroding to PM's update, the following content is updated;
 *                CSIO->SSR->AWC is deleted;
 *                CSIO->ESCR->CSFE is added;
 *                CSIO->SCSCR is updated;
 *                CSIO->TBytex is updated;
 *                LIN->SMR->WUCR is deleted;
 * 2014-01-14 1.6 Revise reserved byte in 'MFT_ADCMP_MODULE'
 * 2014-01-26 1.7 Delete bit band definition of FPOER;
 *                Add the bit alias address of Fast GPIO registers;
 * 2014-03-24 1.8 Correct 'stc_mfs_lin_smr_field_t'
 * 2014-05-08 1.9 Correct bit address of Fast GPIO
 *
 ******************************************************************************/

#ifndef _S6E1A1_H_
#define _S6E1A1_H_

#ifdef __cplusplus
extern "C" {
#endif 

#define FM0P_DEVICE_TYPE 1

/******************************************************************************
 * Configuration of the Cortex-M0P Processor and Core Peripherals
 ******************************************************************************/
#define __MPU_PRESENT           0 /* FM0P provide an MPU                           */
#define __NVIC_PRIO_BITS        2 /* FM0P uses 2 Bits for the Priority Levels      */
#define __Vendor_SysTickConfig  0 /* Set to 1 if different SysTick Config is used */


/******************************************************************************
 * Interrupt Number Definition
 ******************************************************************************/
typedef enum IRQn
{
    NMI_IRQn          = -14, /*  2 Non Maskable      */
    HardFault_IRQn    = -13, /*  3 Hard Fault        */
    SVC_IRQn          = -5,  /* 11 SV Call           */
    PendSV_IRQn       = -2,  /* 14 Pend SV           */
    SysTick_IRQn      = -1,  /* 15 System Tick       */

    CSV_IRQn          =  0, /* Clock Super Visor                             */
    SWDT_IRQn         =  1, /* Software Watchdog Timer                       */
    LVD_IRQn          =  2, /* Low Voltage Detector                          */
    WFG_DTIF_IRQn     =  3, /* Wave Form Generator / DTIF                    */
    EXINT0_7_IRQn     =  4, /* External Interrupt Request ch.0 to ch.7       */
    /* Reserved       =  5                                                   */
    DTIM_QDU_IRQn     =  6, /* Dual Timer / Quad Decoder                     */
    MFS0RX_IRQn       =  7, /* MultiFunction Serial Reception ch.0           */
    MFS0TX_IRQn       =  8, /* MultiFunction Serial Transmission ch.0        */
    MFS1RX_IRQn       =  9, /* MultiFunction Serial Reception ch.1           */
    MFS1TX_IRQn       = 10, /* MultiFunction Serial Transmission ch.1        */
    /* Reserved       = 11                                                   */
    /* Reserved       = 12                                                   */
    MFS3RX_IRQn       = 13, /* MultiFunction Serial Reception ch.3           */
    MFS3TX_IRQn       = 14, /* MultiFunction Serial Transmission ch.3        */
    /* Reserved       = 15                                                   */
    /* Reserved       = 16                                                   */
    /* Reserved       = 17                                                   */
    /* Reserved       = 18                                                   */
    DMAC0_IRQn        = 19, /* DMAC ch.0                                     */
    DMAC1_IRQn        = 20, /* DMAC ch.1                                     */
    /* Reserved       = 21                                                   */
    /* Reserved       = 22                                                   */
    PPG_IRQn          = 23, /* PPG                                           */
    OSC_PLL_WC_RTC_IRQn = 24, /* OSC / PLL / Watch Counter / RTC             */
    ADC0_IRQn         = 25, /* ADC0                                          */
    /* Reserved       = 26                                                   */
    /* Reserved       = 27                                                   */
    FRTIM_IRQn        = 28, /* Free-run Timer                                */
    INCAP_IRQn        = 29, /* Input Capture                                 */
    OUTCOMP_IRQn      = 30, /* Output Compare                                */
    BTIM0_3_FLASH_IRQn = 31, /* Base Timer ch.0 to ch.3 / Flash              */
} IRQn_Type;


#include <core_cm0plus.h>
#include "system_s6e1a1.h"
#include <stdint.h>

