furjie/Single-BLDC-driver-and-app/s6e1a1.h
#define SUCCESS  0
#define ERROR    -1

#ifndef NULL
#define NULL 0
#endif


/******************************************************************************/
/*                Device Specific Peripheral Registers structures             */
/******************************************************************************/

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/******************************************************************************
 * Peripheral register bit fields
 ******************************************************************************/

/******************************************************************************
 * Flash_IF_MODULE
 ******************************************************************************/
/* Flash_IF_MODULE register bit fields */
typedef struct stc_flashif_frwtr_field
{
  __IO  uint8_t RWT        : 2;
} stc_flashif_frwtr_field_t;

typedef struct stc_flashif_fstr_field
{
  __IO  uint8_t RDY        : 1;
  __IO  uint8_t HNG        : 1;
  __IO  uint8_t CERS       : 1;
  __IO  uint8_t ESPS       : 1;
  __IO  uint8_t SERS       : 1;
  __IO  uint8_t PGMS       : 1;
} stc_flashif_fstr_field_t;

typedef struct stc_flashif_fsyndn_field
{
  __IO  uint8_t SD         : 4;
} stc_flashif_fsyndn_field_t;

typedef struct stc_flashif_ficr_field
{
  __IO  uint8_t RDYIE      : 1;
  __IO  uint8_t HANGIE     : 1;
} stc_flashif_ficr_field_t;

typedef struct stc_flashif_fisr_field
{
  __IO  uint8_t RDYIF      : 1;
  __IO  uint8_t HANGIF     : 1;
} stc_flashif_fisr_field_t;

typedef struct stc_flashif_ficlr_field
{
  __IO  uint8_t RDYC       : 1;
  __IO  uint8_t HANGC      : 1;
} stc_flashif_ficlr_field_t;

typedef struct stc_flashif_crtrmm_field
{
  __IO uint32_t TRMM       :10;
       uint32_t RESERVED10 : 6;
  __IO uint32_t TTRMM      : 5;
} stc_flashif_crtrmm_field_t;

/******************************************************************************
* UNIQUE_ID_MODULE
******************************************************************************/
/* Unique ID register bit fields */
typedef struct stc_uid_uidr0_field
{
       uint32_t RESERVED0  : 4;
  __IO uint32_t UID0       :28;
} stc_uid_uidr0_field_t;

typedef struct stc_unique_id_uidr1_field
{
  __IO uint32_t UID1       :13;
} stc_uid_uidr1_field_t;

/******************************************************************************
 * Clock_Reset_MODULE
 ******************************************************************************/
/* Clock_Reset_MODULE register bit fields */
typedef struct stc_crg_scm_ctl_field
{
  __IO  uint8_t HCRE       : 1;
  __IO  uint8_t MOSCE      : 1;
        uint8_t RESERVED2  : 1;
  __IO  uint8_t SOSCE      : 1;
  __IO  uint8_t PLLE       : 1;
  __IO  uint8_t RCS        : 3;
} stc_crg_scm_ctl_field_t;

typedef struct stc_crg_scm_str_field
{
  __IO  uint8_t HCRDY      : 1;
  __IO  uint8_t MORDY      : 1;
        uint8_t RESERVED2  : 1;
  __IO  uint8_t SORDY      : 1;
  __IO  uint8_t PLRDY      : 1;
  __IO  uint8_t RCM        : 3;
} stc_crg_scm_str_field_t;

typedef struct stc_crg_stb_ctl_field
{
  __IO uint32_t STM        : 2;
  __IO uint32_t DSTM       : 1;
       uint32_t RESERVED3  : 1;
  __IO uint32_t SPL        : 1;
       uint32_t RESERVED5  :11;
  __IO uint32_t KEY        :16;
} stc_crg_stb_ctl_field_t;

typedef struct stc_crg_rst_str_field
{
  __IO uint16_t PONR       : 1;
  __IO uint16_t INITX      : 1;
       uint16_t RESERVED2  : 2;
  __IO uint16_t SWDT       : 1;
  __IO uint16_t HWDT       : 1;
  __IO uint16_t CSVR       : 1;
  __IO uint16_t FCSR       : 1;
  __IO uint16_t SRST       : 1;
} stc_crg_rst_str_field_t;

typedef struct stc_crg_bsc_psr_field
{
  __IO  uint8_t BSR        : 3;
} stc_crg_bsc_psr_field_t;

typedef struct stc_crg_apbc0_psr_field
{
  __IO  uint8_t APBC0      : 2;
} stc_crg_apbc0_psr_field_t;

typedef struct stc_crg_apbc1_psr_field
{
  __IO  uint8_t APBC1      : 2;
        uint8_t RESERVED2  : 2;
  __IO  uint8_t APBC1RST   : 1;
        uint8_t RESERVED5  : 2;
  __IO  uint8_t APBC1EN    : 1;
} stc_crg_apbc1_psr_field_t;

typedef struct stc_crg_swc_psr_field
{
  __IO  uint8_t SWDS       : 2;
        uint8_t RESERVED2  : 5;
  __IO  uint8_t TESTB      : 1;
} stc_crg_swc_psr_field_t;

typedef struct stc_crg_csw_tmr_field
{
  __IO  uint8_t MOWT       : 4;
  __IO  uint8_t SOWT       : 4;
} stc_crg_csw_tmr_field_t;

typedef struct stc_crg_psw_tmr_field
{
  __IO  uint8_t POWT       : 3;
        uint8_t RESERVED3  : 1;
  __IO  uint8_t PINC       : 1;
} stc_crg_psw_tmr_field_t;

typedef struct stc_crg_pll_ctl1_field
{
  __IO  uint8_t PLLM       : 4;
  __IO  uint8_t PLLK       : 4;
} stc_crg_pll_ctl1_field_t;

typedef struct stc_crg_pll_ctl2_field
{
  __IO  uint8_t PLLN       : 6;
} stc_crg_pll_ctl2_field_t;

typedef struct stc_crg_csv_ctl_field
{
  __IO uint16_t MCSVE      : 1;
  __IO uint16_t SCSVE      : 1;
       uint16_t RESERVED2  : 6;
  __IO uint16_t FCSDE      : 1;
  __IO uint16_t FCSRE      : 1;
       uint16_t RESERVED10 : 2;
  __IO uint16_t FCD        : 3;
} stc_crg_csv_ctl_field_t;

typedef struct stc_crg_csv_str_field
{
  __IO  uint8_t MCMF       : 1;
  __IO  uint8_t SCMF       : 1;
} stc_crg_csv_str_field_t;

typedef struct stc_crg_dbwdt_ctl_field
{
        uint8_t RESERVED0  : 5;
  __IO  uint8_t DPSWBE     : 1;
        uint8_t RESERVED6  : 1;
  __IO  uint8_t DPHWBE     : 1;
} stc_crg_dbwdt_ctl_field_t;

typedef struct stc_crg_int_enr_field
{
  __IO  uint8_t MCSE       : 1;
  __IO  uint8_t SCSE       : 1;
  __IO  uint8_t PCSE       : 1;
        uint8_t RESERVED3  : 2;
  __IO  uint8_t FCSE       : 1;
} stc_crg_int_enr_field_t;

typedef struct stc_crg_int_str_field
{
  __IO  uint8_t MCSI       : 1;
  __IO  uint8_t SCSI       : 1;
  __IO  uint8_t PCSI       : 1;
        uint8_t RESERVED3  : 2;
  __IO  uint8_t FCSI       : 1;
} stc_crg_int_str_field_t;

typedef struct stc_crg_int_clr_field
{
  __IO  uint8_t MCSC       : 1;
  __IO  uint8_t SCSC       : 1;
  __IO  uint8_t PCSC       : 1;
        uint8_t RESERVED3  : 2;
  __IO  uint8_t FCSC       : 1;
} stc_crg_int_clr_field_t;

