furjie/Single-BLDC-driver-and-app/s6e1a1.h
typedef struct stc_mft_ocu_ocsd54_field
{
  __IO  uint8_t OCCP0BUFE  : 2;
  __IO  uint8_t OCCP1BUFE  : 2;
  __IO  uint8_t OCSE0BUFE  : 2;
  __IO  uint8_t OCSE1BUFE  : 2;
} stc_mft_ocu_ocsd54_field_t;

typedef struct stc_mft_ocu_ocsc_field
{
  __IO  uint8_t MOD0       : 1;
  __IO  uint8_t MOD1       : 1;
  __IO  uint8_t MOD2       : 1;
  __IO  uint8_t MOD3       : 1;
  __IO  uint8_t MOD4       : 1;
  __IO  uint8_t MOD5       : 1;
} stc_mft_ocu_ocsc_field_t;

typedef struct stc_mft_ocu_ocse0_field
{
  __IO uint16_t OCSE0      : 1;
  __IO uint16_t OCSE1      : 1;
  __IO uint16_t OCSE2      : 1;
  __IO uint16_t OCSE3      : 1;
  __IO uint16_t OCSE4      : 1;
  __IO uint16_t OCSE5      : 1;
  __IO uint16_t OCSE6      : 1;
  __IO uint16_t OCSE7      : 1;
  __IO uint16_t OCSE8      : 1;
  __IO uint16_t OCSE9      : 1;
  __IO uint16_t OCSE10     : 1;
  __IO uint16_t OCSE11     : 1;
  __IO uint16_t OCSE12     : 1;
  __IO uint16_t OCSE13     : 1;
  __IO uint16_t OCSE14     : 1;
  __IO uint16_t OCSE15     : 1;
} stc_mft_ocu_ocse0_field_t;

typedef struct stc_mft_ocu_ocse1_field
{
  __IO uint32_t OCSE0      : 1;
  __IO uint32_t OCSE1      : 1;
  __IO uint32_t OCSE2      : 1;
  __IO uint32_t OCSE3      : 1;
  __IO uint32_t OCSE4      : 1;
  __IO uint32_t OCSE5      : 1;
  __IO uint32_t OCSE6      : 1;
  __IO uint32_t OCSE7      : 1;
  __IO uint32_t OCSE8      : 1;
  __IO uint32_t OCSE9      : 1;
  __IO uint32_t OCSE10     : 1;
  __IO uint32_t OCSE11     : 1;
  __IO uint32_t OCSE12     : 1;
  __IO uint32_t OCSE13     : 1;
  __IO uint32_t OCSE14     : 1;
  __IO uint32_t OCSE15     : 1;
  __IO uint32_t OCSE16     : 1;
  __IO uint32_t OCSE17     : 1;
  __IO uint32_t OCSE18     : 1;
  __IO uint32_t OCSE19     : 1;
  __IO uint32_t OCSE20     : 1;
  __IO uint32_t OCSE21     : 1;
  __IO uint32_t OCSE22     : 1;
  __IO uint32_t OCSE23     : 1;
  __IO uint32_t OCSE24     : 1;
  __IO uint32_t OCSE25     : 1;
  __IO uint32_t OCSE26     : 1;
  __IO uint32_t OCSE27     : 1;
  __IO uint32_t OCSE28     : 1;
  __IO uint32_t OCSE29     : 1;
  __IO uint32_t OCSE30     : 1;
  __IO uint32_t OCSE31     : 1;
} stc_mft_ocu_ocse1_field_t;

typedef struct stc_mft_ocu_ocse2_field
{
  __IO uint16_t OCSE0      : 1;
  __IO uint16_t OCSE1      : 1;
  __IO uint16_t OCSE2      : 1;
  __IO uint16_t OCSE3      : 1;
  __IO uint16_t OCSE4      : 1;
  __IO uint16_t OCSE5      : 1;
  __IO uint16_t OCSE6      : 1;
  __IO uint16_t OCSE7      : 1;
  __IO uint16_t OCSE8      : 1;
  __IO uint16_t OCSE9      : 1;
  __IO uint16_t OCSE10     : 1;
  __IO uint16_t OCSE11     : 1;
  __IO uint16_t OCSE12     : 1;
  __IO uint16_t OCSE13     : 1;
  __IO uint16_t OCSE14     : 1;
  __IO uint16_t OCSE15     : 1;
} stc_mft_ocu_ocse2_field_t;

typedef struct stc_mft_ocu_ocse3_field
{
  __IO uint32_t OCSE0      : 1;
  __IO uint32_t OCSE1      : 1;
  __IO uint32_t OCSE2      : 1;
  __IO uint32_t OCSE3      : 1;
  __IO uint32_t OCSE4      : 1;
  __IO uint32_t OCSE5      : 1;
  __IO uint32_t OCSE6      : 1;
  __IO uint32_t OCSE7      : 1;
  __IO uint32_t OCSE8      : 1;
  __IO uint32_t OCSE9      : 1;
  __IO uint32_t OCSE10     : 1;
  __IO uint32_t OCSE11     : 1;
  __IO uint32_t OCSE12     : 1;
  __IO uint32_t OCSE13     : 1;
  __IO uint32_t OCSE14     : 1;
  __IO uint32_t OCSE15     : 1;
  __IO uint32_t OCSE16     : 1;
  __IO uint32_t OCSE17     : 1;
  __IO uint32_t OCSE18     : 1;
  __IO uint32_t OCSE19     : 1;
  __IO uint32_t OCSE20     : 1;
  __IO uint32_t OCSE21     : 1;
  __IO uint32_t OCSE22     : 1;
  __IO uint32_t OCSE23     : 1;
  __IO uint32_t OCSE24     : 1;
  __IO uint32_t OCSE25     : 1;
  __IO uint32_t OCSE26     : 1;
  __IO uint32_t OCSE27     : 1;
  __IO uint32_t OCSE28     : 1;
  __IO uint32_t OCSE29     : 1;
  __IO uint32_t OCSE30     : 1;
  __IO uint32_t OCSE31     : 1;
} stc_mft_ocu_ocse3_field_t;

typedef struct stc_mft_ocu_ocse4_field
{
  __IO uint16_t OCSE0      : 1;
  __IO uint16_t OCSE1      : 1;
  __IO uint16_t OCSE2      : 1;
  __IO uint16_t OCSE3      : 1;
  __IO uint16_t OCSE4      : 1;
  __IO uint16_t OCSE5      : 1;
  __IO uint16_t OCSE6      : 1;
  __IO uint16_t OCSE7      : 1;
  __IO uint16_t OCSE8      : 1;
  __IO uint16_t OCSE9      : 1;
  __IO uint16_t OCSE10     : 1;
  __IO uint16_t OCSE11     : 1;
  __IO uint16_t OCSE12     : 1;
  __IO uint16_t OCSE13     : 1;
  __IO uint16_t OCSE14     : 1;
  __IO uint16_t OCSE15     : 1;
} stc_mft_ocu_ocse4_field_t;

typedef struct stc_mft_ocu_ocse5_field
{
  __IO uint32_t OCSE0      : 1;
  __IO uint32_t OCSE1      : 1;
  __IO uint32_t OCSE2      : 1;
  __IO uint32_t OCSE3      : 1;
  __IO uint32_t OCSE4      : 1;
  __IO uint32_t OCSE5      : 1;
  __IO uint32_t OCSE6      : 1;
  __IO uint32_t OCSE7      : 1;
  __IO uint32_t OCSE8      : 1;
  __IO uint32_t OCSE9      : 1;
  __IO uint32_t OCSE10     : 1;
  __IO uint32_t OCSE11     : 1;
  __IO uint32_t OCSE12     : 1;
  __IO uint32_t OCSE13     : 1;
  __IO uint32_t OCSE14     : 1;
  __IO uint32_t OCSE15     : 1;
  __IO uint32_t OCSE16     : 1;
  __IO uint32_t OCSE17     : 1;
  __IO uint32_t OCSE18     : 1;
  __IO uint32_t OCSE19     : 1;
  __IO uint32_t OCSE20     : 1;
  __IO uint32_t OCSE21     : 1;
  __IO uint32_t OCSE22     : 1;
  __IO uint32_t OCSE23     : 1;
  __IO uint32_t OCSE24     : 1;
  __IO uint32_t OCSE25     : 1;
  __IO uint32_t OCSE26     : 1;
  __IO uint32_t OCSE27     : 1;
  __IO uint32_t OCSE28     : 1;
  __IO uint32_t OCSE29     : 1;
  __IO uint32_t OCSE30     : 1;
  __IO uint32_t OCSE31     : 1;
} stc_mft_ocu_ocse5_field_t;


typedef struct stc_mft_ocu_ocfs10_field
{
  __IO  uint8_t FSO0       : 4;
  __IO  uint8_t FSO1       : 4;
} stc_mft_ocu_ocfs10_field_t;

typedef struct stc_mft_ocu_ocfs32_field
{
  __IO  uint8_t FSO0       : 4;
  __IO  uint8_t FSO1       : 4;
} stc_mft_ocu_ocfs32_field_t;

typedef struct stc_mft_ocu_ocfs54_field
{
  __IO  uint8_t FSO0       : 4;
  __IO  uint8_t FSO1       : 4;
} stc_mft_ocu_ocfs54_field_t;

