furjie/Single-BLDC-driver-and-app/s6e1a1.h
/******************************************************************************
 * MFT_WFG_MODULE
 ******************************************************************************/
/* MFT_WFG_MODULE register bit fields */
typedef struct stc_mft_wfg_wfsa10_field
{
  __IO uint16_t DCK        : 3;
  __IO uint16_t TMD        : 3;
  __IO uint16_t GTEN       : 2;
  __IO uint16_t PSEL       : 2;
  __IO uint16_t PGEN       : 2;
  __IO uint16_t DMOD       : 2;
} stc_mft_wfg_wfsa10_field_t;

typedef struct stc_mft_wfg_wfsa32_field
{
  __IO uint16_t DCK        : 3;
  __IO uint16_t TMD        : 3;
  __IO uint16_t GTEN       : 2;
  __IO uint16_t PSEL       : 2;
  __IO uint16_t PGEN       : 2;
  __IO uint16_t DMOD       : 2;
} stc_mft_wfg_wfsa32_field_t;

typedef struct stc_mft_wfg_wfsa54_field
{
  __IO uint16_t DCK        : 3;
  __IO uint16_t TMD        : 3;
  __IO uint16_t GTEN       : 2;
  __IO uint16_t PSEL       : 2;
  __IO uint16_t PGEN       : 2;
  __IO uint16_t DMOD       : 2;
} stc_mft_wfg_wfsa54_field_t;

typedef struct stc_mft_wfg_wfir_field
{
  __IO uint16_t DTIFA      : 1;
  __IO uint16_t DTICA      : 1;
  __IO uint16_t DTIFB      : 1;
  __IO uint16_t DTICB      : 1;
  __IO uint16_t TMIF10     : 1;
  __IO uint16_t TMIC10     : 1;
  __IO uint16_t TMIE10     : 1;
  __IO uint16_t TMIS10     : 1;
  __IO uint16_t TMIF32     : 1;
  __IO uint16_t TMIC32     : 1;
  __IO uint16_t TMIE32     : 1;
  __IO uint16_t TMIS32     : 1;
  __IO uint16_t TMIF54     : 1;
  __IO uint16_t TMIC54     : 1;
  __IO uint16_t TMIE54     : 1;
  __IO uint16_t TMIS54     : 1;
} stc_mft_wfg_wfir_field_t;

typedef struct stc_mft_wfg_nzcl_field
{
  __IO uint16_t DTIEA      : 1;
  __IO uint16_t NWS        : 3;
  __IO uint16_t SDTI       : 1;
  __IO uint16_t DTIEB      : 1;
       uint16_t RESERVED6  : 2;
  __IO uint16_t DIMA       : 1;
  __IO uint16_t DIMB       : 1;
       uint16_t RESERVED10 : 2;
  __IO uint16_t WIM10      : 1;
  __IO uint16_t WIM32      : 1;
  __IO uint16_t WIM54      : 1;
} stc_mft_wfg_nzcl_field_t;

/******************************************************************************
 * MFT_ICU_MODULE
 ******************************************************************************/
/* MFT_ICU_MODULE register bit fields */
typedef struct stc_mft_icu_icfs10_field
{
  __IO  uint8_t FSI0       : 4;
  __IO  uint8_t FSI1       : 4;
} stc_mft_icu_icfs10_field_t;

typedef struct stc_mft_icu_icfs32_field
{
  __IO  uint8_t FSI0       : 4;
  __IO  uint8_t FSI1       : 4;
} stc_mft_icu_icfs32_field_t;

typedef struct stc_mft_icu_icsa10_field
{
  __IO  uint8_t EG0        : 2;
  __IO  uint8_t EG1        : 2;
  __IO  uint8_t ICE0       : 1;
  __IO  uint8_t ICE1       : 1;
  __IO  uint8_t ICP0       : 1;
  __IO  uint8_t ICP1       : 1;
} stc_mft_icu_icsa10_field_t;

typedef struct stc_mft_icu_icsb10_field
{
  __IO  uint8_t IEI0       : 1;
  __IO  uint8_t IEI1       : 1;
} stc_mft_icu_icsb10_field_t;

typedef struct stc_mft_icu_icsa32_field
{
  __IO  uint8_t EG0        : 2;
  __IO  uint8_t EG1        : 2;
  __IO  uint8_t ICE0       : 1;
  __IO  uint8_t ICE1       : 1;
  __IO  uint8_t ICP0       : 1;
  __IO  uint8_t ICP1       : 1;
} stc_mft_icu_icsa32_field_t;

typedef struct stc_mft_icu_icsb32_field
{
  __IO  uint8_t IEI0       : 1;
  __IO  uint8_t IEI1       : 1;
} stc_mft_icu_icsb32_field_t;

/******************************************************************************
 * MFT_ADCMP_MODULE
 ******************************************************************************/
/* MFT_ADCMP_MODULE register bit fields */
typedef struct stc_mft_adcmp_acfs10_field
{
  __IO  uint8_t FSA0       : 4;
  __IO  uint8_t FSA1       : 4;
} stc_mft_adcmp_acfs10_field_t;

typedef struct stc_mft_adcmp_acfs32_field
{
  __IO  uint8_t FSA0       : 4;
  __IO  uint8_t FSA1       : 4;
} stc_mft_adcmp_acfs32_field_t;

typedef struct stc_mft_adcmp_acfs54_field
{
  __IO  uint8_t FSA0       : 4;
  __IO  uint8_t FSA1       : 4;
} stc_mft_adcmp_acfs54_field_t;

typedef struct stc_mft_adcmp_acmp0_field
{
  __IO uint16_t ACMP       :16;
} stc_mft_adcmp_acmp0_field_t;

typedef struct stc_mft_adcmp_acmp1_field
{
  __IO uint16_t ACMP       :16;
} stc_mft_adcmp_acmp1_field_t;

typedef struct stc_mft_adcmp_acmp2_field
{
  __IO uint16_t ACMP       :16;
} stc_mft_adcmp_acmp2_field_t;

typedef struct stc_mft_adcmp_acmp3_field
{
  __IO uint16_t ACMP       :16;
} stc_mft_adcmp_acmp3_field_t;

typedef struct stc_mft_adcmp_acmp4_field
{
  __IO uint16_t ACMP       :16;
} stc_mft_adcmp_acmp4_field_t;

typedef struct stc_mft_adcmp_acmp5_field
{
  __IO uint16_t ACMP       :16;
} stc_mft_adcmp_acmp5_field_t;

typedef struct stc_mft_adcmp_acsa_field
{
  __IO uint16_t CE10      : 2;
  __IO uint16_t CE32      : 2;
  __IO uint16_t CE54      : 2;
       uint16_t RESERVED6  : 2;
  __IO uint16_t SEL10     : 2;
  __IO uint16_t SEL32     : 2;
  __IO uint16_t SEL54     : 2;
} stc_mft_adcmp_acsa_field_t;

typedef struct stc_mft_adcmp_acsc0_field
{
  __IO  uint8_t BUFE       : 2;
  __IO  uint8_t ADSEL      : 3;
} stc_mft_adcmp_acsc0_field_t;

typedef struct stc_mft_adcmp_acsd0_field
{
  __IO  uint8_t AMOD       : 1;
  __IO  uint8_t OCUS       : 1;
        uint8_t RESERVED2  : 2;
  __IO  uint8_t DE         : 1;
  __IO  uint8_t PE         : 1;
  __IO  uint8_t UE         : 1;
  __IO  uint8_t ZE         : 1;
} stc_mft_adcmp_acsd0_field_t;

typedef struct stc_mft_adcmp_acsc1_field
{
  __IO  uint8_t BUFE       : 2;
  __IO  uint8_t ADSEL      : 3;
} stc_mft_adcmp_acsc1_field_t;

typedef struct stc_mft_adcmp_acsd1_field
{
  __IO  uint8_t AMOD       : 1;
  __IO  uint8_t OCUS       : 1;
        uint8_t RESERVED2  : 2;
  __IO  uint8_t DE         : 1;
  __IO  uint8_t PE         : 1;
  __IO  uint8_t UE         : 1;
  __IO  uint8_t ZE         : 1;
} stc_mft_adcmp_acsd1_field_t;

typedef struct stc_mft_adcmp_acsc2_field
{
  __IO  uint8_t BUFE       : 2;
  __IO  uint8_t ADSEL      : 3;
} stc_mft_adcmp_acsc2_field_t;

