furjie/Single-BLDC-driver-and-app/s6e1a1.h
typedef struct stc_mft_adcmp_acsd2_field
{
  __IO  uint8_t AMOD       : 1;
  __IO  uint8_t OCUS       : 1;
        uint8_t RESERVED2  : 2;
  __IO  uint8_t DE         : 1;
  __IO  uint8_t PE         : 1;
  __IO  uint8_t UE         : 1;
  __IO  uint8_t ZE         : 1;
} stc_mft_adcmp_acsd2_field_t;

typedef struct stc_mft_adcmp_acsc3_field
{
  __IO  uint8_t BUFE       : 2;
  __IO  uint8_t ADSEL      : 3;
} stc_mft_adcmp_acsc3_field_t;

typedef struct stc_mft_adcmp_acsd3_field
{
  __IO  uint8_t AMOD       : 1;
  __IO  uint8_t OCUS       : 1;
        uint8_t RESERVED2  : 2;
  __IO  uint8_t DE         : 1;
  __IO  uint8_t PE         : 1;
  __IO  uint8_t UE         : 1;
  __IO  uint8_t ZE         : 1;
} stc_mft_adcmp_acsd3_field_t;

typedef struct stc_mft_adcmp_acsc4_field
{
  __IO  uint8_t BUFE       : 2;
  __IO  uint8_t ADSEL      : 3;
} stc_mft_adcmp_acsc4_field_t;

typedef struct stc_mft_adcmp_acsd4_field
{
  __IO  uint8_t AMOD       : 1;
  __IO  uint8_t OCUS       : 1;
        uint8_t RESERVED2  : 2;
  __IO  uint8_t DE         : 1;
  __IO  uint8_t PE         : 1;
  __IO  uint8_t UE         : 1;
  __IO  uint8_t ZE         : 1;
} stc_mft_adcmp_acsd4_field_t;

typedef struct stc_mft_adcmp_acsc5_field
{
  __IO  uint8_t BUFE       : 2;
  __IO  uint8_t ADSEL      : 3;
} stc_mft_adcmp_acsc5_field_t;

typedef struct stc_mft_adcmp_acsd5_field
{
  __IO  uint8_t AMOD       : 1;
  __IO  uint8_t OCUS       : 1;
        uint8_t RESERVED2  : 2;
  __IO  uint8_t DE         : 1;
  __IO  uint8_t PE         : 1;
  __IO  uint8_t UE         : 1;
  __IO  uint8_t ZE         : 1;
} stc_mft_adcmp_acsd5_field_t;

/******************************************************************************
 * MFT_PPG_MODULE
 ******************************************************************************/
/* MFT_PPG_MODULE register bit fields */
typedef struct stc_mft_ppg_ttcr0_field
{
  __IO uint8_t STR0       : 1;
  __IO uint8_t MONI0      : 1;
  __IO uint8_t CS00       : 1;
  __IO uint8_t CS01       : 1;
  __IO uint8_t TRG0O      : 1;
  __IO uint8_t TRG2O      : 1;
  __IO uint8_t TRG4O      : 1;
  __IO uint8_t RG6O       : 1;
} stc_mft_ppg_ttcr0_field_t;

typedef struct stc_mft_ppg_ttcr1_field
{
  __IO uint8_t STR1       : 1;
  __IO uint8_t MONI1      : 1;
  __IO uint8_t CS10       : 1;
  __IO uint8_t CS11       : 1;
  __IO uint8_t TRG1O      : 1;
  __IO uint8_t TRG3O      : 1;
  __IO uint8_t TRG5O      : 1;
  __IO uint8_t TRG7O      : 1;
} stc_mft_ppg_ttcr1_field_t;

typedef struct stc_mft_ppg_ttcr2_field
{
  __IO uint8_t STR2       : 1;
  __IO uint8_t MONI2      : 1;
  __IO uint8_t CS20       : 1;
  __IO uint8_t CS21       : 1;
  __IO uint8_t TRG16O     : 1;
  __IO uint8_t TRG18O     : 1;
  __IO uint8_t TRG20O     : 1;
  __IO uint8_t TRG22O     : 1;
} stc_mft_ppg_ttcr2_field_t;

typedef struct stc_mft_ppg_trg0_field
{
  __IO uint16_t PEN00      : 1;
  __IO uint16_t PEN01      : 1;
  __IO uint16_t PEN02      : 1;
  __IO uint16_t PEN03      : 1;
  __IO uint16_t PEN04      : 1;
  __IO uint16_t PEN05      : 1;
  __IO uint16_t PEN06      : 1;
  __IO uint16_t PEN07      : 1;
  __IO uint16_t PEN08      : 1;
  __IO uint16_t PEN09      : 1;
  __IO uint16_t PEN10      : 1;
  __IO uint16_t PEN11      : 1;
  __IO uint16_t PEN12      : 1;
  __IO uint16_t PEN13      : 1;
  __IO uint16_t PEN14      : 1;
  __IO uint16_t PEN15      : 1;
} stc_mft_ppg_trg0_field_t;

typedef struct stc_mft_ppg_revc0_field
{
  __IO uint16_t REV00      : 1;
  __IO uint16_t REV01      : 1;
  __IO uint16_t REV02      : 1;
  __IO uint16_t REV03      : 1;
  __IO uint16_t REV04      : 1;
  __IO uint16_t REV05      : 1;
  __IO uint16_t REV06      : 1;
  __IO uint16_t REV07      : 1;
  __IO uint16_t REV08      : 1;
  __IO uint16_t REV09      : 1;
  __IO uint16_t REV10      : 1;
  __IO uint16_t REV11      : 1;
  __IO uint16_t REV12      : 1;
  __IO uint16_t REV13      : 1;
  __IO uint16_t REV14      : 1;
  __IO uint16_t REV15      : 1;
} stc_mft_ppg_revc0_field_t;

typedef struct stc_mft_ppg_trg1_field
{
  __IO uint16_t PEN16      : 1;
  __IO uint16_t PEN17      : 1;
  __IO uint16_t PEN18      : 1;
  __IO uint16_t PEN19      : 1;
  __IO uint16_t PEN20      : 1;
  __IO uint16_t PEN21      : 1;
  __IO uint16_t PEN22      : 1;
  __IO uint16_t PEN23      : 1;
} stc_mft_ppg_trg1_field_t;

typedef struct stc_mft_ppg_revc1_field
{
  __IO uint16_t REV16      : 1;
  __IO uint16_t REV17      : 1;
  __IO uint16_t REV18      : 1;
  __IO uint16_t REV19      : 1;
  __IO uint16_t REV20      : 1;
  __IO uint16_t REV21      : 1;
  __IO uint16_t REV22      : 1;
  __IO uint16_t REV23      : 1;
} stc_mft_ppg_revc1_field_t;

typedef struct stc_mft_ppg_ppgc1_field
{
        uint8_t RESERVED0  : 3;
  __IO  uint8_t PCS        : 2;
  __IO  uint8_t INTM       : 1;
  __IO  uint8_t PUF        : 1;
  __IO  uint8_t PIE        : 1;
} stc_mft_ppg_ppgc1_field_t;

typedef struct stc_mft_ppg_ppgc0_field
{
  __IO  uint8_t TTRG       : 1;
  __IO  uint8_t MD         : 2;
  __IO  uint8_t PCS        : 2;
  __IO  uint8_t INTM       : 1;
  __IO  uint8_t PUF        : 1;
  __IO  uint8_t PIE        : 1;
} stc_mft_ppg_ppgc0_field_t;

typedef struct stc_mft_ppg_ppgc3_field
{
        uint8_t RESERVED0  : 3;
  __IO  uint8_t PCS        : 2;
  __IO  uint8_t INTM       : 1;
  __IO  uint8_t PUF        : 1;
  __IO  uint8_t PIE        : 1;
} stc_mft_ppg_ppgc3_field_t;

typedef struct stc_mft_ppg_ppgc2_field
{
  __IO  uint8_t TTRG       : 1;
  __IO  uint8_t MD         : 2;
  __IO  uint8_t PCS        : 2;
  __IO  uint8_t INTM       : 1;
  __IO  uint8_t PUF        : 1;
  __IO  uint8_t PIE        : 1;
} stc_mft_ppg_ppgc2_field_t;

typedef struct stc_mft_ppg_prll0_field
{
  __IO  uint8_t PRLL0      : 1;
  __IO  uint8_t PRLL1      : 1;
  __IO  uint8_t PRLL2      : 1;
  __IO  uint8_t PRLL3      : 1;
  __IO  uint8_t PRLL4      : 1;
  __IO  uint8_t PRLL5      : 1;
  __IO  uint8_t PRLL6      : 1;
  __IO  uint8_t PRLL7      : 1;
} stc_mft_ppg_prll0_field_t;

typedef struct stc_mft_ppg_prlh0_field
{
  __IO  uint8_t PRLH0      : 1;
  __IO  uint8_t PRLH1      : 1;
  __IO  uint8_t PRLH2      : 1;
  __IO  uint8_t PRLH3      : 1;
  __IO  uint8_t PRLH4      : 1;
  __IO  uint8_t PRLH5      : 1;
  __IO  uint8_t PRLH6      : 1;
  __IO  uint8_t PRLH7      : 1;
} stc_mft_ppg_prlh0_field_t;

