furjie/Single-BLDC-driver-and-app/s6e1a1.h
typedef struct stc_mft_ppg_prll1_field
{
  __IO  uint8_t PRLL0      : 1;
  __IO  uint8_t PRLL1      : 1;
  __IO  uint8_t PRLL2      : 1;
  __IO  uint8_t PRLL3      : 1;
  __IO  uint8_t PRLL4      : 1;
  __IO  uint8_t PRLL5      : 1;
  __IO  uint8_t PRLL6      : 1;
  __IO  uint8_t PRLL7      : 1;
} stc_mft_ppg_prll1_field_t;

typedef struct stc_mft_ppg_prlh1_field
{
  __IO  uint8_t PRLH0      : 1;
  __IO  uint8_t PRLH1      : 1;
  __IO  uint8_t PRLH2      : 1;
  __IO  uint8_t PRLH3      : 1;
  __IO  uint8_t PRLH4      : 1;
  __IO  uint8_t PRLH5      : 1;
  __IO  uint8_t PRLH6      : 1;
  __IO  uint8_t PRLH7      : 1;
} stc_mft_ppg_prlh1_field_t;

typedef struct stc_mft_ppg_prll2_field
{
  __IO  uint8_t PRLL0      : 1;
  __IO  uint8_t PRLL1      : 1;
  __IO  uint8_t PRLL2      : 1;
  __IO  uint8_t PRLL3      : 1;
  __IO  uint8_t PRLL4      : 1;
  __IO  uint8_t PRLL5      : 1;
  __IO  uint8_t PRLL6      : 1;
  __IO  uint8_t PRLL7      : 1;
} stc_mft_ppg_prll2_field_t;

typedef struct stc_mft_ppg_prlh2_field
{
  __IO  uint8_t PRLH0      : 1;
  __IO  uint8_t PRLH1      : 1;
  __IO  uint8_t PRLH2      : 1;
  __IO  uint8_t PRLH3      : 1;
  __IO  uint8_t PRLH4      : 1;
  __IO  uint8_t PRLH5      : 1;
  __IO  uint8_t PRLH6      : 1;
  __IO  uint8_t PRLH7      : 1;
} stc_mft_ppg_prlh2_field_t;

typedef struct stc_mft_ppg_prll3_field
{
  __IO  uint8_t PRLL0      : 1;
  __IO  uint8_t PRLL1      : 1;
  __IO  uint8_t PRLL2      : 1;
  __IO  uint8_t PRLL3      : 1;
  __IO  uint8_t PRLL4      : 1;
  __IO  uint8_t PRLL5      : 1;
  __IO  uint8_t PRLL6      : 1;
  __IO  uint8_t PRLL7      : 1;
} stc_mft_ppg_prll3_field_t;

typedef struct stc_mft_ppg_prlh3_field
{
  __IO  uint8_t PRLH0      : 1;
  __IO  uint8_t PRLH1      : 1;
  __IO  uint8_t PRLH2      : 1;
  __IO  uint8_t PRLH3      : 1;
  __IO  uint8_t PRLH4      : 1;
  __IO  uint8_t PRLH5      : 1;
  __IO  uint8_t PRLH6      : 1;
  __IO  uint8_t PRLH7      : 1;
} stc_mft_ppg_prlh3_field_t;

typedef struct stc_mft_ppg_gatec0_field
{
  __IO  uint8_t EDGE0      : 1;
  __IO  uint8_t STRG0      : 1;
        uint8_t RESERVED2  : 2;
  __IO  uint8_t EDGE2      : 1;
  __IO  uint8_t STRG2      : 1;
} stc_mft_ppg_gatec0_field_t;

typedef struct stc_mft_ppg_ppgc5_field
{
        uint8_t RESERVED0  : 3;
  __IO  uint8_t PCS        : 2;
  __IO  uint8_t INTM       : 1;
  __IO  uint8_t PUF        : 1;
  __IO  uint8_t PIE        : 1;
} stc_mft_ppg_ppgc5_field_t;

typedef struct stc_mft_ppg_ppgc4_field
{
  __IO  uint8_t TTRG       : 1;
  __IO  uint8_t MD         : 2;
  __IO  uint8_t PCS        : 2;
  __IO  uint8_t INTM       : 1;
  __IO  uint8_t PUF        : 1;
  __IO  uint8_t PIE        : 1;
} stc_mft_ppg_ppgc4_field_t;

typedef struct stc_mft_ppg_ppgc7_field
{
        uint8_t RESERVED0  : 3;
  __IO  uint8_t PCS        : 2;
  __IO  uint8_t INTM       : 1;
  __IO  uint8_t PUF        : 1;
  __IO  uint8_t PIE        : 1;
} stc_mft_ppg_ppgc7_field_t;

typedef struct stc_mft_ppg_ppgc6_field
{
  __IO  uint8_t TTRG       : 1;
  __IO  uint8_t MD         : 2;
  __IO  uint8_t PCS        : 2;
  __IO  uint8_t INTM       : 1;
  __IO  uint8_t PUF        : 1;
  __IO  uint8_t PIE        : 1;
} stc_mft_ppg_ppgc6_field_t;

typedef struct stc_mft_ppg_prll4_field
{
  __IO  uint8_t PRLL       : 8;
} stc_mft_ppg_prll4_field_t;

typedef struct stc_mft_ppg_prlh4_field
{
  __IO  uint8_t PRLH       : 8;
} stc_mft_ppg_prlh4_field_t;

typedef struct stc_mft_ppg_prll5_field
{
  __IO  uint8_t PRLL       : 8;
} stc_mft_ppg_prll5_field_t;

typedef struct stc_mft_ppg_prlh5_field
{
  __IO  uint8_t PRLH       : 8;
} stc_mft_ppg_prlh5_field_t;

typedef struct stc_mft_ppg_prll6_field
{
  __IO  uint8_t PRLL       : 8;
} stc_mft_ppg_prll6_field_t;

typedef struct stc_mft_ppg_prlh6_field
{
  __IO  uint8_t PRLH       : 8;
} stc_mft_ppg_prlh6_field_t;

typedef struct stc_mft_ppg_prll7_field
{
  __IO  uint8_t PRLL       : 8;
} stc_mft_ppg_prll7_field_t;

typedef struct stc_mft_ppg_prlh7_field
{
  __IO  uint8_t PRLH       : 8;
} stc_mft_ppg_prlh7_field_t;

typedef struct stc_mft_ppg_gatec4_field
{
  __IO  uint8_t EDGE4      : 1;
  __IO  uint8_t STRG4      : 1;
        uint8_t RESERVED2  : 2;
  __IO  uint8_t EDGE6      : 1;
  __IO  uint8_t STRG6      : 1;
} stc_mft_ppg_gatec4_field_t;

typedef struct stc_mft_ppg_ppgc9_field
{
        uint8_t RESERVED0  : 3;
  __IO  uint8_t PCS        : 2;
  __IO  uint8_t INTM       : 1;
  __IO  uint8_t PUF        : 1;
  __IO  uint8_t PIE        : 1;
} stc_mft_ppg_ppgc9_field_t;

typedef struct stc_mft_ppg_ppgc8_field
{
  __IO  uint8_t TTRG       : 1;
  __IO  uint8_t MD         : 2;
  __IO  uint8_t PCS        : 2;
  __IO  uint8_t INTM       : 1;
  __IO  uint8_t PUF        : 1;
  __IO  uint8_t PIE        : 1;
} stc_mft_ppg_ppgc8_field_t;

typedef struct stc_mft_ppg_ppgc11_field
{
        uint8_t RESERVED0  : 3;
  __IO  uint8_t PCS        : 2;
  __IO  uint8_t INTM       : 1;
  __IO  uint8_t PUF        : 1;
  __IO  uint8_t PIE        : 1;
} stc_mft_ppg_ppgc11_field_t;

typedef struct stc_mft_ppg_ppgc10_field
{
  __IO  uint8_t TTRG       : 1;
  __IO  uint8_t MD         : 2;
  __IO  uint8_t PCS        : 2;
  __IO  uint8_t INTM       : 1;
  __IO  uint8_t PUF        : 1;
  __IO  uint8_t PIE        : 1;
} stc_mft_ppg_ppgc10_field_t;

typedef struct stc_mft_ppg_prll8_field
{
  __IO  uint8_t PRLL       : 8;
} stc_mft_ppg_prll8_field_t;

typedef struct stc_mft_ppg_prlh8_field
{
  __IO  uint8_t PRLH       : 8;
} stc_mft_ppg_prlh8_field_t;

typedef struct stc_mft_ppg_prll9_field
{
  __IO  uint8_t PRLL       : 8;
} stc_mft_ppg_prll9_field_t;

typedef struct stc_mft_ppg_prlh9_field
{
  __IO  uint8_t PRLH       : 8;
} stc_mft_ppg_prlh9_field_t;

typedef struct stc_mft_ppg_prll10_field
{
  __IO  uint8_t PRLL       : 8;
} stc_mft_ppg_prll10_field_t;

typedef struct stc_mft_ppg_prlh10_field
{
  __IO  uint8_t PRLH       : 8;
} stc_mft_ppg_prlh10_field_t;

typedef struct stc_mft_ppg_prll11_field
{
  __IO  uint8_t PRLL       : 8;
} stc_mft_ppg_prll11_field_t;

typedef struct stc_mft_ppg_prlh11_field
{
  __IO  uint8_t PRLH       : 8;
} stc_mft_ppg_prlh11_field_t;

typedef struct stc_mft_ppg_gatec8_field
{
  __IO  uint8_t EDGE8      : 1;
  __IO  uint8_t STRG8      : 1;
        uint8_t RESERVED2  : 2;
  __IO  uint8_t EDGE10     : 1;
  __IO  uint8_t STRG10     : 1;
} stc_mft_ppg_gatec8_field_t;

typedef struct stc_mft_ppg_ppgc13_field
{
        uint8_t RESERVED0  : 3;
  __IO  uint8_t PCS        : 2;
  __IO  uint8_t INTM       : 1;
  __IO  uint8_t PUF        : 1;
  __IO  uint8_t PIE        : 1;
} stc_mft_ppg_ppgc13_field_t;

typedef struct stc_mft_ppg_ppgc12_field
{
  __IO  uint8_t TTRG       : 1;
  __IO  uint8_t MD         : 2;
  __IO  uint8_t PCS        : 2;
  __IO  uint8_t INTM       : 1;
  __IO  uint8_t PUF        : 1;
  __IO  uint8_t PIE        : 1;
} stc_mft_ppg_ppgc12_field_t;

typedef struct stc_mft_ppg_ppgc15_field
{
        uint8_t RESERVED0  : 3;
  __IO  uint8_t PCS        : 2;
  __IO  uint8_t INTM       : 1;
  __IO  uint8_t PUF        : 1;
  __IO  uint8_t PIE        : 1;
} stc_mft_ppg_ppgc15_field_t;

typedef struct stc_mft_ppg_ppgc14_field
{
  __IO  uint8_t TTRG       : 1;
  __IO  uint8_t MD         : 2;
  __IO  uint8_t PCS        : 2;
  __IO  uint8_t INTM       : 1;
  __IO  uint8_t PUF        : 1;
  __IO  uint8_t PIE        : 1;
} stc_mft_ppg_ppgc14_field_t;

