furjie/Single-BLDC-driver-and-app/s6e1a1.h
/******************************************************************************
 * ADC12_MODULE
 ******************************************************************************/
/* ADC12_MODULE register bit fields */
typedef struct stc_adc0_adsr_field
{
  __IO  uint8_t SCS        : 1;
  __IO  uint8_t PCS        : 1;
  __IO  uint8_t PCNS       : 1;
        uint8_t RESERVED3  : 3;
  __IO  uint8_t FDAS       : 1;
  __IO  uint8_t ADSTP      : 1;
} stc_adc0_adsr_field_t;

typedef struct stc_adc0_adcr_field
{
  __IO  uint8_t OVRIE      : 1;
  __IO  uint8_t CMPIE      : 1;
  __IO  uint8_t PCIE       : 1;
  __IO  uint8_t SCIE       : 1;
        uint8_t RESERVED4  : 1;
  __IO  uint8_t CMPIF      : 1;
  __IO  uint8_t PCIF       : 1;
  __IO  uint8_t SCIF       : 1;
} stc_adc0_adcr_field_t;

typedef struct stc_adc0_sfns_field
{
  __IO  uint8_t SFS        : 4;
} stc_adc0_sfns_field_t;

typedef struct stc_adc0_sccr_field
{
  __IO  uint8_t SSTR       : 1;
  __IO  uint8_t SHEN       : 1;
  __IO  uint8_t RPT        : 1;
        uint8_t RESERVED3  : 1;
  __IO  uint8_t SFCLR      : 1;
  __IO  uint8_t SOVR       : 1;
  __IO  uint8_t SFUL       : 1;
  __IO  uint8_t SEMP       : 1;
} stc_adc0_sccr_field_t;

typedef struct stc_adc0_scfd_field
{
  __IO uint32_t SC         : 5;
       uint32_t RESERVED5  : 3;
  __IO uint32_t RS         : 2;
       uint32_t RESERVED10 : 2;
  __IO uint32_t INVL       : 1;
       uint32_t RESERVED13 : 7;
  __IO uint32_t SD         :12;
} stc_adc0_scfd_field_t;

typedef struct stc_adc0_scis2_field
{
  __IO  uint8_t AN16       : 1;
  __IO  uint8_t AN17       : 1;
  __IO  uint8_t AN18       : 1;
  __IO  uint8_t AN19       : 1;
  __IO  uint8_t AN20       : 1;
  __IO  uint8_t AN21       : 1;
  __IO  uint8_t AN22       : 1;
  __IO  uint8_t AN23       : 1;
} stc_adc0_scis2_field_t;

typedef struct stc_adc0_scis3_field
{
  __IO  uint8_t AN24       : 1;
  __IO  uint8_t AN25       : 1;
  __IO  uint8_t AN26       : 1;
  __IO  uint8_t AN27       : 1;
  __IO  uint8_t AN28       : 1;
  __IO  uint8_t AN29       : 1;
  __IO  uint8_t AN30       : 1;
  __IO  uint8_t AN31       : 1;
} stc_adc0_scis3_field_t;

typedef struct stc_adc0_scis0_field
{
  __IO  uint8_t AN0        : 1;
  __IO  uint8_t AN1        : 1;
  __IO  uint8_t AN2        : 1;
  __IO  uint8_t AN3        : 1;
  __IO  uint8_t AN4        : 1;
  __IO  uint8_t AN5        : 1;
  __IO  uint8_t AN6        : 1;
  __IO  uint8_t AN7        : 1;
} stc_adc0_scis0_field_t;

typedef struct stc_adc0_scis1_field
{
  __IO  uint8_t AN8        : 1;
  __IO  uint8_t AN9        : 1;
  __IO  uint8_t AN10       : 1;
  __IO  uint8_t AN11       : 1;
  __IO  uint8_t AN12       : 1;
  __IO  uint8_t AN13       : 1;
  __IO  uint8_t AN14       : 1;
  __IO  uint8_t AN15       : 1;
} stc_adc0_scis1_field_t;

typedef struct stc_adc0_pfns_field
{
  __IO  uint8_t PFS        : 2;
        uint8_t RESERVED2  : 2;
  __IO  uint8_t TEST       : 2;
} stc_adc0_pfns_field_t;

typedef struct stc_adc0_pccr_field
{
  __IO  uint8_t PSTR       : 1;
  __IO  uint8_t PHEN       : 1;
  __IO  uint8_t PEEN       : 1;
  __IO  uint8_t ESCE       : 1;
  __IO  uint8_t PFCLR      : 1;
  __IO  uint8_t POVR       : 1;
  __IO  uint8_t PFUL       : 1;
  __IO  uint8_t PEMP       : 1;
} stc_adc0_pccr_field_t;

typedef struct stc_adc0_pcfd_field
{
  __IO uint32_t PC         : 5;
       uint32_t RESERVED5  : 3;
  __IO uint32_t RS         : 3;
       uint32_t RESERVED11 : 1;
  __IO uint32_t INVL       : 1;
       uint32_t RESERVED13 : 7;
  __IO uint32_t PD         :12;
} stc_adc0_pcfd_field_t;

typedef struct stc_adc0_pcis_field
{
  __IO  uint8_t P1A        : 3;
  __IO  uint8_t P2A        : 5;
} stc_adc0_pcis_field_t;

typedef struct stc_adc0_cmpcr_field
{
  __IO  uint8_t CCH        : 5;
  __IO  uint8_t CMD0       : 1;
  __IO  uint8_t CMD1       : 1;
  __IO  uint8_t CMPEN      : 1;
} stc_adc0_cmpcr_field_t;

typedef struct stc_adc0_cmpd_field
{
       uint16_t RESERVED0  : 6;
  __IO uint16_t CMAD       :10;
} stc_adc0_cmpd_field_t;

typedef struct stc_adc0_adss2_field
{
  __IO  uint8_t TS16       : 1;
  __IO  uint8_t TS17       : 1;
  __IO  uint8_t TS18       : 1;
  __IO  uint8_t TS19       : 1;
  __IO  uint8_t TS20       : 1;
  __IO  uint8_t TS21       : 1;
  __IO  uint8_t TS22       : 1;
  __IO  uint8_t TS23       : 1;
} stc_adc0_adss2_field_t;

typedef struct stc_adc0_adss3_field
{
  __IO  uint8_t TS24       : 1;
  __IO  uint8_t TS25       : 1;
  __IO  uint8_t TS26       : 1;
  __IO  uint8_t TS27       : 1;
  __IO  uint8_t TS28       : 1;
  __IO  uint8_t TS29       : 1;
  __IO  uint8_t TS30       : 1;
  __IO  uint8_t TS31       : 1;
} stc_adc0_adss3_field_t;

typedef struct stc_adc0_adss0_field
{
  __IO  uint8_t TS0        : 1;
  __IO  uint8_t TS1        : 1;
  __IO  uint8_t TS2        : 1;
  __IO  uint8_t TS3        : 1;
  __IO  uint8_t TS4        : 1;
  __IO  uint8_t TS5        : 1;
  __IO  uint8_t TS6        : 1;
  __IO  uint8_t TS7        : 1;
} stc_adc0_adss0_field_t;

typedef struct stc_adc0_adss1_field
{
  __IO  uint8_t TS8        : 1;
  __IO  uint8_t TS9        : 1;
  __IO  uint8_t TS10       : 1;
  __IO  uint8_t TS11       : 1;
  __IO  uint8_t TS12       : 1;
  __IO  uint8_t TS13       : 1;
  __IO  uint8_t TS14       : 1;
  __IO  uint8_t TS15       : 1;
} stc_adc0_adss1_field_t;

typedef struct stc_adc0_adst1_field
{
  __IO  uint8_t ST1        : 5;
  __IO  uint8_t STX1       : 3;
} stc_adc0_adst1_field_t;

typedef struct stc_adc0_adst0_field
{
  __IO  uint8_t ST0        : 5;
  __IO  uint8_t STX0       : 3;
} stc_adc0_adst0_field_t;

typedef struct stc_adc0_adct_field
{
  __IO  uint8_t CT         : 8;
} stc_adc0_adct_field_t;

typedef struct stc_adc0_prtsl_field
{
  __IO  uint8_t PRTSL      : 4;
} stc_adc0_prtsl_field_t;

typedef struct stc_adc0_sctsl_field
{
  __IO  uint8_t SCTSL      : 4;
} stc_adc0_sctsl_field_t;

typedef struct stc_adc0_adcen_field
{
  __IO uint16_t ENBL       : 1;
  __IO uint16_t READY      : 1;
       uint16_t RESERVED2  : 6;
  __IO uint16_t ENBLTIME   : 8;
} stc_adc0_adcen_field_t;

