furjie/Single-BLDC-driver-and-app/s6e1a1.h
typedef struct stc_adc0_wcmrcif_field
{
  __IO uint32_t RCINT      : 1;
} stc_adc0_wcmrcif_field_t;

typedef struct stc_adc0_wcmrcot_field
{
  __IO uint32_t RCOOF      : 1;
} stc_adc0_wcmrcot_field_t;

typedef struct stc_adc0_wcmpcr_field
{
        uint8_t RESERVED0  : 2;
  __IO  uint8_t RCOE       : 1;
  __IO  uint8_t RCOIE      : 1;
  __IO  uint8_t RCOIRS     : 1;
  __IO  uint8_t RCODC0     : 1;
  __IO  uint8_t RCODC1     : 1;
  __IO  uint8_t RCODC2     : 1;
} stc_adc0_wcmpcr_field_t;

typedef struct stc_adc0_wcmpsr_field
{
  __IO  uint8_t WCCH       : 5;
  __IO  uint8_t WCMD       : 1;
} stc_adc0_wcmpsr_field_t;

typedef struct stc_adc0_wcmpdl_field
{
       uint16_t RESERVED0  : 6;
  __IO uint16_t CMLD       :10;
} stc_adc0_wcmpdl_field_t;

typedef struct stc_adc0_wcmpdh_field
{
       uint16_t RESERVED0  : 6;
  __IO uint16_t CMHD       :10;
} stc_adc0_wcmpdh_field_t;

/******************************************************************************
 * CRTRIM_MODULE
 ******************************************************************************/
/* CRTRIM_MODULE register bit fields */
typedef struct stc_crtrim_mcr_psr_field
{
  __IO  uint8_t CSR        : 3;
} stc_crtrim_mcr_psr_field_t;

typedef struct stc_crtrim_mcr_ftrm_field
{
  __IO uint16_t TRD        :10;
} stc_crtrim_mcr_ftrm_field_t;

typedef struct stc_crtrim_mcr_ttrm_field
{
  __IO  uint8_t TRT        : 5;
} stc_crtrim_mcr_ttrm_field_t;

typedef struct stc_crtrim_mcr_rlr_field
{
  __IO uint32_t TRMLCK     :32;
} stc_crtrim_mcr_rlr_field_t;

/******************************************************************************
 * EXTI_MODULE
 ******************************************************************************/
/* EXTI_MODULE register bit fields */
typedef struct stc_exti_enir_field
{
  __IO uint32_t EN0        : 1;
  __IO uint32_t EN1        : 1;
  __IO uint32_t EN2        : 1;
  __IO uint32_t EN3        : 1;
  __IO uint32_t EN4        : 1;
  __IO uint32_t EN5        : 1;
  __IO uint32_t EN6        : 1;
       uint32_t RESERVED0  : 8;
  __IO uint32_t EN15       : 1;
} stc_exti_enir_field_t;

typedef struct stc_exti_eirr_field
{
  __IO uint32_t ER0        : 1;
  __IO uint32_t ER1        : 1;
  __IO uint32_t ER2        : 1;
  __IO uint32_t ER3        : 1;
  __IO uint32_t ER4        : 1;
  __IO uint32_t ER5        : 1;
  __IO uint32_t ER6        : 1;
       uint32_t RESERVED0  : 8;
  __IO uint32_t ER15       : 1;
} stc_exti_eirr_field_t;

typedef struct stc_exti_eicl_field
{
  __IO uint32_t ECL0       : 1;
  __IO uint32_t ECL1       : 1;
  __IO uint32_t ECL2       : 1;
  __IO uint32_t ECL3       : 1;
  __IO uint32_t ECL4       : 1;
  __IO uint32_t ECL5       : 1;
  __IO uint32_t ECL6       : 1;
       uint32_t RESERVED0  : 8;
  __IO uint32_t ECL15      : 1;
} stc_exti_eicl_field_t;

typedef struct stc_exti_elvr_field
{
  __IO uint32_t LA0        : 1;
  __IO uint32_t LB0        : 1;
  __IO uint32_t LA1        : 1;
  __IO uint32_t LB1        : 1;
  __IO uint32_t LA2        : 1;
  __IO uint32_t LB2        : 1;
  __IO uint32_t LA3        : 1;
  __IO uint32_t LB3        : 1;
  __IO uint32_t LA4        : 1;
  __IO uint32_t LB4        : 1;
  __IO uint32_t LA5        : 1;
  __IO uint32_t LB5        : 1;
  __IO uint32_t LA6        : 1;
  __IO uint32_t LB6        : 1;
       uint32_t RESERVED0  : 16;
  __IO uint32_t LA15       : 1;
  __IO uint32_t LB15       : 1;
} stc_exti_elvr_field_t;

typedef struct stc_exti_nmirr_field
{
  __IO uint16_t NR         : 1;
} stc_exti_nmirr_field_t;

typedef struct stc_exti_nmicl_field
{
  __IO uint16_t NCL        : 1;
} stc_exti_nmicl_field_t;

/******************************************************************************
 * INTREQ_MODULE
 ******************************************************************************/
/* INTREQ_MODULE register bit fields */
typedef struct stc_intreq_drqsel_field
{
       uint32_t RESERVED0  : 5;
  __IO uint32_t ADCSCAN0   : 1;
  __IO uint32_t ADCSCAN1   : 1;
  __IO uint32_t ADCSCAN2   : 1;
  __IO uint32_t IRQ0BT0    : 1;
  __IO uint32_t IRQ0BT2    : 1;
  __IO uint32_t IRQ0BT4    : 1;
  __IO uint32_t IRQ0BT6    : 1;
  __IO uint32_t MFS0RX     : 1;
  __IO uint32_t MFS0TX     : 1;
  __IO uint32_t MFS1RX     : 1;
  __IO uint32_t MFS1TX     : 1;
  __IO uint32_t MFS2RX     : 1;
  __IO uint32_t MFS2TX     : 1;
  __IO uint32_t MFS3RX     : 1;
  __IO uint32_t MFS3TX     : 1;
  __IO uint32_t MFS4RX     : 1;
  __IO uint32_t MFS4TX     : 1;
  __IO uint32_t MFS5RX     : 1;
  __IO uint32_t MFS5TX     : 1;
  __IO uint32_t MFS6RX     : 1;
  __IO uint32_t MFS6TX     : 1;
  __IO uint32_t MFS7RX     : 1;
  __IO uint32_t MFS7TX     : 1;
  __IO uint32_t EXINT0     : 1;
  __IO uint32_t EXINT1     : 1;
  __IO uint32_t EXINT2     : 1;
  __IO uint32_t EXINT3     : 1;
} stc_intreq_drqsel_field_t;

typedef struct stc_intreq_irqcmode_field
{
	__IO uint32_t IRQCMODE   : 1;
} stc_intreq_irqcmode_field_t;

typedef struct stc_intreq_exc02mon_field
{
  __IO uint32_t NMI        : 1;
  __IO uint32_t HWINT      : 1;
} stc_intreq_exc02mon_field_t;

typedef struct stc_intreq_irq00mon_field
{
  __IO uint32_t FCSINT     : 1;
} stc_intreq_irq00mon_field_t;

typedef struct stc_intreq_irq01mon_field
{
  __IO uint32_t SWWDTINT   : 1;
} stc_intreq_irq01mon_field_t;

typedef struct stc_intreq_irq02mon_field
{
  __IO uint32_t LVDINT     : 1;
} stc_intreq_irq02mon_field_t;

typedef struct stc_intreq_irq03mon_field
{
  __IO uint32_t WAVE0INT0  : 1;
  __IO uint32_t WAVE0INT1  : 1;
  __IO uint32_t WAVE0INT2  : 1;
  __IO uint32_t WAVE0INT3  : 1;
  __IO uint32_t WAVE1INT0  : 1;
  __IO uint32_t WAVE1INT1  : 1;
  __IO uint32_t WAVE1INT2  : 1;
  __IO uint32_t WAVE1INT3  : 1;
  __IO uint32_t WAVE2INT0  : 1;
  __IO uint32_t WAVE2INT1  : 1;
  __IO uint32_t WAVE2INT2  : 1;
  __IO uint32_t WAVE2INT3  : 1;
} stc_intreq_irq03mon_field_t;

typedef struct stc_intreq_irq04mon_field
{
  __IO uint32_t EXTINT0    : 1;
  __IO uint32_t EXTINT1    : 1;
  __IO uint32_t EXTINT2    : 1;
  __IO uint32_t EXTINT3    : 1;
  __IO uint32_t EXTINT4    : 1;
  __IO uint32_t EXTINT5    : 1;
  __IO uint32_t EXTINT6    : 1;
  __IO uint32_t EXTINT7    : 1;
} stc_intreq_irq04mon_field_t;

typedef struct stc_intreq_irq05mon_field
{
  __IO uint32_t EXTINT8    : 1;
  __IO uint32_t EXTINT9    : 1;
  __IO uint32_t EXTINT10   : 1;
  __IO uint32_t EXTINT11   : 1;
  __IO uint32_t EXTINT12   : 1;
  __IO uint32_t EXTINT13   : 1;
  __IO uint32_t EXTINT14   : 1;
  __IO uint32_t EXTINT15   : 1;
  __IO uint32_t EXTINT16   : 1;
  __IO uint32_t EXTINT17   : 1;
  __IO uint32_t EXTINT18   : 1;
  __IO uint32_t EXTINT19   : 1;
  __IO uint32_t EXTINT20   : 1;
  __IO uint32_t EXTINT21   : 1;
  __IO uint32_t EXTINT22   : 1;
  __IO uint32_t EXTINT23   : 1;
  __IO uint32_t EXTINT24   : 1;
  __IO uint32_t EXTINT25   : 1;
  __IO uint32_t EXTINT26   : 1;
  __IO uint32_t EXTINT27   : 1;
  __IO uint32_t EXTINT28   : 1;
  __IO uint32_t EXTINT29   : 1;
  __IO uint32_t EXTINT30   : 1;
  __IO uint32_t EXTINT31   : 1;
} stc_intreq_irq05mon_field_t;

