furjie/Single-BLDC-driver-and-app/s6e1a1.h
typedef struct stc_intreq_irq31mon_field
{
  __IO uint32_t BTINT0     : 1;
  __IO uint32_t BTINT1     : 1;
  __IO uint32_t BTINT2     : 1;
  __IO uint32_t BTINT3     : 1;
  __IO uint32_t BTINT4     : 1;
  __IO uint32_t BTINT5     : 1;
  __IO uint32_t BTINT6     : 1;
  __IO uint32_t BTINT7     : 1;
  __IO uint32_t BTINT8     : 1;
  __IO uint32_t BTINT9     : 1;
  __IO uint32_t BTINT10    : 1;
  __IO uint32_t BTINT11    : 1;
  __IO uint32_t BTINT12    : 1;
  __IO uint32_t BTINT13    : 1;
  __IO uint32_t BTINT14    : 1;
  __IO uint32_t BTINT15    : 1;
       uint32_t RESERVED16 :11;
  __IO uint32_t FLASHINT   : 1;
} stc_intreq_irq31mon_field_t;

/******************************************************************************
 * GPIO_MODULE
 ******************************************************************************/
/* GPIO_MODULE register bit fields */
typedef struct stc_gpio_pfr0_field
{
  __IO uint32_t P00        : 1;
  __IO uint32_t P01        : 1;
  __IO uint32_t P02        : 1;
  __IO uint32_t P03        : 1;
  __IO uint32_t P04        : 1;
       uint32_t RESERVED5  :10;
  __IO uint32_t P0F        : 1;
} stc_gpio_pfr0_field_t;

typedef struct stc_gpio_pfr1_field
{
  __IO uint32_t P10        : 1;
  __IO uint32_t P11        : 1;
  __IO uint32_t P12        : 1;
  __IO uint32_t P13        : 1;
  __IO uint32_t P14        : 1;
  __IO uint32_t P15        : 1;
} stc_gpio_pfr1_field_t;

typedef struct stc_gpio_pfr2_field
{
       uint32_t RESERVED0  : 1;
  __IO uint32_t P21        : 1;
  __IO uint32_t P22        : 1;
  __IO uint32_t P23        : 1;
} stc_gpio_pfr2_field_t;

typedef struct stc_gpio_pfr3_field
{
       uint32_t RESERVED0  : 9;
  __IO uint32_t P39        : 1;
  __IO uint32_t P3A        : 1;
  __IO uint32_t P3B        : 1;
  __IO uint32_t P3C        : 1;
  __IO uint32_t P3D        : 1;
  __IO uint32_t P3E        : 1;
  __IO uint32_t P3F        : 1;
} stc_gpio_pfr3_field_t;

typedef struct stc_gpio_pfr4_field
{
       uint32_t RESERVED0  : 6;
  __IO uint32_t P46        : 1;
  __IO uint32_t P47        : 1;
       uint32_t RESERVED8  : 1;
  __IO uint32_t P49        : 1;
  __IO uint32_t P4A        : 1;
} stc_gpio_pfr4_field_t;

typedef struct stc_gpio_pfr5_field
{
  __IO uint32_t P50        : 1;
  __IO uint32_t P51        : 1;
  __IO uint32_t P52        : 1;
} stc_gpio_pfr5_field_t;

typedef struct stc_gpio_pfr6_field
{
  __IO uint32_t P60        : 1;
  __IO uint32_t P61        : 1;
} stc_gpio_pfr6_field_t;

typedef struct stc_gpio_pfr8_field
{
  __IO uint32_t P80        : 1;
  __IO uint32_t P81        : 1;
  __IO uint32_t P82        : 1;
} stc_gpio_pfr8_field_t;

typedef struct stc_gpio_pfre_field
{
  __IO uint32_t PE0        : 1;
       uint32_t RESERVED1  : 1;
  __IO uint32_t PE2        : 1;
  __IO uint32_t PE3        : 1;
} stc_gpio_pfre_field_t;

typedef struct stc_gpio_pcr0_field
{
  __IO uint32_t P00        : 1;
  __IO uint32_t P01        : 1;
  __IO uint32_t P02        : 1;
  __IO uint32_t P03        : 1;
  __IO uint32_t P04        : 1;
       uint32_t RESERVED5  :10;
  __IO uint32_t P0F        : 1;
} stc_gpio_pcr0_field_t;

typedef struct stc_gpio_pcr1_field
{
  __IO uint32_t P10        : 1;
  __IO uint32_t P11        : 1;
  __IO uint32_t P12        : 1;
  __IO uint32_t P13        : 1;
  __IO uint32_t P14        : 1;
  __IO uint32_t P15        : 1;
} stc_gpio_pcr1_field_t;

typedef struct stc_gpio_pcr2_field
{
       uint32_t RESERVED0  : 1;
  __IO uint32_t P21        : 1;
  __IO uint32_t P22        : 1;
  __IO uint32_t P23        : 1;
} stc_gpio_pcr2_field_t;

typedef struct stc_gpio_pcr3_field
{
       uint32_t RESERVED0  : 9;
  __IO uint32_t P39        : 1;
  __IO uint32_t P3A        : 1;
  __IO uint32_t P3B        : 1;
  __IO uint32_t P3C        : 1;
  __IO uint32_t P3D        : 1;
  __IO uint32_t P3E        : 1;
  __IO uint32_t P3F        : 1;
} stc_gpio_pcr3_field_t;

typedef struct stc_gpio_pcr4_field
{
       uint32_t RESERVED0  : 6;
  __IO uint32_t P46        : 1;
  __IO uint32_t P47        : 1;
       uint32_t RESERVED8  : 1;
  __IO uint32_t P49        : 1;
  __IO uint32_t P4A        : 1;
} stc_gpio_pcr4_field_t;

typedef struct stc_gpio_pcr5_field
{
  __IO uint32_t P50        : 1;
  __IO uint32_t P51        : 1;
  __IO uint32_t P52        : 1;
} stc_gpio_pcr5_field_t;

typedef struct stc_gpio_pcr6_field
{
  __IO uint32_t P60        : 1;
  __IO uint32_t P61        : 1;
} stc_gpio_pcr6_field_t;

typedef struct stc_gpio_pcr8_field
{
  __IO uint32_t P80        : 1;
  __IO uint32_t P81        : 1;
  __IO uint32_t P82        : 1;
} stc_gpio_pcr8_field_t;

typedef struct stc_gpio_pcre_field
{
  __IO uint32_t PE0        : 1;
       uint32_t RESERVED1  : 1;
  __IO uint32_t PE2        : 1;
  __IO uint32_t PE3        : 1;
} stc_gpio_pcre_field_t;

typedef struct stc_gpio_ddr0_field
{
  __IO uint32_t P00        : 1;
  __IO uint32_t P01        : 1;
  __IO uint32_t P02        : 1;
  __IO uint32_t P03        : 1;
  __IO uint32_t P04        : 1;
       uint32_t RESERVED5  :10;
  __IO uint32_t P0F        : 1;
} stc_gpio_ddr0_field_t;

typedef struct stc_gpio_ddr1_field
{
  __IO uint32_t P10        : 1;
  __IO uint32_t P11        : 1;
  __IO uint32_t P12        : 1;
  __IO uint32_t P13        : 1;
  __IO uint32_t P14        : 1;
  __IO uint32_t P15        : 1;
} stc_gpio_ddr1_field_t;

typedef struct stc_gpio_ddr2_field
{
       uint32_t RESERVED0  : 1;
  __IO uint32_t P21        : 1;
  __IO uint32_t P22        : 1;
  __IO uint32_t P23        : 1;
} stc_gpio_ddr2_field_t;

typedef struct stc_gpio_ddr3_field
{
       uint32_t RESERVED0  : 9;
  __IO uint32_t P39        : 1;
  __IO uint32_t P3A        : 1;
  __IO uint32_t P3B        : 1;
  __IO uint32_t P3C        : 1;
  __IO uint32_t P3D        : 1;
  __IO uint32_t P3E        : 1;
  __IO uint32_t P3F        : 1;
} stc_gpio_ddr3_field_t;

typedef struct stc_gpio_ddr4_field
{
       uint32_t RESERVED0  : 6;
  __IO uint32_t P46        : 1;
  __IO uint32_t P47        : 1;
       uint32_t RESERVED8  : 1;
  __IO uint32_t P49        : 1;
  __IO uint32_t P4A        : 1;
} stc_gpio_ddr4_field_t;

typedef struct stc_gpio_ddr5_field
{
  __IO uint32_t P50        : 1;
  __IO uint32_t P51        : 1;
  __IO uint32_t P52        : 1;
} stc_gpio_ddr5_field_t;

