furjie/Single-BLDC-driver-and-app/s6e1a1.h
typedef struct stc_gpio_pzr4_field
{
       uint32_t RESERVED0  : 6;
  __IO uint32_t P46        : 1;
  __IO uint32_t P47        : 1;
       uint32_t RESERVED8  : 1;
  __IO uint32_t P49        : 1;
  __IO uint32_t P4A        : 1;
} stc_gpio_pzr4_field_t;

typedef struct stc_gpio_pzr5_field
{
  __IO uint32_t P50        : 1;
  __IO uint32_t P51        : 1;
  __IO uint32_t P52        : 1;
} stc_gpio_pzr5_field_t;

typedef struct stc_gpio_pzr6_field
{
  __IO uint32_t P60        : 1;
  __IO uint32_t P61        : 1;
} stc_gpio_pzr6_field_t;

typedef struct stc_gpio_pzr8_field
{
  __IO uint32_t P80        : 1;
  __IO uint32_t P81        : 1;
  __IO uint32_t P82        : 1;
} stc_gpio_pzr8_field_t;

typedef struct stc_gpio_pzre_field
{
  __IO uint32_t PE0        : 1;
       uint32_t RESERVED1  : 1;
  __IO uint32_t PE2        : 1;
  __IO uint32_t PE3        : 1;
} stc_gpio_pzre_field_t;

typedef struct stc_gpio_fpoer0_field
{
  __IO uint32_t P00        : 1;
  __IO uint32_t P01        : 1;
  __IO uint32_t P02        : 1;
  __IO uint32_t P03        : 1;
  __IO uint32_t P04        : 1;
       uint32_t RESERVED5  :10;
  __IO uint32_t P0F        : 1;
} stc_gpio_fpoer0_field_t;

typedef struct stc_gpio_fpoer1_field
{
  __IO uint32_t P10        : 1;
  __IO uint32_t P11        : 1;
  __IO uint32_t P12        : 1;
  __IO uint32_t P13        : 1;
  __IO uint32_t P14        : 1;
  __IO uint32_t P15        : 1;
} stc_gpio_fpoer1_field_t;

typedef struct stc_gpio_fpoer2_field
{
       uint32_t RESERVED0  : 1;
  __IO uint32_t P21        : 1;
  __IO uint32_t P22        : 1;
  __IO uint32_t P23        : 1;
} stc_gpio_fpoer2_field_t;

typedef struct stc_gpio_fpoer3_field
{
       uint32_t RESERVED0  : 9;
  __IO uint32_t P39        : 1;
  __IO uint32_t P3A        : 1;
  __IO uint32_t P3B        : 1;
  __IO uint32_t P3C        : 1;
  __IO uint32_t P3D        : 1;
  __IO uint32_t P3E        : 1;
  __IO uint32_t P3F        : 1;
} stc_gpio_fpoer3_field_t;

typedef struct stc_gpio_fpoer4_field
{
       uint32_t RESERVED0  : 6;
  __IO uint32_t P46        : 1;
  __IO uint32_t P47        : 1;
       uint32_t RESERVED8  : 1;
  __IO uint32_t P49        : 1;
  __IO uint32_t P4A        : 1;
} stc_gpio_fpoer4_field_t;

typedef struct stc_gpio_fpoer5_field
{
  __IO uint32_t P50        : 1;
  __IO uint32_t P51        : 1;
  __IO uint32_t P52        : 1;
} stc_gpio_fpoer5_field_t;

typedef struct stc_gpio_fpoer6_field
{
  __IO uint32_t P60        : 1;
  __IO uint32_t P61        : 1;
} stc_gpio_fpoer6_field_t;

typedef struct stc_gpio_fpoer8_field
{
  __IO uint32_t P80        : 1;
  __IO uint32_t P81        : 1;
  __IO uint32_t P82        : 1;
} stc_gpio_fpoer8_field_t;

typedef struct stc_gpio_fpoere_field
{
  __IO uint32_t PE0        : 1;
       uint32_t RESERVED1  : 1;
  __IO uint32_t PE2        : 1;
  __IO uint32_t PE3        : 1;
} stc_gpio_fpoere_field_t;

/******************************************************************************
 * FASTIO_MODULE
 ******************************************************************************/
/* FASTIO_MODULE register bit fields */
typedef struct stc_fastio_fpdir0_field
{
  __IO uint32_t P00        : 1;
  __IO uint32_t P01        : 1;
  __IO uint32_t P02        : 1;
  __IO uint32_t P03        : 1;
  __IO uint32_t P04        : 1;
       uint32_t RESERVED5  :10;
  __IO uint32_t P0F        : 1;
} stc_fastio_fpdir0_field_t;

typedef struct stc_fastio_fpdir1_field
{
  __IO uint32_t P10        : 1;
  __IO uint32_t P11        : 1;
  __IO uint32_t P12        : 1;
  __IO uint32_t P13        : 1;
  __IO uint32_t P14        : 1;
  __IO uint32_t P15        : 1;
} stc_fastio_fpdir1_field_t;

typedef struct stc_fastio_fpdir2_field
{
       uint32_t RESERVED0  : 1;
  __IO uint32_t P21        : 1;
  __IO uint32_t P22        : 1;
  __IO uint32_t P23        : 1;
} stc_fastio_fpdir2_field_t;

typedef struct stc_fastio_fpdir3_field
{
       uint32_t RESERVED0  : 9;
  __IO uint32_t P39        : 1;
  __IO uint32_t P3A        : 1;
  __IO uint32_t P3B        : 1;
  __IO uint32_t P3C        : 1;
  __IO uint32_t P3D        : 1;
  __IO uint32_t P3E        : 1;
  __IO uint32_t P3F        : 1;
} stc_fastio_fpdir3_field_t;

typedef struct stc_fastio_fpdir4_field
{
       uint32_t RESERVED0  : 6;
  __IO uint32_t P46        : 1;
  __IO uint32_t P47        : 1;
       uint32_t RESERVED8  : 1;
  __IO uint32_t P49        : 1;
  __IO uint32_t P4A        : 1;
} stc_fastio_fpdir4_field_t;

typedef struct stc_fastio_fpdir5_field
{
  __IO uint32_t P50        : 1;
  __IO uint32_t P51        : 1;
  __IO uint32_t P52        : 1;
} stc_fastio_fpdir5_field_t;

typedef struct stc_fastio_fpdir6_field
{
  __IO uint32_t P60        : 1;
  __IO uint32_t P61        : 1;
} stc_fastio_fpdir6_field_t;

typedef struct stc_fastio_fpdir8_field
{
  __IO uint32_t P80        : 1;
  __IO uint32_t P81        : 1;
  __IO uint32_t P82        : 1;
} stc_fastio_fpdir8_field_t;

typedef struct stc_fastio_fpdire_field
{
  __IO uint32_t PE0        : 1;
       uint32_t RESERVED1  : 1;
  __IO uint32_t PE2        : 1;
  __IO uint32_t PE3        : 1;
} stc_fastio_fpdire_field_t;

typedef struct stc_fastio_fpdor0_field
{
  __IO uint32_t P00        : 1;
  __IO uint32_t P01        : 1;
  __IO uint32_t P02        : 1;
  __IO uint32_t P03        : 1;
  __IO uint32_t P04        : 1;
       uint32_t RESERVED5  :10;
  __IO uint32_t P0F        : 1;
} stc_fastio_fpdor0_field_t;

typedef struct stc_fastio_fpdor1_field
{
  __IO uint32_t P10        : 1;
  __IO uint32_t P11        : 1;
  __IO uint32_t P12        : 1;
  __IO uint32_t P13        : 1;
  __IO uint32_t P14        : 1;
  __IO uint32_t P15        : 1;
} stc_fastio_fpdor1_field_t;

typedef struct stc_fastio_fpdor2_field
{
       uint32_t RESERVED0  : 1;
  __IO uint32_t P21        : 1;
  __IO uint32_t P22        : 1;
  __IO uint32_t P23        : 1;
} stc_fastio_fpdor2_field_t;

