furjie/Single-BLDC-driver-and-app/s6e1a1.h
typedef struct stc_fastio_fpdor3_field
{
       uint32_t RESERVED0  : 9;
  __IO uint32_t P39        : 1;
  __IO uint32_t P3A        : 1;
  __IO uint32_t P3B        : 1;
  __IO uint32_t P3C        : 1;
  __IO uint32_t P3D        : 1;
  __IO uint32_t P3E        : 1;
  __IO uint32_t P3F        : 1;
} stc_fastio_fpdor3_field_t;

typedef struct stc_fastio_fpdor4_field
{
       uint32_t RESERVED0  : 6;
  __IO uint32_t P46        : 1;
  __IO uint32_t P47        : 1;
       uint32_t RESERVED8  : 1;
  __IO uint32_t P49        : 1;
  __IO uint32_t P4A        : 1;
} stc_fastio_fpdor4_field_t;

typedef struct stc_fastio_fpdor5_field
{
  __IO uint32_t P50        : 1;
  __IO uint32_t P51        : 1;
  __IO uint32_t P52        : 1;
} stc_fastio_fpdor5_field_t;

typedef struct stc_fastio_fpdor6_field
{
  __IO uint32_t P60        : 1;
  __IO uint32_t P61        : 1;
} stc_fastio_fpdor6_field_t;

typedef struct stc_fastio_fpdor8_field
{
  __IO uint32_t P80        : 1;
  __IO uint32_t P81        : 1;
  __IO uint32_t P82        : 1;
} stc_fastio_fpdor8_field_t;

typedef struct stc_fastio_fpdore_field
{
  __IO uint32_t PE0        : 1;
       uint32_t RESERVED1  : 1;
  __IO uint32_t PE2        : 1;
  __IO uint32_t PE3        : 1;
} stc_fastio_fpdore_field_t;

typedef struct stc_fastio_m_fpdir0_field
{
  __IO uint32_t P22        : 1;
  __IO uint32_t P23        : 1;
  __IO uint32_t P15        : 1;
  __IO uint32_t P14        : 1;
  __IO uint32_t P13        : 1;
  __IO uint32_t P12        : 1;
  __IO uint32_t P11        : 1;
  __IO uint32_t P10        : 1;
} stc_fastio_m_fpdir0_field_t;

typedef struct stc_fastio_m_fpdir1_field
{
  __IO uint32_t P47        : 1;
  __IO uint32_t P46        : 1;
  __IO uint32_t P3F        : 1;
  __IO uint32_t P3E        : 1;
  __IO uint32_t P3D        : 1;
  __IO uint32_t P3C        : 1;
  __IO uint32_t P3B        : 1;
  __IO uint32_t P3A        : 1;
} stc_fastio_m_fpdir1_field_t;

typedef struct stc_fastio_m_fpdor0_field
{
  __IO uint32_t P22        : 1;
  __IO uint32_t P23        : 1;
  __IO uint32_t P15        : 1;
  __IO uint32_t P14        : 1;
  __IO uint32_t P13        : 1;
  __IO uint32_t P12        : 1;
  __IO uint32_t P11        : 1;
  __IO uint32_t P10        : 1;
} stc_fastio_m_fpdor0_field_t;

typedef struct stc_fastio_m_fpdor1_field
{
  __IO uint32_t P47        : 1;
  __IO uint32_t P46        : 1;
  __IO uint32_t P3F        : 1;
  __IO uint32_t P3E        : 1;
  __IO uint32_t P3D        : 1;
  __IO uint32_t P3C        : 1;
  __IO uint32_t P3B        : 1;
  __IO uint32_t P3A        : 1;
} stc_fastio_m_fpdor1_field_t;

/******************************************************************************
 * LVD_MODULE
 ******************************************************************************/
/* LVD_MODULE register bit fields */
typedef struct stc_lvd_lvd_ctl_field
{
       uint16_t RESERVED0  : 2;
  __IO uint16_t SVHI       : 5;
  __IO uint16_t LVDIE      : 1;
       uint16_t RESERVED8  : 2;
  __IO uint16_t SVHR       : 5;
  __IO uint16_t LVDRE      : 1;
} stc_lvd_lvd_ctl_field_t;

typedef struct stc_lvd_lvd_str_field
{
        uint8_t RESERVED0  : 7;
  __IO  uint8_t LVDIR      : 1;
} stc_lvd_lvd_str_field_t;

typedef struct stc_lvd_lvd_clr_field
{
        uint8_t RESERVED0  : 7;
  __IO  uint8_t LVDCL      : 1;
} stc_lvd_lvd_clr_field_t;

typedef struct stc_lvd_lvd_rlr_field
{
  __IO uint32_t LVDLCK     : 32;
} stc_lvd_lvd_rlr_field_t;

typedef struct stc_lvd_lvd_str2_field
{
        uint8_t RESERVED0  : 6;
  __IO  uint8_t LVDRRDY    : 1;
  __IO  uint8_t LVDIRDY    : 1;
} stc_lvd_lvd_str2_field_t;

/******************************************************************************
 * DS_MODULE
 ******************************************************************************/
/* Deep standby mode control registers bit fields */
typedef struct stc_ds_reg_ctl_field
{
        uint8_t RESERVED0  : 1;
  __IO  uint8_t ISUBSEL    : 2;
} stc_ds_reg_ctl_field_t;

typedef struct stc_ds_rck_ctl_field
{
  __IO  uint8_t RTCCKE     : 1;
  __IO  uint8_t CECCKE     : 1;
} stc_ds_rck_ctl_field_t;

typedef struct stc_ds_pmd_ctl_field
{
  __IO  uint8_t RTCE       : 1;
} stc_ds_pmd_ctl_field_t;

typedef struct stc_ds_wrfsr_field
{
  __IO  uint8_t WINITX     : 1;
  __IO  uint8_t WLVDH      : 1;
} stc_ds_wrfsr_field_t;

typedef struct stc_ds_wifsr_field
{
  __IO uint16_t WRTCI      : 1;
  __IO uint16_t WLVDI      : 1;
  __IO uint16_t WUI0       : 1;
  __IO uint16_t WUI1       : 1;
  __IO uint16_t WUI2       : 1;
  __IO uint16_t WUI3       : 1;
  __IO uint16_t WUI4       : 1;
  __IO uint16_t WUI5       : 1;
  __IO uint16_t WCEC0I     : 1;
  __IO uint16_t WCEC1I     : 1;
} stc_ds_wifsr_field_t;

typedef struct stc_ds_wier_field
{
  __IO uint16_t WRTCE      : 1;
  __IO uint16_t WLVDE      : 1;
       uint16_t RESERVED2  : 1;
  __IO uint16_t WUE1       : 1;
  __IO uint16_t WUE2       : 1;
  __IO uint16_t WUE3       : 1;
  __IO uint16_t WUE4       : 1;
  __IO uint16_t WUE5       : 1;
  __IO uint16_t WCEC0E     : 1;
  __IO uint16_t WCEC1E     : 1;
} stc_ds_wier_field_t;

typedef struct stc_ds_wilvr_field
{
  __IO  uint8_t WUI1LV     : 1;
  __IO  uint8_t WUI2LV     : 1;
  __IO  uint8_t WUI3LV     : 1;
  __IO  uint8_t WUI4LV     : 1;
  __IO  uint8_t WUI5LV     : 1;
} stc_ds_wilvr_field_t;

typedef struct stc_ds_dsramr_field
{
  __IO  uint8_t SRAMR      : 2;
} stc_ds_dsramr_field_t;

/******************************************************************************
 * MFS_UART_MODULE
 ******************************************************************************/
/* MFS_UART_MODULE register bit fields */
typedef struct stc_mfs_uart_smr_field
{
  __IO  uint8_t SOE        : 1;
        uint8_t RESERVED1  : 1;
  __IO  uint8_t BDS        : 1;
  __IO  uint8_t SBL        : 1;
        uint8_t RESERVED4  : 1;
  __IO  uint8_t MD         : 3;
} stc_mfs_uart_smr_field_t;

