furjie/Single-BLDC-driver-and-app/s6e1a1.h
/******************************************************************************
 * MFT_OCU_MODULE
 ******************************************************************************/
/* Multifunction Timer unit 0 Output Compare Unit registers */
typedef struct
{
       uint8_t RESERVED0[2];
  __IO uint16_t OCCP0;
       uint8_t RESERVED1[2];
  __IO uint16_t OCCP1;
       uint8_t RESERVED2[2];
  __IO uint16_t OCCP2;
       uint8_t RESERVED3[2];
  __IO uint16_t OCCP3;
       uint8_t RESERVED4[2];
  __IO uint16_t OCCP4;
       uint8_t RESERVED5[2];
  __IO uint16_t OCCP5;
  union {
    __IO  uint8_t OCSA10;
    stc_mft_ocu_ocsa10_field_t OCSA10_f;
  };
  union {
    __IO  uint8_t OCSB10;
    stc_mft_ocu_ocsb10_field_t OCSB10_f;
  };
  union {
    __IO  uint8_t OCSD10;
    stc_mft_ocu_ocsd10_field_t OCSD10_f;
  };
       uint8_t RESERVED6[1];
  union {
    __IO  uint8_t OCSA32;
    stc_mft_ocu_ocsa32_field_t OCSA32_f;
  };
  union {
    __IO  uint8_t OCSB32;
    stc_mft_ocu_ocsb32_field_t OCSB32_f;
  };
  union {
    __IO  uint8_t OCSD32;
    stc_mft_ocu_ocsd32_field_t OCSD32_f;
  };
       uint8_t RESERVED7[1];
  union {
    __IO  uint8_t OCSA54;
    stc_mft_ocu_ocsa54_field_t OCSA54_f;
  };
  union {
    __IO  uint8_t OCSB54;
    stc_mft_ocu_ocsb54_field_t OCSB54_f;
  };
  union {
    __IO  uint8_t OCSD54;
    stc_mft_ocu_ocsd54_field_t OCSD54_f;
  };
       uint8_t RESERVED8[2];
  union {
    __IO  uint8_t OCSC;
    stc_mft_ocu_ocsc_field_t OCSC_f;
  };
       uint8_t RESERVED15[2];
  union {
    __IO uint16_t OCSE0;
    stc_mft_ocu_ocse0_field_t OCSE0_f;
  };
       uint8_t RESERVED16[2];
  union {
    __IO uint32_t OCSE1;
    stc_mft_ocu_ocse1_field_t OCSE1_f;
  };
  union {
    __IO uint16_t OCSE2;
    stc_mft_ocu_ocse2_field_t OCSE2_f;
  };
       uint8_t RESERVED18[2];
  union {
    __IO uint32_t OCSE3;
    stc_mft_ocu_ocse3_field_t OCSE3_f;
  };
  union {
    __IO uint16_t OCSE4;
    stc_mft_ocu_ocse4_field_t OCSE4_f;
  };
       uint8_t RESERVED20[2];
  union {
    __IO uint32_t OCSE5;
    stc_mft_ocu_ocse5_field_t OCSE5_f;
  };
       uint8_t RESERVED21[40];
  union {
    __IO  uint8_t OCFS10;
    stc_mft_ocu_ocfs10_field_t OCFS10_f;
  };
  union {
    __IO  uint8_t OCFS32;
    stc_mft_ocu_ocfs32_field_t OCFS32_f;
  };
  union {
    __IO  uint8_t OCFS54;
    stc_mft_ocu_ocfs54_field_t OCFS54_f;
  };
}FM0P_MFT_OCU_TypeDef;

/******************************************************************************
 * MFT_WFG_MODULE
 ******************************************************************************/
/* Multifunction Timer unit 0 Waveform Generator and Noise Canceler registers */
typedef struct
{
  uint8_t RESERVED0[142];
  __IO uint16_t WFTF10;
  __IO uint16_t WFTA10;
  __IO uint16_t WFTB10;
       uint8_t RESERVED1[2];
  __IO uint16_t WFTF32;
  __IO uint16_t WFTA32;
  __IO uint16_t WFTB32;
       uint8_t RESERVED2[2];
  __IO uint16_t WFTF54;
  __IO uint16_t WFTA54;
  __IO uint16_t WFTB54;
  union {
    __IO uint16_t WFSA10;
    stc_mft_wfg_wfsa10_field_t WFSA10_f;
  };
       uint8_t RESERVED3[2];
  union {
    __IO uint16_t WFSA32;
    stc_mft_wfg_wfsa32_field_t WFSA32_f;
  };
       uint8_t RESERVED4[2];
  union {
    __IO uint16_t WFSA54;
    stc_mft_wfg_wfsa54_field_t WFSA54_f;
  };
       uint8_t RESERVED5[2];
  union {
    __IO uint16_t WFIR;
    stc_mft_wfg_wfir_field_t WFIR_f;
  };
       uint8_t RESERVED6[2];
  union {
    __IO uint16_t NZCL;
    stc_mft_wfg_nzcl_field_t NZCL_f;
  };
}FM0P_MFT_WFG_TypeDef;

/******************************************************************************
 * MFT_ICU_MODULE
 ******************************************************************************/
/* Multifunction Timer unit 0 Input Capture Unit registers */
typedef struct
{
  uint8_t RESERVED0[108];
  union {
    __IO  uint8_t ICFS10;
    stc_mft_icu_icfs10_field_t ICFS10_f;
  };
  union {
    __IO  uint8_t ICFS32;
    stc_mft_icu_icfs32_field_t ICFS32_f;
  };
  uint8_t RESERVED1[8];
  __IO uint16_t ICCP0;
       uint8_t RESERVED2[2];
  __IO uint16_t ICCP1;
       uint8_t RESERVED3[2];
  __IO uint16_t ICCP2;
       uint8_t RESERVED4[2];
  __IO uint16_t ICCP3;
  union {
    __IO  uint8_t ICSA10;
    stc_mft_icu_icsa10_field_t ICSA10_f;
  };
  union {
    __IO  uint8_t ICSB10;
    stc_mft_icu_icsb10_field_t ICSB10_f;
  };
       uint8_t RESERVED5[2];
  union {
    __IO  uint8_t ICSA32;
    stc_mft_icu_icsa32_field_t ICSA32_f;
  };
  union {
    __IO  uint8_t ICSB32;
    stc_mft_icu_icsb32_field_t ICSB32_f;
  };
}FM0P_MFT_ICU_TypeDef;

/******************************************************************************
 * MFT_ADCMP_MODULE
 ******************************************************************************/
/* Multifunction Timer unit 0 ADC Start Compare Unit registers */
typedef struct
{
  uint8_t RESERVED0[112];
  union {
    __IO  uint8_t ACFS10;
    stc_mft_adcmp_acfs10_field_t ACFS10_f;
  };
  union {
    __IO  uint8_t ACFS32;
    stc_mft_adcmp_acfs32_field_t ACFS32_f;
  };
  union {
    __IO  uint8_t ACFS54;
    stc_mft_adcmp_acfs54_field_t ACFS54_f;
  };
       uint8_t RESERVED1[71];
  union {
    __IO uint16_t ACMP0;
    stc_mft_adcmp_acmp0_field_t ACMP0_f;
  };
       uint8_t RESERVED2[2];
  union {
    __IO uint16_t ACMP1;
    stc_mft_adcmp_acmp1_field_t ACMP1_f;
  };
       uint8_t RESERVED3[2];
  union {
    __IO uint16_t ACMP2;
    stc_mft_adcmp_acmp2_field_t ACMP2_f;
  };
       uint8_t RESERVED4[2];
  union {
    __IO uint16_t ACMP3;
    stc_mft_adcmp_acmp3_field_t ACMP3_f;
  };
       uint8_t RESERVED5[2];
  union {
    __IO uint16_t ACMP4;
    stc_mft_adcmp_acmp4_field_t ACMP4_f;
  };
       uint8_t RESERVED6[2];
  union {
    __IO uint16_t ACMP5;
    stc_mft_adcmp_acmp5_field_t ACMP5_f;
  };
  union {
    __IO uint16_t ACSA;
    stc_mft_adcmp_acsa_field_t ACSA_f;
  };
       uint8_t RESERVED7[2];
  union {
    __IO  uint8_t ACSC0;
    stc_mft_adcmp_acsc0_field_t ACSC0_f;
  };
  union {
    __IO  uint8_t ACSD0;
    stc_mft_adcmp_acsd0_field_t ACSD0_f;
  };
       uint8_t RESERVED8[2];
  union {
    __IO  uint8_t ACSC1;
    stc_mft_adcmp_acsc1_field_t ACSC1_f;
  };
  union {
    __IO  uint8_t ACSD1;
    stc_mft_adcmp_acsd1_field_t ACSD1_f;
  };
       uint8_t RESERVED9[2];
  union {
    __IO  uint8_t ACSC2;
    stc_mft_adcmp_acsc2_field_t ACSC2_f;
  };
  union {
    __IO  uint8_t ACSD2;
    stc_mft_adcmp_acsd2_field_t ACSD2_f;
  };
       uint8_t RESERVED10[2];
  union {
    __IO  uint8_t ACSC3;
    stc_mft_adcmp_acsc3_field_t ACSC3_f;
  };
  union {
    __IO  uint8_t ACSD3;
    stc_mft_adcmp_acsd3_field_t ACSD3_f;
  };
       uint8_t RESERVED11[2];
  union {
    __IO  uint8_t ACSC4;
    stc_mft_adcmp_acsc4_field_t ACSC4_f;
  };
  union {
    __IO  uint8_t ACSD4;
    stc_mft_adcmp_acsd4_field_t ACSD4_f;
  };
       uint8_t RESERVED14[2];
  union {
    __IO  uint8_t ACSC5;
    stc_mft_adcmp_acsc5_field_t ACSC5_f;
  };
  union {
    __IO  uint8_t ACSD5;
    stc_mft_adcmp_acsd5_field_t ACSD5_f;
  };
}FM0P_MFT_ADCMP_TypeDef;

