furjie/Single-BLDC-driver-and-app/s6e1a1.h
/******************************************************************************
 * MFT_PPG_MODULE
 ******************************************************************************/
/* Multifunction Timer PPG registers */
typedef struct
{
       uint8_t RESERVED[1]; 
  union {
    __IO uint8_t TTCR0;
    stc_mft_ppg_ttcr0_field_t TTCR0_f;
  };
       uint8_t RESERVED0[7];
  __IO uint8_t COMP0;
       uint8_t RESERVED1[2];
  __IO uint8_t COMP2;
       uint8_t RESERVED2[4];
  __IO uint8_t COMP4;
       uint8_t RESERVED3[2];
  __IO uint8_t COMP6;
       uint8_t RESERVED4[12];
  union {
    __IO uint8_t TTCR1;
    stc_mft_ppg_ttcr1_field_t TTCR1_f;
  };
       uint8_t RESERVED5[7];
  __IO uint8_t COMP1;
       uint8_t RESERVED6[2];
  __IO uint8_t COMP3;
       uint8_t RESERVED7[4];
  __IO uint8_t COMP5;
       uint8_t RESERVED8[2];
  __IO uint8_t COMP7;
       uint8_t RESERVED9[12];
  union {
    __IO uint8_t TTCR2;
    stc_mft_ppg_ttcr2_field_t TTCR2_f;
  };
       uint8_t RESERVED10[7];
  __IO uint8_t COMP8;
       uint8_t RESERVED11[2];
  __IO uint8_t COMP10;
       uint8_t RESERVED12[4];
  __IO uint8_t COMP12;
       uint8_t RESERVED13[2];
  __IO uint8_t COMP14;
       uint8_t RESERVED14[171];
  union {
    __IO uint16_t TRG0;
    stc_mft_ppg_trg0_field_t TRG0_f;
  };
       uint8_t RESERVED15[2];
  union {
    __IO uint16_t REVC0;
    stc_mft_ppg_revc0_field_t REVC0_f;
  };
       uint8_t RESERVED16[58];
  union {
    __IO uint16_t TRG1;
    stc_mft_ppg_trg1_field_t TRG1_f;
  };
       uint8_t RESERVED17[2];
  union {
    __IO uint16_t REVC1;
    stc_mft_ppg_revc1_field_t REVC1_f;
  };
       uint8_t RESERVED18[186];
  union {
    __IO  uint8_t PPGC1;
    stc_mft_ppg_ppgc1_field_t PPGC1_f;
  };
  union {
    __IO  uint8_t PPGC0;
    stc_mft_ppg_ppgc0_field_t PPGC0_f;
  };
       uint8_t RESERVED20[2];
  union {
    __IO  uint8_t PPGC3;
    stc_mft_ppg_ppgc3_field_t PPGC3_f;
  };
  union {
    __IO  uint8_t PPGC2;
    stc_mft_ppg_ppgc2_field_t PPGC2_f;
  };
       uint8_t RESERVED22[2];
  union {
    __IO  uint8_t PRLL0;
    stc_mft_ppg_prll0_field_t PRLL0_f;
  };
  union {
    __IO  uint8_t PRLH0;
    stc_mft_ppg_prlh0_field_t PRLH0_f;
  };
       uint8_t RESERVED24[2];
  union {
    __IO  uint8_t PRLL1;
    stc_mft_ppg_prll1_field_t PRLL1_f;
  };
  union {
    __IO  uint8_t PRLH1;
    stc_mft_ppg_prlh1_field_t PRLH1_f;
  };
       uint8_t RESERVED26[2];
  union {
    __IO  uint8_t PRLL2;
    stc_mft_ppg_prll2_field_t PRLL2_f;
  };
  union {
    __IO  uint8_t PRLH2;
    stc_mft_ppg_prlh2_field_t PRLH2_f;
  };
       uint8_t RESERVED28[2];
  union {
    __IO  uint8_t PRLL3;
    stc_mft_ppg_prll3_field_t PRLL3_f;
  };
  union {
    __IO  uint8_t PRLH3;
    stc_mft_ppg_prlh3_field_t PRLH3_f;
  };
       uint8_t RESERVED30[2];
  union {
    __IO  uint8_t GATEC0;
    stc_mft_ppg_gatec0_field_t GATEC0_f;
  };
       uint8_t RESERVED31[39];
  union {
    __IO  uint8_t PPGC5;
    stc_mft_ppg_ppgc5_field_t PPGC5_f;
  };
  union {
    __IO  uint8_t PPGC4;
    stc_mft_ppg_ppgc4_field_t PPGC4_f;
  };
       uint8_t RESERVED33[2];
  union {
    __IO  uint8_t PPGC7;
    stc_mft_ppg_ppgc7_field_t PPGC7_f;
  };
  union {
    __IO  uint8_t PPGC6;
    stc_mft_ppg_ppgc6_field_t PPGC6_f;
  };
       uint8_t RESERVED35[2];
  union {
    __IO  uint8_t PRLL4;
    stc_mft_ppg_prll4_field_t PRLL4_f;
  };
  union {
    __IO  uint8_t PRLH4;
    stc_mft_ppg_prlh4_field_t PRLH4_f;
  };
       uint8_t RESERVED37[2];
  union {
    __IO  uint8_t PRLL5;
    stc_mft_ppg_prll5_field_t PRLL5_f;
  };
  union {
    __IO  uint8_t PRLH5;
    stc_mft_ppg_prlh5_field_t PRLH5_f;
  };
       uint8_t RESERVED39[2];
  union {
    __IO  uint8_t PRLL6;
    stc_mft_ppg_prll6_field_t PRLL6_f;
  };
  union {
    __IO  uint8_t PRLH6;
    stc_mft_ppg_prlh6_field_t PRLH6_f;
  };
       uint8_t RESERVED41[2];
  union {
    __IO  uint8_t PRLL7;
    stc_mft_ppg_prll7_field_t PRLL7_f;
  };
  union {
    __IO  uint8_t PRLH7;
    stc_mft_ppg_prlh7_field_t PRLH7_f;
  };
       uint8_t RESERVED43[2];
  union {
    __IO  uint8_t GATEC4;
    stc_mft_ppg_gatec4_field_t GATEC4_f;
  };
       uint8_t RESERVED44[39];
  union {
    __IO  uint8_t PPGC9;
    stc_mft_ppg_ppgc9_field_t PPGC9_f;
  };
  union {
    __IO  uint8_t PPGC8;
    stc_mft_ppg_ppgc8_field_t PPGC8_f;
  };
       uint8_t RESERVED46[2];
  union {
    __IO  uint8_t PPGC11;
    stc_mft_ppg_ppgc11_field_t PPGC11_f;
  };
  union {
    __IO  uint8_t PPGC10;
    stc_mft_ppg_ppgc10_field_t PPGC10_f;
  };
       uint8_t RESERVED48[2];
  union {
    __IO  uint8_t PRLL8;
    stc_mft_ppg_prll8_field_t PRLL8_f;
  };
  union {
    __IO  uint8_t PRLH8;
    stc_mft_ppg_prlh8_field_t PRLH8_f;
  };
       uint8_t RESERVED50[2];
  union {
    __IO  uint8_t PRLL9;
    stc_mft_ppg_prll9_field_t PRLL9_f;
  };
  union {
    __IO  uint8_t PRLH9;
    stc_mft_ppg_prlh9_field_t PRLH9_f;
  };
       uint8_t RESERVED52[2];
  union {
    __IO  uint8_t PRLL10;
    stc_mft_ppg_prll10_field_t PRLL10_f;
  };
  union {
    __IO  uint8_t PRLH10;
    stc_mft_ppg_prlh10_field_t PRLH10_f;
  };
       uint8_t RESERVED54[2];
  union {
    __IO  uint8_t PRLL11;
    stc_mft_ppg_prll11_field_t PRLL11_f;
  };
  union {
    __IO  uint8_t PRLH11;
    stc_mft_ppg_prlh11_field_t PRLH11_f;
  };
       uint8_t RESERVED56[2];
  union {
    __IO  uint8_t GATEC8;
    stc_mft_ppg_gatec8_field_t GATEC8_f;
  };
       uint8_t RESERVED57[39];
  union {
    __IO  uint8_t PPGC13;
    stc_mft_ppg_ppgc13_field_t PPGC13_f;
  };
  union {
    __IO  uint8_t PPGC12;
    stc_mft_ppg_ppgc12_field_t PPGC12_f;
  };
       uint8_t RESERVED59[2];
  union {
    __IO  uint8_t PPGC15;
    stc_mft_ppg_ppgc15_field_t PPGC15_f;
  };
  union {
    __IO  uint8_t PPGC14;
    stc_mft_ppg_ppgc14_field_t PPGC14_f;
  };
       uint8_t RESERVED61[2];
  union {
    __IO  uint8_t PRLL12;
    stc_mft_ppg_prll12_field_t PRLL12_f;
  };
  union {
    __IO  uint8_t PRLH12;
    stc_mft_ppg_prlh12_field_t PRLH12_f;
  };
       uint8_t RESERVED63[2];
  union {
    __IO  uint8_t PRLL13;
    stc_mft_ppg_prll13_field_t PRLL13_f;
  };
  union {
    __IO  uint8_t PRLH13;
    stc_mft_ppg_prlh13_field_t PRLH13_f;
  };
       uint8_t RESERVED65[2];
  union {
    __IO  uint8_t PRLL14;
    stc_mft_ppg_prll14_field_t PRLL14_f;
  };
  union {
    __IO  uint8_t PRLH14;
    stc_mft_ppg_prlh14_field_t PRLH14_f;
  };
       uint8_t RESERVED67[2];
  union {
    __IO  uint8_t PRLL15;
    stc_mft_ppg_prll15_field_t PRLL15_f;
  };
  union {
    __IO  uint8_t PRLH15;
    stc_mft_ppg_prlh15_field_t PRLH15_f;
  };
       uint8_t RESERVED69[2];
  union {
    __IO  uint8_t GATEC12;
    stc_mft_ppg_gatec12_field_t GATEC12_f;
  };
       uint8_t RESERVED70[39];
  union {
    __IO  uint8_t PPGC17;
    stc_mft_ppg_ppgc17_field_t PPGC17_f;
  };
  union {
    __IO  uint8_t PPGC16;
    stc_mft_ppg_ppgc16_field_t PPGC16_f;
  };
       uint8_t RESERVED72[2];
  union {
    __IO  uint8_t PPGC19;
    stc_mft_ppg_ppgc19_field_t PPGC19_f;
  };
  union {
    __IO  uint8_t PPGC18;
    stc_mft_ppg_ppgc18_field_t PPGC18_f;
  };
       uint8_t RESERVED74[2];
  union {
    __IO  uint8_t PRLL16;
    stc_mft_ppg_prll16_field_t PRLL16_f;
  };
  union {
    __IO  uint8_t PRLH16;
    stc_mft_ppg_prlh16_field_t PRLH16_f;
  };
       uint8_t RESERVED76[2];
  union {
    __IO  uint8_t PRLL17;
    stc_mft_ppg_prll17_field_t PRLL17_f;
  };
  union {
    __IO  uint8_t PRLH17;
    stc_mft_ppg_prlh17_field_t PRLH17_f;
  };
       uint8_t RESERVED78[2];
  union {
    __IO  uint8_t PRLL18;
    stc_mft_ppg_prll18_field_t PRLL18_f;
  };
  union {
    __IO  uint8_t PRLH18;
    stc_mft_ppg_prlh18_field_t PRLH18_f;
  };
       uint8_t RESERVED80[2];
  union {
    __IO  uint8_t PRLL19;
    stc_mft_ppg_prll19_field_t PRLL19_f;
  };
  union {
    __IO  uint8_t PRLH19;
    stc_mft_ppg_prlh19_field_t PRLH19_f;
  };
       uint8_t RESERVED82[2];
  union {
    __IO  uint8_t GATEC16;
    stc_mft_ppg_gatec16_field_t GATEC16_f;
  };
       uint8_t RESERVED83[39];
  union {
    __IO  uint8_t PPGC21;
    stc_mft_ppg_ppgc21_field_t PPGC21_f;
  };
  union {
    __IO  uint8_t PPGC20;
    stc_mft_ppg_ppgc20_field_t PPGC20_f;
  };
       uint8_t RESERVED85[2];
  union {
    __IO  uint8_t PPGC23;
    stc_mft_ppg_ppgc23_field_t PPGC23_f;
  };
  union {
    __IO  uint8_t PPGC22;
    stc_mft_ppg_ppgc22_field_t PPGC22_f;
  };
       uint8_t RESERVED87[2];
  union {
    __IO  uint8_t PRLL20;
    stc_mft_ppg_prll20_field_t PRLL20_f;
  };
  union {
    __IO  uint8_t PRLH20;
    stc_mft_ppg_prlh20_field_t PRLH20_f;
  };
       uint8_t RESERVED89[2];
  union {
    __IO  uint8_t PRLL21;
    stc_mft_ppg_prll21_field_t PRLL21_f;
  };
  union {
    __IO  uint8_t PRLH21;
    stc_mft_ppg_prlh21_field_t PRLH21_f;
  };
       uint8_t RESERVED91[2];
  union {
    __IO  uint8_t PRLL22;
    stc_mft_ppg_prll22_field_t PRLL22_f;
  };
  union {
    __IO  uint8_t PRLH22;
    stc_mft_ppg_prlh22_field_t PRLH22_f;
  };
       uint8_t RESERVED93[2];
  union {
    __IO  uint8_t PRLL23;
    stc_mft_ppg_prll23_field_t PRLL23_f;
  };
  union {
    __IO  uint8_t PRLH23;
    stc_mft_ppg_prlh23_field_t PRLH23_f;
  };
       uint8_t RESERVED95[2];
  union {
    __IO  uint8_t GATEC20;
    stc_mft_ppg_gatec20_field_t GATEC20_f;
  };
       uint8_t RESERVED96[39];
  union {
    __IO  uint8_t IGBTC;
    stc_mft_ppg_igbtc_field_t IGBTC_f;
  };
}FM0P_MFT_PPG_TypeDef;

