furjie/Single-BLDC-driver-and-app/s6e1a1.h
/******************************************************************************
 * BT_PPG_MODULE
 ******************************************************************************/
/* Base Timer 0 PPG registers */
typedef struct
{
  __IO uint16_t PRLL;
        uint8_t RESERVED0[2];
  __IO uint16_t PRLH;
        uint8_t RESERVED1[2];
  __IO uint16_t TMR;
        uint8_t RESERVED2[2];
  union {
    __IO uint16_t TMCR;
    stc_bt_ppg_tmcr_field_t TMCR_f;
  };
        uint8_t RESERVED3[2];
  union {
    __IO  uint8_t STC;
    stc_bt_ppg_stc_field_t STC_f;
  };
  union {
    __IO  uint8_t TMCR2;
    stc_bt_ppg_tmcr2_field_t TMCR2_f;
  };
}FM0P_BT_PPG_TypeDef;

/******************************************************************************
 * BT_PWM_MODULE
 ******************************************************************************/
/* Base Timer 0 PWM registers */
typedef struct
{
  __IO uint16_t PCSR;
        uint8_t RESERVED0[2];
  __IO uint16_t PDUT;
        uint8_t RESERVED1[2];
  __IO uint16_t TMR;
        uint8_t RESERVED2[2];
  union {
    __IO uint16_t TMCR;
    stc_bt_pwm_tmcr_field_t TMCR_f;
  };
        uint8_t RESERVED3[2];
  union {
    __IO  uint8_t STC;
    stc_bt_pwm_stc_field_t STC_f;
  };
  union {
    __IO  uint8_t TMCR2;
    stc_bt_pwm_tmcr2_field_t TMCR2_f;
  };
}FM0P_BT_PWM_TypeDef;

/******************************************************************************
 * BT_RT_MODULE
 ******************************************************************************/
/* Base Timer 0 RT registers */
typedef struct
{
  __IO uint16_t PCSR;
        uint8_t RESERVED0[6];
  __IO uint16_t TMR;
        uint8_t RESERVED1[2];
  union {
    __IO uint16_t TMCR;
    stc_bt_rt_tmcr_field_t TMCR_f;
  };
        uint8_t RESERVED2[2];
  union {
    __IO  uint8_t STC;
    stc_bt_rt_stc_field_t STC_f;
  };
  union {
    __IO  uint8_t TMCR2;
    stc_bt_rt_tmcr2_field_t TMCR2_f;
  };
}FM0P_BT_RT_TypeDef;

/******************************************************************************
 * BT_PWC_MODULE
 ******************************************************************************/
/* Base Timer 0 PWC registers */
typedef struct
{
        uint8_t RESERVED0[4];
  __IO uint16_t DTBF;
        uint8_t RESERVED1[6];
  union {
    __IO uint16_t TMCR;
    stc_bt_pwc_tmcr_field_t TMCR_f;
  };
        uint8_t RESERVED2[2];
  union {
    __IO  uint8_t STC;
    stc_bt_pwc_stc_field_t STC_f;
  };
  union {
    __IO  uint8_t TMCR2;
    stc_bt_pwc_tmcr2_field_t TMCR2_f;
  };
}FM0P_BT_PWC_TypeDef;

/******************************************************************************
 * BTIOSEL03_MODULE
 ******************************************************************************/
/* Base Timer I/O selector channel 0 - channel 3 registers */
typedef struct
{
  union {
    __IO uint16_t BTSEL0123;
    stc_btiosel03_btsel0123_field_t BTSEL0123_f;
  };
}FM0P_BTIOSEL03_TypeDef;

/******************************************************************************
 * SBSSR_MODULE
 ******************************************************************************/
/* Software based Simulation Startup (Base Timer) register */
typedef struct
{
  union {
    __IO uint16_t BTSSSR;
    stc_sbssr_btsssr_field_t BTSSSR_f;
  };
}FM0P_SBSSR_TypeDef;

/******************************************************************************
 * QPRC_MODULE
 ******************************************************************************/
/* Quad position and revolution counter channel 0 registers */
typedef struct
{
  __IO uint16_t QPCR;
       uint8_t RESERVED0[2];
  __IO uint16_t QRCR;
       uint8_t RESERVED1[2];
  __IO uint16_t QPCCR;
       uint8_t RESERVED2[2];
  __IO uint16_t QPRCR;
       uint8_t RESERVED3[2];
  __IO uint16_t QMPR;
       uint8_t RESERVED4[2];
  union {
    __IO  uint8_t QICRL;
    stc_qprc0_qicrl_field_t QICRL_f;
  };
  union {
    __IO  uint8_t QICRH;
    stc_qprc0_qicrh_field_t QICRH_f;
  };
       uint8_t RESERVED6[2];
  union {
    __IO  uint8_t QCRL;
    stc_qprc0_qcrl_field_t QCRL_f;
  };
  union {
    __IO  uint8_t QCRH;
    stc_qprc0_qcrh_field_t QCRH_f;
  };
       uint8_t RESERVED8[2];
  union {
    __IO uint16_t QECR;
    stc_qprc0_qecr_field_t QECR_f;
  };
       uint8_t RESERVED9[30];
  __IO uint16_t QRCRR;
  __IO uint16_t QPCRR;
}FM0P_QPRC_TypeDef;

/******************************************************************************
 * QPRC_NF_MODULE
 ******************************************************************************/
/* QPRC_NF registers */
typedef struct
{
  union {
    __IO  uint8_t NFCTLA;
    stc_qprc0_nf_nfctla_field_t NFCTLA_f;
  };
       uint8_t RESERVED0[3];
  union {
    __IO  uint8_t NFCTLB;
    stc_qprc0_nf_nfctlb_field_t NFCTLB_f;
  };
       uint8_t RESERVED1[3];
  union {
    __IO  uint8_t NFCTLZ;
    stc_qprc0_nf_nfctlz_field_t NFCTLZ_f;
  };
}FM0P_QPRC_NF_TypeDef;

/******************************************************************************
 * ADC12_MODULE
 ******************************************************************************/
/* ADC0 registers */
typedef struct
{
  union {
    __IO  uint8_t ADSR;
    stc_adc0_adsr_field_t ADSR_f;
  };
  union {
    __IO  uint8_t ADCR;
    stc_adc0_adcr_field_t ADCR_f;
  };
       uint8_t RESERVED1[6];
  union {
    __IO  uint8_t SFNS;
    stc_adc0_sfns_field_t SFNS_f;
  };
  union {
    __IO  uint8_t SCCR;
    stc_adc0_sccr_field_t SCCR_f;
  };
       uint8_t RESERVED3[2];
  union {
    __IO uint32_t SCFD;
    stc_adc0_scfd_field_t SCFD_f;
  };
  union {
    __IO  uint8_t SCIS2;
    stc_adc0_scis2_field_t SCIS2_f;
  };
  union {
    __IO  uint8_t SCIS3;
    stc_adc0_scis3_field_t SCIS3_f;
  };
       uint8_t RESERVED6[2];
  union {
    __IO  uint8_t SCIS0;
    stc_adc0_scis0_field_t SCIS0_f;
  };
  union {
    __IO  uint8_t SCIS1;
    stc_adc0_scis1_field_t SCIS1_f;
  };
       uint8_t RESERVED8[2];
  union {
    __IO  uint8_t PFNS;
    stc_adc0_pfns_field_t PFNS_f;
  };
  union {
    __IO  uint8_t PCCR;
    stc_adc0_pccr_field_t PCCR_f;
  };
       uint8_t RESERVED10[2];
  union {
    __IO uint32_t PCFD;
    stc_adc0_pcfd_field_t PCFD_f;
  };
  union {
    __IO  uint8_t PCIS;
    stc_adc0_pcis_field_t PCIS_f;
  };
       uint8_t RESERVED12[3];
  union {
    __IO  uint8_t CMPCR;
    stc_adc0_cmpcr_field_t CMPCR_f;
  };
       uint8_t RESERVED13[1];
  union {
    __IO uint16_t CMPD;
    stc_adc0_cmpd_field_t CMPD_f;
  };
  union {
    __IO  uint8_t ADSS2;
    stc_adc0_adss2_field_t ADSS2_f;
  };
  union {
    __IO  uint8_t ADSS3;
    stc_adc0_adss3_field_t ADSS3_f;
  };
       uint8_t RESERVED16[2];
  union {
    __IO  uint8_t ADSS0;
    stc_adc0_adss0_field_t ADSS0_f;
  };
  union {
    __IO  uint8_t ADSS1;
    stc_adc0_adss1_field_t ADSS1_f;
  };
       uint8_t RESERVED18[2];
  union {
    __IO  uint8_t ADST1;
    stc_adc0_adst1_field_t ADST1_f;
  };
  union {
    __IO  uint8_t ADST0;
    stc_adc0_adst0_field_t ADST0_f;
  };
       uint8_t RESERVED20[2];
  union {
    __IO  uint8_t ADCT;
    stc_adc0_adct_field_t ADCT_f;
  };
       uint8_t RESERVED21[3];
  union {
    __IO  uint8_t PRTSL;
    stc_adc0_prtsl_field_t PRTSL_f;
  };
  union {
    __IO  uint8_t SCTSL;
    stc_adc0_sctsl_field_t SCTSL_f;
  };
       uint8_t RESERVED23[2];
  union {
    __IO uint16_t ADCEN;
    stc_adc0_adcen_field_t ADCEN_f;
  };
       uint8_t RESERVED24[6];
  union {
    __IO uint32_t WCMRCIF;
    stc_adc0_wcmrcif_field_t WCMRCIF_f;
  };
  union {
    __IO uint32_t WCMRCOT;
    stc_adc0_wcmrcot_field_t WCMRCOT_f;
  };
  union {
    __IO  uint8_t WCMPCR;
    stc_adc0_wcmpcr_field_t WCMPCR_f;
  };
  union {
    __IO  uint8_t WCMPSR;
    stc_adc0_wcmpsr_field_t WCMPSR_f;
  };
       uint8_t RESERVED28[2];
  union {
    __IO uint16_t WCMPDL;
    stc_adc0_wcmpdl_field_t WCMPDL_f;
  };
  union {
    __IO uint16_t WCMPDH;
    stc_adc0_wcmpdh_field_t WCMPDH_f;
  };
}FM0P_ADC_TypeDef;

