furjie/Single-BLDC-driver-and-app/s6e1a1.h
/******************************************************************************
 * LVD_MODULE
 ******************************************************************************/
/* Low voltage detection registers */
typedef struct
{
  union {
    __IO uint16_t LVD_CTL;
    stc_lvd_lvd_ctl_field_t LVD_CTL_f;
  };
       uint8_t RESERVED0[2];
  union {
    __IO  uint8_t LVD_STR;
    stc_lvd_lvd_str_field_t LVD_STR_f;
  };
       uint8_t RESERVED1[3];
  union {
    __IO  uint8_t LVD_CLR;
    stc_lvd_lvd_clr_field_t LVD_CLR_f;
  };
       uint8_t RESERVED2[3];
  union {
    __IO uint32_t LVD_RLR;
    stc_lvd_lvd_rlr_field_t LVD_RLR_f;
  };
  union {
    __IO  uint8_t LVD_STR2;
    stc_lvd_lvd_str2_field_t LVD_STR2_f;
  };
}FM0P_LVD_TypeDef;

/******************************************************************************
 * DS_MODULE
 ******************************************************************************/
/* Deep standby mode control registers */
typedef struct
{
  union {
    __IO  uint8_t REG_CTL;
    stc_ds_reg_ctl_field_t REG_CTL_f;
  };
       uint8_t RESERVED0[3];
  union {
    __IO  uint8_t RCK_CTL;
    stc_ds_rck_ctl_field_t RCK_CTL_f;
  };
       uint8_t RESERVED1[1787];
  union {
    __IO  uint8_t PMD_CTL;
    stc_ds_pmd_ctl_field_t PMD_CTL_f;
  };
       uint8_t RESERVED2[3];
  union {
    __IO  uint8_t WRFSR;
    stc_ds_wrfsr_field_t WRFSR_f;
  };
       uint8_t RESERVED3[3];
  union {
    __IO uint16_t WIFSR;
    stc_ds_wifsr_field_t WIFSR_f;
  };
       uint8_t RESERVED4[2];
  union {
    __IO uint16_t WIER;
    stc_ds_wier_field_t WIER_f;
  };
       uint8_t RESERVED5[2];
  union {
    __IO  uint8_t WILVR;
    stc_ds_wilvr_field_t WILVR_f;
  };
       uint8_t RESERVED6[3];
  union {
    __IO  uint8_t DSRAMR;
    stc_ds_dsramr_field_t DSRAMR_f;
  };
       uint8_t RESERVED7[235];
  __IO  uint8_t BUR01;
  __IO  uint8_t BUR02;
  __IO  uint8_t BUR03;
  __IO  uint8_t BUR04;
  __IO  uint8_t BUR05;
  __IO  uint8_t BUR06;
  __IO  uint8_t BUR07;
  __IO  uint8_t BUR08;
  __IO  uint8_t BUR09;
  __IO  uint8_t BUR10;
  __IO  uint8_t BUR11;
  __IO  uint8_t BUR12;
  __IO  uint8_t BUR13;
  __IO  uint8_t BUR14;
  __IO  uint8_t BUR15;
  __IO  uint8_t BUR16;
}FM0P_DS_TypeDef;

/******************************************************************************
 * MFS_UART_MODULE
 ******************************************************************************/
/* UART channel 0, 1, 3 registers */
typedef struct
{
  union {
    __IO  uint8_t SMR;
    stc_mfs_uart_smr_field_t SMR_f;
  };
  union {
    __IO  uint8_t SCR;
    stc_mfs_uart_scr_field_t SCR_f;
  };
  uint8_t RESERVED0[2];
  union {
    __IO  uint8_t ESCR;
    stc_mfs_uart_escr_field_t ESCR_f;
  };
  union {
    __IO  uint8_t SSR;
    stc_mfs_uart_ssr_field_t SSR_f;
  };
  uint8_t RESERVED1[2];
  union {
    __IO uint16_t RDR;
    __IO uint16_t TDR;
  };
  uint8_t RESERVED2[2];
  union {
    __IO uint16_t BGR;
    stc_mfs_uart_bgr_field_t BGR_f;
  };
  uint8_t RESERVED3[6];
  union {
    __IO  uint8_t FCR0;
    stc_mfs_uart_fcr0_field_t FCR0_f;
  };
  union {
    __IO  uint8_t FCR1;
    stc_mfs_uart_fcr1_field_t FCR1_f;
  };
  uint8_t RESERVED4[2];
  __IO  uint8_t FBYTE1;
  __IO  uint8_t FBYTE2;
}FM0P_MFS_UART_TypeDef;

/******************************************************************************
 * MFS_CSIO_MODULE
 ******************************************************************************/
/* CSIO channel 0, 1, 3 registers */
typedef struct
{
  union {
    __IO  uint8_t SMR;
    stc_mfs_csio_smr_field_t SMR_f;
  };
  union {
    __IO  uint8_t SCR;
    stc_mfs_csio_scr_field_t SCR_f;
  };
  uint8_t RESERVED0[2];
  union {
    __IO  uint8_t ESCR;
    stc_mfs_csio_escr_field_t ESCR_f;
  };
  union {
    __IO  uint8_t SSR;
    stc_mfs_csio_ssr_field_t SSR_f;
  };
  uint8_t RESERVED1[2];
  union {
    __IO uint16_t RDR;
    __IO uint16_t TDR;
  };
  uint8_t RESERVED2[2];
  union {
    __IO uint16_t BGR;
    stc_mfs_csio_bgr_field_t BGR_f;
  };
  uint8_t RESERVED3[6];
  union {
    __IO  uint8_t FCR0;
    stc_mfs_csio_fcr0_field_t FCR0_f;
  };
  union {
    __IO  uint8_t FCR1;
    stc_mfs_csio_fcr1_field_t FCR1_f;
  };
  uint8_t RESERVED4[2];
  __IO  uint8_t FBYTE1;
  __IO  uint8_t FBYTE2;
  uint8_t RESERVED5[2];
  union {
    __IO  uint8_t SCSTR0;
    stc_mfs_csio_scstr0_field_t SCSTR0_f;
  };
  union {
    __IO  uint8_t SCSTR1;
    stc_mfs_csio_scstr1_field_t SCSTR1_f;
  };
  uint8_t RESERVED6[2];
  union {
    __IO uint16_t SCSTR32;
    stc_mfs_csio_scstr32_field_t SCSTR32_f;
  };
  uint8_t RESERVED7[2];
  union {
    __IO uint16_t SACSR;
    stc_mfs_csio_sacsr_field_t SACSR_f;
  };
  uint8_t RESERVED8[2];
  union {
    __IO uint16_t STMR;
    stc_mfs_csio_stmr_field_t STMR_f;
  };
       uint8_t RESERVED52[2];
  union {
    __IO uint16_t STMCR;
    stc_mfs_csio_stmcr_field_t STMCR_f;
  };
       uint8_t RESERVED9[2];
  union {
    __IO uint16_t SCSCR;
    stc_mfs_csio_scscr_field_t SCSCR_f;
  };
       uint8_t RESERVED57[2];
  union {
    __IO uint8_t SCSFR0;
    stc_mfs_csio_scsfr0_field_t SCSFR0_f;
  };
  union {
    __IO uint8_t SCSFR1;
    stc_mfs_csio_scsfr1_field_t SCSFR1_f;
  };
       uint8_t RESERVED58[2];
  union {
    __IO uint8_t SCSFR2;
    stc_mfs_csio_scsfr2_field_t SCSFR2_f;
  };
       uint8_t RESERVED10[3];
  __IO  uint8_t TBYTE0;
  __IO  uint8_t TBYTE1;
       uint8_t RESERVED56[2];
  __IO  uint8_t TBYTE2;
  __IO  uint8_t TBYTE3;
}FM0P_MFS_CSIO_TypeDef;

/******************************************************************************
 * MFS_LIN_MODULE
 ******************************************************************************/
/* LIN channel 0, 1, 3 registers */
typedef struct
{
  union {
    __IO  uint8_t SMR;
    stc_mfs_lin_smr_field_t SMR_f;
  };
  union {
    __IO  uint8_t SCR;
    stc_mfs_lin_scr_field_t SCR_f;
  };
  uint8_t RESERVED0[2];
  union {
    __IO  uint8_t ESCR;
    stc_mfs_lin_escr_field_t ESCR_f;
  };
   union {
    __IO  uint8_t SSR;
    stc_mfs_lin_ssr_field_t SSR_f;
  };
  uint8_t RESERVED1[2];
  union {
    __IO uint16_t RDR;
    __IO uint16_t TDR;
  };
  uint8_t RESERVED2[2];
  union {
    __IO uint16_t BGR;
    stc_mfs_lin_bgr_field_t BGR_f;
  };
  uint8_t RESERVED3[6];
  union {
    __IO  uint8_t FCR0;
    stc_mfs_lin_fcr0_field_t FCR0_f;
  };
  union {
    __IO  uint8_t FCR1;
    stc_mfs_lin_fcr1_field_t FCR1_f;
  };
  uint8_t RESERVED4[2];
  __IO  uint8_t FBYTE1;
  __IO  uint8_t FBYTE2;
}FM0P_MFS_LIN_TypeDef;

