furjie/Single-BLDC-driver-and-app/s6e1a1.h
/******************************************************************************
 * MFS_I2C_MODULE
 ******************************************************************************/
/* I2C channel 0, 1, 3 registers */
typedef struct
{
  union {
    __IO  uint8_t SMR;
    stc_mfs_i2c_smr_field_t SMR_f;
  };
  union {
    __IO  uint8_t IBCR;
    stc_mfs_i2c_ibcr_field_t IBCR_f;
  };
       uint8_t RESERVED0[2]; 
  union {
    __IO  uint8_t IBSR;
    stc_mfs_i2c_ibsr_field_t IBSR_f;
  };
  union {
    __IO  uint8_t SSR;
    stc_mfs_i2c_ssr_field_t SSR_f;
  };
    uint8_t RESERVED1[2];
  union {
    __IO uint16_t RDR;
    __IO uint16_t TDR;
  };
    uint8_t RESERVED2[2];
  union {
    __IO uint16_t BGR;
    stc_mfs_i2c_bgr_field_t BGR_f;
  };
       uint8_t RESERVED3[2];
  union {
    __IO  uint8_t ISBA;
    stc_mfs_i2c_isba_field_t ISBA_f;
  };
  union {
    __IO  uint8_t ISMK;
    stc_mfs_i2c_ismk_field_t ISMK_f;
  };
       uint8_t RESERVED4[2];
  union {
    __IO  uint8_t FCR0;
    stc_mfs_i2c_fcr0_field_t FCR0_f;
  };
  union {
    __IO  uint8_t FCR1;
    stc_mfs_i2c_fcr1_field_t FCR1_f;
  };
        uint8_t RESERVED5[2];
  __IO  uint8_t FBYTE1;
  __IO  uint8_t FBYTE2;
        uint8_t RESERVED6[3];
  union {
    __IO  uint8_t EIBCR;
    stc_mfs_i2c_eibcr_field_t EIBCR_f;
  };
}FM0P_MFS_I2C_TypeDef;

/******************************************************************************
 * CRC_MODULE
 ******************************************************************************/
/* CRC registers */
typedef struct
{
  union {
    __IO  uint8_t CRCCR;
    stc_crc_crccr_field_t CRCCR_f;
  };
       uint8_t RESERVED0[3];
  union {
    __IO uint32_t CRCINIT;
    stc_crc_crcinit_field_t CRCINIT_f;
  };
  union {
    __IO uint32_t CRCIN;
    stc_crc_crcin_field_t CRCIN_f;
  };
  union {
    __IO uint32_t CRCR;
    stc_crc_crcr_field_t CRCR_f;
  };
}FM0P_CRC_TypeDef;

/******************************************************************************
 * WC_MODULE
 ******************************************************************************/
/* Watch counter registers */
typedef struct
{
  union {
    __IO  uint8_t WCRD;
    stc_wc_wcrd_field_t WCRD_f;
  };
  union {
    __IO  uint8_t WCRL;
    stc_wc_wcrl_field_t WCRL_f;
  };
  union {
    __IO  uint8_t WCCR;
    stc_wc_wccr_field_t WCCR_f;
  };
       uint8_t RESERVED2[13];
  union {
    __IO uint16_t CLK_SEL;
    stc_wc_clk_sel_field_t CLK_SEL_f;
  };
       uint8_t RESERVED3[2];
  union {
    __IO  uint8_t CLK_EN;
    stc_wc_clk_en_field_t CLK_EN_f;
  };
}FM0P_WC_TypeDef;

/******************************************************************************
 * RTC_MODULE
 ******************************************************************************/
/* Realtime clock registers */
typedef struct
{
  union {
    __IO uint32_t WTCR1;
    stc_rtc_wtcr1_field_t WTCR1_f;
  };
  union {
    __IO uint32_t WTCR2;
    stc_rtc_wtcr2_field_t WTCR2_f;
  };
  union {
    __IO uint32_t WTBR;
    stc_rtc_wtbr_field_t WTBR_f;
  };
  union {
    __IO  uint8_t WTSR;
    stc_rtc_wtsr_field_t WTSR_f;
  };
  union {
    __IO  uint8_t WTMIR;
    stc_rtc_wtmir_field_t WTMIR_f;
  };
  union {
    __IO  uint8_t WTHR;
    stc_rtc_wthr_field_t WTHR_f;
  };
  union {
    __IO  uint8_t WTDR;
    stc_rtc_wtdr_field_t WTDR_f;
  };
  union {
    __IO  uint8_t WTDW;
    stc_rtc_wtdw_field_t WTDW_f;
  };
  union {
    __IO  uint8_t WTMOR;
    stc_rtc_wtmor_field_t WTMOR_f;
  };
  union {
    __IO  uint8_t WTYR;
    stc_rtc_wtyr_field_t WTYR_f;
  };
       uint8_t RESERVED9[2];
  union {
    __IO  uint8_t ALMIR;
    stc_rtc_almir_field_t ALMIR_f;
  };
  union {
    __IO  uint8_t ALHR;
    stc_rtc_alhr_field_t ALHR_f;
  };
  union {
    __IO  uint8_t ALDR;
    stc_rtc_aldr_field_t ALDR_f;
  };
       uint8_t RESERVED12[1];
  union {
    __IO  uint8_t ALMOR;
    stc_rtc_almor_field_t ALMOR_f;
  };
  union {
    __IO  uint8_t ALYR;
    stc_rtc_alyr_field_t ALYR_f;
  };
       uint8_t RESERVED14[1];
  union {
    __IO uint32_t WTTR;
    stc_rtc_wttr_field_t WTTR_f;
  };
  union {
    __IO  uint8_t WTCLKS;
    stc_rtc_wtclks_field_t WTCLKS_f;
  };
  union {
    __IO  uint8_t WTCLKM;
    stc_rtc_wtclkm_field_t WTCLKM_f;
  };
       uint8_t RESERVED17[2];
  union {
    __IO  uint16_t WTCAL;
    stc_rtc_wtcal_field_t WTCAL_f;
  };
  union {
    __IO  uint8_t WTCALEN;
    stc_rtc_wtcalen_field_t WTCALEN_f;
  };
       uint8_t RESERVED19[1];
  union {
    __IO  uint8_t WTDIV;
    stc_rtc_wtdiv_field_t WTDIV_f;
  };
  union {
    __IO  uint8_t WTDIVEN;
    stc_rtc_wtdiven_field_t WTDIVEN_f;
  };
       uint8_t RESERVED22[2];
  union {
    __IO  uint8_t WTCALPRD;
    stc_rtc_wtcalprd_field_t WTCALPRD_f;
  };
       uint8_t RESERVED24[3];
  union {
    __IO  uint8_t WTCOSEL;
    stc_rtc_wtcosel_field_t WTCOSEL_f;
  };
}FM0P_RTC_TypeDef;

/******************************************************************************
 * LSCRP_MODULE
 ******************************************************************************/
/* LSCRP registers */
typedef struct
{
  union {
    __IO  uint8_t LCR_PRSLD;
    stc_lscrp_lcr_prsld_field_t LCR_PRSLD_f;
  };
}FM0P_LSCRP_TypeDef;

/******************************************************************************
 * PCG_MODULE
 ******************************************************************************/
/* PCG registers */
typedef struct
{
  union {
    __IO uint32_t CKEN0;
    stc_pcg_cken0_field_t CKEN0_f;
  };
  union {
    __IO uint32_t MRST0;
    stc_pcg_mrst0_field_t MRST0_f;
  };
       uint8_t RESERVED1[8];
  union {
    __IO uint32_t CKEN1;
    stc_pcg_cken1_field_t CKEN1_f;
  };
  union {
    __IO uint32_t MRST1;
    stc_pcg_mrst1_field_t MRST1_f;
  };
       uint8_t RESERVED3[8];
  union {
    __IO uint32_t CKEN2;
    stc_pcg_cken2_field_t CKEN2_f;
  };
  union {
    __IO uint32_t MRST2;
    stc_pcg_mrst2_field_t MRST2_f;
  };
}FM0P_PCG_TypeDef;

