furjie/Single-BLDC-driver-and-app/s6e1a1.h
/******************************************************************************
 * DMAC_MODULE
 ******************************************************************************/
/* DMA controller */
typedef struct
{
  union {
    __IO uint32_t DMACR;
    stc_dmac_dmacr_field_t DMACR_f;
  };
       uint8_t RESERVED0[12];
  union {
    __IO uint32_t DMACA0;
    stc_dmac_dmaca0_field_t DMACA0_f;
  };
  union {
    __IO uint32_t DMACB0;
    stc_dmac_dmacb0_field_t DMACB0_f;
  };
  __IO uint32_t DMACSA0;
  __IO uint32_t DMACDA0;
  union {
    __IO uint32_t DMACA1;
    stc_dmac_dmaca1_field_t DMACA1_f;
  };
  union {
    __IO uint32_t DMACB1;
    stc_dmac_dmacb1_field_t DMACB1_f;
  };
  __IO uint32_t DMACSA1;
  __IO uint32_t DMACDA1;
  union {
    __IO uint32_t DMACA2;
    stc_dmac_dmaca2_field_t DMACA2_f;
  };
  union {
    __IO uint32_t DMACB2;
    stc_dmac_dmacb2_field_t DMACB2_f;
  };
  __IO uint32_t DMACSA2;
  __IO uint32_t DMACDA2;
  union {
    __IO uint32_t DMACA3;
    stc_dmac_dmaca3_field_t DMACA3_f;
  };
  union {
    __IO uint32_t DMACB3;
    stc_dmac_dmacb3_field_t DMACB3_f;
  };
  __IO uint32_t DMACSA3;
  __IO uint32_t DMACDA3;
  union {
    __IO uint32_t DMACA4;
    stc_dmac_dmaca4_field_t DMACA4_f;
  };
  union {
    __IO uint32_t DMACB4;
    stc_dmac_dmacb4_field_t DMACB4_f;
  };
  __IO uint32_t DMACSA4;
  __IO uint32_t DMACDA4;
  union {
    __IO uint32_t DMACA5;
    stc_dmac_dmaca5_field_t DMACA5_f;
  };
  union {
    __IO uint32_t DMACB5;
    stc_dmac_dmacb5_field_t DMACB5_f;
  };
  __IO uint32_t DMACSA5;
  __IO uint32_t DMACDA5;
  union {
    __IO uint32_t DMACA6;
    stc_dmac_dmaca6_field_t DMACA6_f;
  };
  union {
    __IO uint32_t DMACB6;
    stc_dmac_dmacb6_field_t DMACB6_f;
  };
  __IO uint32_t DMACSA6;
  __IO uint32_t DMACDA6;
  union {
    __IO uint32_t DMACA7;
    stc_dmac_dmaca7_field_t DMACA7_f;
  };
  union {
    __IO uint32_t DMACB7;
    stc_dmac_dmacb7_field_t DMACB7_f;
  };
  __IO uint32_t DMACSA7;
  __IO uint32_t DMACDA7;
}FM0P_DMAC_TypeDef;

/******************************************************************************
 * MTB_DWT_MODULE
 ******************************************************************************/
/* MTB_DWT registers */
typedef struct
{
  __IO uint32_t CMP_ADDR_START;
  __IO uint32_t CMP_DATA_START;
  __IO uint32_t CMP_MASK_START;
       uint8_t RESERVED2[4];
  __IO uint32_t CMP_ADDR_STOP;
  __IO uint32_t CMP_DATA_STOP;
  __IO uint32_t CMP_MASK_STOP;
       uint8_t RESERVED5[4];
  union {
    __IO  uint8_t FCT;
    stc_mtb_dwt_fct_field_t FCT_f;
  };
       uint8_t RESERVED6[4015];
  __IO uint32_t PID4;
  __IO uint32_t PID5;
  __IO uint32_t PID6;
  __IO uint32_t PID7;
  __IO uint32_t PID0;
  __IO uint32_t PID1;
  __IO uint32_t PID2;
  __IO uint32_t PID3;
  __IO uint32_t CID0;
  __IO uint32_t CID1;
  __IO uint32_t CID2;
  __IO uint32_t CID3;
}FM0P_MTB_DWT_TypeDef;

/******************************************************************************
 * FASTIO_MODULE
 ******************************************************************************/
/* FASTIO registers */
typedef struct
{
  union {
    __IO uint32_t FPDIR0;
    stc_fastio_fpdir0_field_t FPDIR0_f;
  };
  union {
    __IO uint32_t FPDIR1;
    stc_fastio_fpdir1_field_t FPDIR1_f;
  };
  union {
    __IO uint32_t FPDIR2;
    stc_fastio_fpdir2_field_t FPDIR2_f;
  };
  union {
    __IO uint32_t FPDIR3;
    stc_fastio_fpdir3_field_t FPDIR3_f;
  };
  union {
    __IO uint32_t FPDIR4;
    stc_fastio_fpdir4_field_t FPDIR4_f;
  };
  union {
    __IO uint32_t FPDIR5;
    stc_fastio_fpdir5_field_t FPDIR5_f;
  };
  union {
    __IO uint32_t FPDIR6;
    stc_fastio_fpdir6_field_t FPDIR6_f;
  };
       uint8_t RESERVED6[4];
  union {
    __IO uint32_t FPDIR8;
    stc_fastio_fpdir8_field_t FPDIR8_f;
  };
       uint8_t RESERVED7[20];
  union {
    __IO uint32_t FPDIRE;
    stc_fastio_fpdire_field_t FPDIRE_f;
  };
       uint8_t RESERVED8[4];
  union {
    __IO uint32_t FPDOR0;
    stc_fastio_fpdor0_field_t FPDOR0_f;
  };
  union {
    __IO uint32_t FPDOR1;
    stc_fastio_fpdor1_field_t FPDOR1_f;
  };
  union {
    __IO uint32_t FPDOR2;
    stc_fastio_fpdor2_field_t FPDOR2_f;
  };
  union {
    __IO uint32_t FPDOR3;
    stc_fastio_fpdor3_field_t FPDOR3_f;
  };
  union {
    __IO uint32_t FPDOR4;
    stc_fastio_fpdor4_field_t FPDOR4_f;
  };
  union {
    __IO uint32_t FPDOR5;
    stc_fastio_fpdor5_field_t FPDOR5_f;
  };
  union {
    __IO uint32_t FPDOR6;
    stc_fastio_fpdor6_field_t FPDOR6_f;
  };
       uint8_t RESERVED15[4];
  union {
    __IO uint32_t FPDOR8;
    stc_fastio_fpdor8_field_t FPDOR8_f;
  };
       uint8_t RESERVED16[20];
  union {
    __IO uint32_t FPDORE;
    stc_fastio_fpdore_field_t FPDORE_f;
  };
       uint8_t RESERVED17[4];
  union {
    __IO uint32_t M_FPDIR0;
    stc_fastio_m_fpdir0_field_t M_FPDIR0_f;
  };
  union {
    __IO uint32_t M_FPDIR1;
    stc_fastio_m_fpdir1_field_t M_FPDIR1_f;
  };
       uint8_t RESERVED19[56];
  union {
    __IO uint32_t M_FPDOR0;
    stc_fastio_m_fpdor0_field_t M_FPDOR0_f;
  };
  union {
    __IO uint32_t M_FPDOR1;
    stc_fastio_m_fpdor1_field_t M_FPDOR1_f;
  };
}FM0P_FASTIO_TypeDef;

/******************************************************************************
 * Peripheral memory map
 ******************************************************************************/
#define FM0P_FLASH_BASE        (0x00000000UL)                 /* Flash Base                             */
#define FM0P_PERIPH_BASE       (0x40000000UL)                 /* Peripheral  Base                       */
#define FM0P_CM0P_BASE         (0xE0000000UL)                 /* CM0P Private                            */

#define FM0P_FLASH_IF_BASE     (FM0P_PERIPH_BASE + 0x00000UL)  /* Flash interface registers              */
#define FM0P_UNIQUE_ID_BASE    (FM0P_PERIPH_BASE + 0x00200UL)  /* Unique ID registers                    */
#define FM0P_CRG_BASE          (FM0P_PERIPH_BASE + 0x10000UL)  /* Clock and reset registers              */
#define FM0P_HWWDT_BASE        (FM0P_PERIPH_BASE + 0x11000UL)  /* Hardware watchdog registers            */
#define FM0P_SWWDT_BASE        (FM0P_PERIPH_BASE + 0x12000UL)  /* Software watchdog registers            */
#define FM0P_DTIM_BASE         (FM0P_PERIPH_BASE + 0x15000UL)  /* Dual timer 1/2 registers               */
#define FM0P_MFT0_FRT_BASE     (FM0P_PERIPH_BASE + 0x20100UL)  /* Multifunction Timer unit 0 Free Running Timer registers */
#define FM0P_MFT0_OCU_BASE     (FM0P_PERIPH_BASE + 0x20100UL)  /* Multifunction Timer unit 0 Output Compare Unit registers */
#define FM0P_MFT0_WFG_BASE     (FM0P_PERIPH_BASE + 0x20100UL)  /* Multifunction Timer unit 0 Waveform Generator and Noise Canceler registers */
#define FM0P_MFT0_ICU_BASE     (FM0P_PERIPH_BASE + 0x20100UL)  /* Multifunction Timer unit 0 Input Capture Unit registers */
#define FM0P_MFT0_ADCMP_BASE   (FM0P_PERIPH_BASE + 0x20100UL)  /* Multifunction Timer unit 0 ADC Start Compare Unit registers */
#define FM0P_MFT_PPG_BASE      (FM0P_PERIPH_BASE + 0x24000UL)  /* Multifunction Timer PPG registers      */
#define FM0P_BT0_PPG_BASE      (FM0P_PERIPH_BASE + 0x25000UL)  /* Base Timer 0 PPG registers             */
#define FM0P_BT0_PWM_BASE      (FM0P_PERIPH_BASE + 0x25000UL)  /* Base Timer 0 PWM registers             */
#define FM0P_BT0_RT_BASE       (FM0P_PERIPH_BASE + 0x25000UL)  /* Base Timer 0 RT registers              */
#define FM0P_BT0_PWC_BASE      (FM0P_PERIPH_BASE + 0x25000UL)  /* Base Timer 0 PWC registers             */
#define FM0P_BT1_PPG_BASE      (FM0P_PERIPH_BASE + 0x25040UL)  /* Base Timer 1 PPG registers             */
#define FM0P_BT1_PWM_BASE      (FM0P_PERIPH_BASE + 0x25040UL)  /* Base Timer 1 PWM registers             */
#define FM0P_BT1_RT_BASE       (FM0P_PERIPH_BASE + 0x25040UL)  /* Base Timer 1 RT registers              */
#define FM0P_BT1_PWC_BASE      (FM0P_PERIPH_BASE + 0x25040UL)  /* Base Timer 1 PWC registers             */
#define FM0P_BT2_PPG_BASE      (FM0P_PERIPH_BASE + 0x25080UL)  /* Base Timer 2 PPG registers             */
#define FM0P_BT2_PWM_BASE      (FM0P_PERIPH_BASE + 0x25080UL)  /* Base Timer 2 PWM registers             */
#define FM0P_BT2_RT_BASE       (FM0P_PERIPH_BASE + 0x25080UL)  /* Base Timer 2 RT registers              */
#define FM0P_BT2_PWC_BASE      (FM0P_PERIPH_BASE + 0x25080UL)  /* Base Timer 2 PWC registers             */
#define FM0P_BT3_PPG_BASE      (FM0P_PERIPH_BASE + 0x250C0UL)  /* Base Timer 3 PPG registers             */
#define FM0P_BT3_PWM_BASE      (FM0P_PERIPH_BASE + 0x250C0UL)  /* Base Timer 3 PWM registers             */
#define FM0P_BT3_RT_BASE       (FM0P_PERIPH_BASE + 0x250C0UL)  /* Base Timer 3 RT registers              */
#define FM0P_BT3_PWC_BASE      (FM0P_PERIPH_BASE + 0x250C0UL)  /* Base Timer 3 PWC registers             */
#define FM0P_BTIOSEL03_BASE    (FM0P_PERIPH_BASE + 0x25100UL)  /* Base Timer I/O selector channel 0 - channel 3 registers */
#define FM0P_SBSSR_BASE        (FM0P_PERIPH_BASE + 0x25FFCUL)  /* Software based Simulation Startup (Base Timer) register */
#define FM0P_QPRC0_BASE        (FM0P_PERIPH_BASE + 0x26000UL)  /* Quad position and revolution counter channel 0 registers */
#define FM0P_QPRC0_NF_BASE     (FM0P_PERIPH_BASE + 0x26100UL)  /* Quad position and revolution counter channel 0 noise Control Register*/
#define FM0P_ADC0_BASE         (FM0P_PERIPH_BASE + 0x27000UL)  /* 12-bit ADC unit 0 registers            */
#define FM0P_CRTRIM_BASE       (FM0P_PERIPH_BASE + 0x2E000UL)  /* CR trimming registers                  */
#define FM0P_EXTI_BASE         (FM0P_PERIPH_BASE + 0x30000UL)  /* External interrupt registers           */
#define FM0P_INTREQ_BASE       (FM0P_PERIPH_BASE + 0x31000UL)  /* Interrupt request read registers       */
#define FM0P_GPIO_BASE         (FM0P_PERIPH_BASE + 0x33000UL)  /* General purpose I/O registers          */
#define FM0P_LVD_BASE          (FM0P_PERIPH_BASE + 0x35000UL)  /* Low voltage detection registers        */
#define FM0P_DS_BASE           (FM0P_PERIPH_BASE + 0x35100UL)  /* Deep stanby mode control registers     */
#define FM0P_MFS0_UART_BASE    (FM0P_PERIPH_BASE + 0x38000UL)  /* UART asynchronous channel 0 registers  */
#define FM0P_MFS0_CSIO_BASE    (FM0P_PERIPH_BASE + 0x38000UL)  /* UART synchronous channel 0 registers   */
#define FM0P_MFS0_LIN_BASE     (FM0P_PERIPH_BASE + 0x38000UL)  /* LIN channel 0 registers                */
#define FM0P_MFS0_I2C_BASE     (FM0P_PERIPH_BASE + 0x38000UL)  /* I2C channel 0 registers                */
#define FM0P_MFS1_UART_BASE    (FM0P_PERIPH_BASE + 0x38100UL)  /* UART asynchronous channel 1 registers  */
#define FM0P_MFS1_CSIO_BASE    (FM0P_PERIPH_BASE + 0x38100UL)  /* UART synchronous channel 1 registers   */
#define FM0P_MFS1_LIN_BASE     (FM0P_PERIPH_BASE + 0x38100UL)  /* LIN channel 1 registers                */
#define FM0P_MFS1_I2C_BASE     (FM0P_PERIPH_BASE + 0x38100UL)  /* I2C channel 1 registers                */
#define FM0P_MFS3_UART_BASE    (FM0P_PERIPH_BASE + 0x38300UL)  /* UART asynchronous channel 3 registers  */
#define FM0P_MFS3_CSIO_BASE    (FM0P_PERIPH_BASE + 0x38300UL)  /* UART synchronous channel 3 registers   */
#define FM0P_MFS3_LIN_BASE     (FM0P_PERIPH_BASE + 0x38300UL)  /* LIN channel 3 registers                */
#define FM0P_MFS3_I2C_BASE     (FM0P_PERIPH_BASE + 0x38300UL)  /* I2C channel 3 registers                */
#define FM0P_CRC_BASE          (FM0P_PERIPH_BASE + 0x39000UL)  /* CRC registers                          */
#define FM0P_WC_BASE           (FM0P_PERIPH_BASE + 0x3A000UL)  /* Watch counter registers                */
#define FM0P_RTC_BASE          (FM0P_PERIPH_BASE + 0x3B000UL)  /* Realtime clock  registers              */
#define FM0P_LSCRP_BASE        (FM0P_PERIPH_BASE + 0x3C000UL)  /* Low-speed CR Prescaler Gating registers*/
#define FM0P_PCG_BASE          (FM0P_PERIPH_BASE + 0x3C100UL)  /* Peripheral Clock Gating registers      */
#define FM0P_DMAC_BASE         (FM0P_PERIPH_BASE + 0x60000UL)  /* DMA controller                         */
#define FM0P_MTB_DWT_BASE      (0xF0001000UL)                  /* MTB DWT                                */
#define FM0P_FASTIO_BASE       (0xF8000000UL)                  /* Fast GPIO                              */

