furjie/Single-BLDC-driver-and-app/s6e1a1.h
/******************************************************************************
 * Peripheral declaration
 ******************************************************************************/
#define FM0P_FLASH_IF    ((FM0P_FLASH_IF_TypeDef *)FM0P_FLASH_IF_BASE)
#define FM0P_UNIQUE_ID   ((FM0P_UNIQUE_ID_TypeDef *)FM0P_UNIQUE_ID_BASE)
#define FM0P_CRG         ((FM0P_CRG_TypeDef *)FM0P_CRG_BASE)
#define FM0P_HWWDT       ((FM0P_HWWDT_TypeDef *)FM0P_HWWDT_BASE)
#define FM0P_SWWDT       ((FM0P_SWWDT_TypeDef *)FM0P_SWWDT_BASE)
#define FM0P_DTIM        ((FM0P_DTIM_TypeDef *)FM0P_DTIM_BASE)
#define FM0P_MFT0_FRT    ((FM0P_MFT_FRT_TypeDef *)FM0P_MFT0_FRT_BASE)
#define FM0P_MFT0_OCU    ((FM0P_MFT_OCU_TypeDef *)FM0P_MFT0_OCU_BASE)
#define FM0P_MFT0_WFG    ((FM0P_MFT_WFG_TypeDef *)FM0P_MFT0_WFG_BASE)
#define FM0P_MFT0_ICU    ((FM0P_MFT_ICU_TypeDef *)FM0P_MFT0_ICU_BASE)
#define FM0P_MFT0_ADCMP  ((FM0P_MFT_ADCMP_TypeDef *)FM0P_MFT0_ADCMP_BASE)
#define FM0P_MFT_PPG     ((FM0P_MFT_PPG_TypeDef *)FM0P_MFT_PPG_BASE)
#define FM0P_BT0_PPG     ((FM0P_BT_PPG_TypeDef *)FM0P_BT0_PPG_BASE)
#define FM0P_BT0_PWM     ((FM0P_BT_PWM_TypeDef *)FM0P_BT0_PWM_BASE)
#define FM0P_BT0_RT      ((FM0P_BT_RT_TypeDef *)FM0P_BT0_RT_BASE)
#define FM0P_BT0_PWC     ((FM0P_BT_PWC_TypeDef *)FM0P_BT0_PWC_BASE)
#define FM0P_BT1_PPG     ((FM0P_BT_PPG_TypeDef *)FM0P_BT1_PPG_BASE)
#define FM0P_BT1_PWM     ((FM0P_BT_PWM_TypeDef *)FM0P_BT1_PWM_BASE)
#define FM0P_BT1_RT      ((FM0P_BT_RT_TypeDef *)FM0P_BT1_RT_BASE)
#define FM0P_BT1_PWC     ((FM0P_BT_PWC_TypeDef *)FM0P_BT1_PWC_BASE)
#define FM0P_BT2_PPG     ((FM0P_BT_PPG_TypeDef *)FM0P_BT2_PPG_BASE)
#define FM0P_BT2_PWM     ((FM0P_BT_PWM_TypeDef *)FM0P_BT2_PWM_BASE)
#define FM0P_BT2_RT      ((FM0P_BT_RT_TypeDef *)FM0P_BT2_RT_BASE)
#define FM0P_BT2_PWC     ((FM0P_BT_PWC_TypeDef *)FM0P_BT2_PWC_BASE)
#define FM0P_BT3_PPG     ((FM0P_BT_PPG_TypeDef *)FM0P_BT3_PPG_BASE)
#define FM0P_BT3_PWM     ((FM0P_BT_PWM_TypeDef *)FM0P_BT3_PWM_BASE)
#define FM0P_BT3_RT      ((FM0P_BT_RT_TypeDef *)FM0P_BT3_RT_BASE)
#define FM0P_BT3_PWC     ((FM0P_BT_PWC_TypeDef *)FM0P_BT3_PWC_BASE)
#define FM0P_BTIOSEL03   ((FM0P_BTIOSEL03_TypeDef *)FM0P_BTIOSEL03_BASE)
#define FM0P_SBSSR       ((FM0P_SBSSR_TypeDef *)FM0P_SBSSR_BASE)
#define FM0P_QPRC0       ((FM0P_QPRC_TypeDef *)FM0P_QPRC0_BASE)
#define FM0P_QPRC0_NF    ((FM0P_QPRC_NF_TypeDef *)FM0P_QPRC0_NF_BASE)
#define FM0P_ADC0        ((FM0P_ADC_TypeDef *)FM0P_ADC0_BASE)
#define FM0P_CRTRIM      ((FM0P_CRTRIM_TypeDef *)FM0P_CRTRIM_BASE)
#define FM0P_EXTI        ((FM0P_EXTI_TypeDef *)FM0P_EXTI_BASE)
#define FM0P_INTREQ      ((FM0P_INTREQ_TypeDef *)FM0P_INTREQ_BASE)
#define FM0P_GPIO        ((FM0P_GPIO_TypeDef *)FM0P_GPIO_BASE)
#define FM0P_LVD         ((FM0P_LVD_TypeDef *)FM0P_LVD_BASE)
#define FM0P_DS          ((FM0P_DS_TypeDef *)FM0P_DS_BASE)
#define FM0P_MFS0_UART   ((FM0P_MFS_UART_TypeDef *)FM0P_MFS0_UART_BASE)
#define FM0P_MFS0_CSIO   ((FM0P_MFS_CSIO_TypeDef *)FM0P_MFS0_CSIO_BASE)
#define FM0P_MFS0_LIN    ((FM0P_MFS_LIN_TypeDef *)FM0P_MFS0_LIN_BASE)
#define FM0P_MFS0_I2C    ((FM0P_MFS_I2C_TypeDef *)FM0P_MFS0_I2C_BASE)
#define FM0P_MFS1_UART   ((FM0P_MFS_UART_TypeDef *)FM0P_MFS1_UART_BASE)
#define FM0P_MFS1_CSIO   ((FM0P_MFS_CSIO_TypeDef *)FM0P_MFS1_CSIO_BASE)
#define FM0P_MFS1_LIN    ((FM0P_MFS_LIN_TypeDef *)FM0P_MFS1_LIN_BASE)
#define FM0P_MFS1_I2C    ((FM0P_MFS_I2C_TypeDef *)FM0P_MFS1_I2C_BASE)
#define FM0P_MFS3_UART   ((FM0P_MFS_UART_TypeDef *)FM0P_MFS3_UART_BASE)
#define FM0P_MFS3_CSIO   ((FM0P_MFS_CSIO_TypeDef *)FM0P_MFS3_CSIO_BASE)
#define FM0P_MFS3_LIN    ((FM0P_MFS_LIN_TypeDef *)FM0P_MFS3_LIN_BASE)
#define FM0P_MFS3_I2C    ((FM0P_MFS_I2C_TypeDef *)FM0P_MFS3_I2C_BASE)
#define FM0P_CRC         ((FM0P_CRC_TypeDef *)FM0P_CRC_BASE)
#define FM0P_WC          ((FM0P_WC_TypeDef *)FM0P_WC_BASE)
#define FM0P_RTC         ((FM0P_RTC_TypeDef *)FM0P_RTC_BASE)
#define FM0P_LCSRP       ((FM0P_LSCRP_TypeDef *)FM0P_LSCRP_BASE)
#define FM0P_PCG         ((FM0P_PCG_TypeDef *)FM0P_PCG_BASE)
#define FM0P_DMAC        ((FM0P_DMAC_TypeDef *)FM0P_DMAC_BASE)
#define FM0P_MTB_DWT     ((FM0P_MTB_DWT_TypeDef *)FM0P_MTB_DWT_BASE)
#define FM0P_FASTIO      ((FM0P_FASTIO_TypeDef *)FM0P_FASTIO_BASE)

/******************************************************************************
 * Peripheral Bit Band Alias declaration
 ******************************************************************************/
/* Flash interface registers */
#define bFM0P_FLASHIF_FRWTR_RWT0               *((volatile unsigned int*)(0x42000080UL))
#define bFM0P_FLASHIF_FRWTR_RWT1               *((volatile unsigned int*)(0x42000084UL))
#define bFM0P_FLASHIF_FSTR_RDY                 *((volatile unsigned int*)(0x42000100UL))
#define bFM0P_FLASHIF_FSTR_HNG                 *((volatile unsigned int*)(0x42000104UL))
#define bFM0P_FLASHIF_FSTR_CERS                *((volatile unsigned int*)(0x42000108UL))
#define bFM0P_FLASHIF_FSTR_ESPS                *((volatile unsigned int*)(0x4200010CUL))
#define bFM0P_FLASHIF_FSTR_SERS                *((volatile unsigned int*)(0x42000110UL))
#define bFM0P_FLASHIF_FSTR_PGMS                *((volatile unsigned int*)(0x42000114UL))
#define bFM0P_FLASHIF_FSYNDN_SD0               *((volatile unsigned int*)(0x42000200UL))
#define bFM0P_FLASHIF_FSYNDN_SD1               *((volatile unsigned int*)(0x42000204UL))
#define bFM0P_FLASHIF_FSYNDN_SD2               *((volatile unsigned int*)(0x42000208UL))
#define bFM0P_FLASHIF_FSYNDN_SD3               *((volatile unsigned int*)(0x4200020CUL))
#define bFM0P_FLASHIF_FICR_RDYIE               *((volatile unsigned int*)(0x42000400UL))
#define bFM0P_FLASHIF_FICR_HANGIE              *((volatile unsigned int*)(0x42000404UL))
#define bFM0P_FLASHIF_FISR_RDYIF               *((volatile unsigned int*)(0x42000480UL))
#define bFM0P_FLASHIF_FISR_HANGIF              *((volatile unsigned int*)(0x42000484UL))
#define bFM0P_FLASHIF_FICLR_RDYC               *((volatile unsigned int*)(0x42000500UL))
#define bFM0P_FLASHIF_FICLR_HANGC              *((volatile unsigned int*)(0x42000504UL))
#define bFM0P_FLASHIF_CRTRMM_TRMM0             *((volatile unsigned int*)(0x42002000UL))
#define bFM0P_FLASHIF_CRTRMM_TRMM1             *((volatile unsigned int*)(0x42002004UL))
#define bFM0P_FLASHIF_CRTRMM_TRMM2             *((volatile unsigned int*)(0x42002008UL))
#define bFM0P_FLASHIF_CRTRMM_TRMM3             *((volatile unsigned int*)(0x4200200CUL))
#define bFM0P_FLASHIF_CRTRMM_TRMM4             *((volatile unsigned int*)(0x42002010UL))
#define bFM0P_FLASHIF_CRTRMM_TRMM5             *((volatile unsigned int*)(0x42002014UL))
#define bFM0P_FLASHIF_CRTRMM_TRMM6             *((volatile unsigned int*)(0x42002018UL))
#define bFM0P_FLASHIF_CRTRMM_TRMM7             *((volatile unsigned int*)(0x4200201CUL))
#define bFM0P_FLASHIF_CRTRMM_TRMM8             *((volatile unsigned int*)(0x42002020UL))
#define bFM0P_FLASHIF_CRTRMM_TRMM9             *((volatile unsigned int*)(0x42002024UL))
#define bFM0P_FLASHIF_CRTRMM_TTRMM0            *((volatile unsigned int*)(0x42002040UL))
#define bFM0P_FLASHIF_CRTRMM_TTRMM1            *((volatile unsigned int*)(0x42002044UL))
#define bFM0P_FLASHIF_CRTRMM_TTRMM2            *((volatile unsigned int*)(0x42002048UL))
#define bFM0P_FLASHIF_CRTRMM_TTRMM3            *((volatile unsigned int*)(0x4200204CUL))
#define bFM0P_FLASHIF_CRTRMM_TTRMM4            *((volatile unsigned int*)(0x42002050UL))

/* Unique ID registers */
#define bFM0P_UID_UIDR0_UID0                   *((volatile unsigned int*)(0x42004010UL))
#define bFM0P_UID_UIDR0_UID1                   *((volatile unsigned int*)(0x42004014UL))
#define bFM0P_UID_UIDR0_UID2                   *((volatile unsigned int*)(0x42004018UL))
#define bFM0P_UID_UIDR0_UID3                   *((volatile unsigned int*)(0x4200401CUL))
#define bFM0P_UID_UIDR0_UID4                   *((volatile unsigned int*)(0x42004020UL))
#define bFM0P_UID_UIDR0_UID5                   *((volatile unsigned int*)(0x42004024UL))
#define bFM0P_UID_UIDR0_UID6                   *((volatile unsigned int*)(0x42004028UL))
#define bFM0P_UID_UIDR0_UID7                   *((volatile unsigned int*)(0x4200402CUL))
#define bFM0P_UID_UIDR0_UID8                   *((volatile unsigned int*)(0x42004030UL))
#define bFM0P_UID_UIDR0_UID9                   *((volatile unsigned int*)(0x42004034UL))
#define bFM0P_UID_UIDR0_UID10                  *((volatile unsigned int*)(0x42004038UL))
#define bFM0P_UID_UIDR0_UID11                  *((volatile unsigned int*)(0x4200403CUL))
#define bFM0P_UID_UIDR0_UID12                  *((volatile unsigned int*)(0x42004040UL))
#define bFM0P_UID_UIDR0_UID13                  *((volatile unsigned int*)(0x42004044UL))
#define bFM0P_UID_UIDR0_UID14                  *((volatile unsigned int*)(0x42004048UL))
#define bFM0P_UID_UIDR0_UID15                  *((volatile unsigned int*)(0x4200404CUL))
#define bFM0P_UID_UIDR0_UID16                  *((volatile unsigned int*)(0x42004050UL))
#define bFM0P_UID_UIDR0_UID17                  *((volatile unsigned int*)(0x42004054UL))
#define bFM0P_UID_UIDR0_UID18                  *((volatile unsigned int*)(0x42004058UL))
#define bFM0P_UID_UIDR0_UID19                  *((volatile unsigned int*)(0x4200405CUL))
#define bFM0P_UID_UIDR0_UID20                  *((volatile unsigned int*)(0x42004060UL))
#define bFM0P_UID_UIDR0_UID21                  *((volatile unsigned int*)(0x42004064UL))
#define bFM0P_UID_UIDR0_UID22                  *((volatile unsigned int*)(0x42004068UL))
#define bFM0P_UID_UIDR0_UID23                  *((volatile unsigned int*)(0x4200406CUL))
#define bFM0P_UID_UIDR0_UID24                  *((volatile unsigned int*)(0x42004070UL))
#define bFM0P_UID_UIDR0_UID25                  *((volatile unsigned int*)(0x42004074UL))
#define bFM0P_UID_UIDR0_UID26                  *((volatile unsigned int*)(0x42004078UL))
#define bFM0P_UID_UIDR0_UID27                  *((volatile unsigned int*)(0x4200407CUL))
#define bFM0P_UID_UIDR1_UID28                  *((volatile unsigned int*)(0x42004080UL))
#define bFM0P_UID_UIDR1_UID29                  *((volatile unsigned int*)(0x42004084UL))
#define bFM0P_UID_UIDR1_UID30                  *((volatile unsigned int*)(0x42004088UL))
#define bFM0P_UID_UIDR1_UID31                  *((volatile unsigned int*)(0x4200408CUL))
#define bFM0P_UID_UIDR1_UID32                  *((volatile unsigned int*)(0x42004090UL))
#define bFM0P_UID_UIDR1_UID33                  *((volatile unsigned int*)(0x42004094UL))
#define bFM0P_UID_UIDR1_UID34                  *((volatile unsigned int*)(0x42004098UL))
#define bFM0P_UID_UIDR1_UID35                  *((volatile unsigned int*)(0x4200409CUL))
#define bFM0P_UID_UIDR1_UID36                  *((volatile unsigned int*)(0x420040A0UL))
#define bFM0P_UID_UIDR1_UID37                  *((volatile unsigned int*)(0x420040A4UL))
#define bFM0P_UID_UIDR1_UID38                  *((volatile unsigned int*)(0x420040A8UL))
#define bFM0P_UID_UIDR1_UID39                  *((volatile unsigned int*)(0x420040ACUL))
#define bFM0P_UID_UIDR1_UID40                  *((volatile unsigned int*)(0x420040B0UL))

/* Clock and reset registers */
#define bFM0P_CRG_SCM_CTL_HCRE               *((volatile unsigned int*)(0x42200000UL))
#define bFM0P_CRG_SCM_CTL_MOSCE              *((volatile unsigned int*)(0x42200004UL))
#define bFM0P_CRG_SCM_CTL_SOSCE              *((volatile unsigned int*)(0x4220000CUL))
#define bFM0P_CRG_SCM_CTL_PLLE               *((volatile unsigned int*)(0x42200010UL))
#define bFM0P_CRG_SCM_CTL_RCS0               *((volatile unsigned int*)(0x42200014UL))
#define bFM0P_CRG_SCM_CTL_RCS1               *((volatile unsigned int*)(0x42200018UL))
#define bFM0P_CRG_SCM_CTL_RCS2               *((volatile unsigned int*)(0x4220001CUL))
#define bFM0P_CRG_SCM_STR_HCRDY              *((volatile unsigned int*)(0x42200080UL))
#define bFM0P_CRG_SCM_STR_MORDY              *((volatile unsigned int*)(0x42200084UL))
#define bFM0P_CRG_SCM_STR_SORDY              *((volatile unsigned int*)(0x4220008CUL))
#define bFM0P_CRG_SCM_STR_PLRDY              *((volatile unsigned int*)(0x42200090UL))
#define bFM0P_CRG_SCM_STR_RCM0               *((volatile unsigned int*)(0x42200094UL))
#define bFM0P_CRG_SCM_STR_RCM1               *((volatile unsigned int*)(0x42200098UL))
#define bFM0P_CRG_SCM_STR_RCM2               *((volatile unsigned int*)(0x4220009CUL))
#define bFM0P_CRG_STB_CTL_STM0               *((volatile unsigned int*)(0x42200100UL))
#define bFM0P_CRG_STB_CTL_STM1               *((volatile unsigned int*)(0x42200104UL))
#define bFM0P_CRG_STB_CTL_DSTM               *((volatile unsigned int*)(0x42200108UL))
#define bFM0P_CRG_STB_CTL_SPL                *((volatile unsigned int*)(0x42200110UL))
#define bFM0P_CRG_STB_CTL_KEY0               *((volatile unsigned int*)(0x42200140UL))
#define bFM0P_CRG_STB_CTL_KEY1               *((volatile unsigned int*)(0x42200144UL))
#define bFM0P_CRG_STB_CTL_KEY2               *((volatile unsigned int*)(0x42200148UL))
#define bFM0P_CRG_STB_CTL_KEY3               *((volatile unsigned int*)(0x4220014CUL))
#define bFM0P_CRG_STB_CTL_KEY4               *((volatile unsigned int*)(0x42200150UL))
#define bFM0P_CRG_STB_CTL_KEY5               *((volatile unsigned int*)(0x42200154UL))
#define bFM0P_CRG_STB_CTL_KEY6               *((volatile unsigned int*)(0x42200158UL))
#define bFM0P_CRG_STB_CTL_KEY7               *((volatile unsigned int*)(0x4220015CUL))
#define bFM0P_CRG_STB_CTL_KEY8               *((volatile unsigned int*)(0x42200160UL))
#define bFM0P_CRG_STB_CTL_KEY9               *((volatile unsigned int*)(0x42200164UL))
#define bFM0P_CRG_STB_CTL_KEY10              *((volatile unsigned int*)(0x42200168UL))
#define bFM0P_CRG_STB_CTL_KEY11              *((volatile unsigned int*)(0x4220016CUL))
#define bFM0P_CRG_STB_CTL_KEY12              *((volatile unsigned int*)(0x42200170UL))
#define bFM0P_CRG_STB_CTL_KEY13              *((volatile unsigned int*)(0x42200174UL))
#define bFM0P_CRG_STB_CTL_KEY14              *((volatile unsigned int*)(0x42200178UL))
#define bFM0P_CRG_STB_CTL_KEY15              *((volatile unsigned int*)(0x4220017CUL))
#define bFM0P_CRG_RST_STR_PONR               *((volatile unsigned int*)(0x42200180UL))
#define bFM0P_CRG_RST_STR_INITX              *((volatile unsigned int*)(0x42200184UL))
#define bFM0P_CRG_RST_STR_SWDT               *((volatile unsigned int*)(0x42200190UL))
#define bFM0P_CRG_RST_STR_HWDT               *((volatile unsigned int*)(0x42200194UL))
#define bFM0P_CRG_RST_STR_CSVR               *((volatile unsigned int*)(0x42200198UL))
#define bFM0P_CRG_RST_STR_FCSR               *((volatile unsigned int*)(0x4220019CUL))
#define bFM0P_CRG_RST_STR_SRST               *((volatile unsigned int*)(0x422001A0UL))
#define bFM0P_CRG_BSC_PSR_BSR0               *((volatile unsigned int*)(0x42200200UL))
#define bFM0P_CRG_BSC_PSR_BSR1               *((volatile unsigned int*)(0x42200204UL))
#define bFM0P_CRG_BSC_PSR_BSR2               *((volatile unsigned int*)(0x42200208UL))
#define bFM0P_CRG_APBC0_PSR_APBC00           *((volatile unsigned int*)(0x42200280UL))
#define bFM0P_CRG_APBC0_PSR_APBC01           *((volatile unsigned int*)(0x42200284UL))
#define bFM0P_CRG_APBC1_PSR_APBC10           *((volatile unsigned int*)(0x42200300UL))
#define bFM0P_CRG_APBC1_PSR_APBC11           *((volatile unsigned int*)(0x42200304UL))
#define bFM0P_CRG_APBC1_PSR_APBC1RST         *((volatile unsigned int*)(0x42200310UL))
#define bFM0P_CRG_APBC1_PSR_APBC1EN          *((volatile unsigned int*)(0x4220031CUL))
#define bFM0P_CRG_SWC_PSR_SWDS0              *((volatile unsigned int*)(0x42200400UL))
#define bFM0P_CRG_SWC_PSR_SWDS1              *((volatile unsigned int*)(0x42200404UL))
#define bFM0P_CRG_SWC_PSR_TESTB              *((volatile unsigned int*)(0x4220041CUL))
#define bFM0P_CRG_CSW_TMR_MOWT0              *((volatile unsigned int*)(0x42200600UL))
#define bFM0P_CRG_CSW_TMR_MOWT1              *((volatile unsigned int*)(0x42200604UL))
#define bFM0P_CRG_CSW_TMR_MOWT2              *((volatile unsigned int*)(0x42200608UL))
#define bFM0P_CRG_CSW_TMR_MOWT3              *((volatile unsigned int*)(0x4220060CUL))
#define bFM0P_CRG_CSW_TMR_SOWT0              *((volatile unsigned int*)(0x42200610UL))
#define bFM0P_CRG_CSW_TMR_SOWT1              *((volatile unsigned int*)(0x42200614UL))
#define bFM0P_CRG_CSW_TMR_SOWT2              *((volatile unsigned int*)(0x42200618UL))
#define bFM0P_CRG_CSW_TMR_SOWT3              *((volatile unsigned int*)(0x4220061CUL))
#define bFM0P_CRG_PSW_TMR_POWT0              *((volatile unsigned int*)(0x42200680UL))
#define bFM0P_CRG_PSW_TMR_POWT1              *((volatile unsigned int*)(0x42200684UL))
#define bFM0P_CRG_PSW_TMR_POWT2              *((volatile unsigned int*)(0x42200688UL))
#define bFM0P_CRG_PSW_TMR_PINC               *((volatile unsigned int*)(0x42200690UL))
#define bFM0P_CRG_PLL_CTL1_PLLM0             *((volatile unsigned int*)(0x42200700UL))
#define bFM0P_CRG_PLL_CTL1_PLLM1             *((volatile unsigned int*)(0x42200704UL))
#define bFM0P_CRG_PLL_CTL1_PLLM2             *((volatile unsigned int*)(0x42200708UL))
#define bFM0P_CRG_PLL_CTL1_PLLM3             *((volatile unsigned int*)(0x4220070CUL))
#define bFM0P_CRG_PLL_CTL1_PLLK0             *((volatile unsigned int*)(0x42200710UL))
#define bFM0P_CRG_PLL_CTL1_PLLK1             *((volatile unsigned int*)(0x42200714UL))
#define bFM0P_CRG_PLL_CTL1_PLLK2             *((volatile unsigned int*)(0x42200718UL))
#define bFM0P_CRG_PLL_CTL1_PLLK3             *((volatile unsigned int*)(0x4220071CUL))
#define bFM0P_CRG_PLL_CTL2_PLLN0             *((volatile unsigned int*)(0x42200780UL))
#define bFM0P_CRG_PLL_CTL2_PLLN1             *((volatile unsigned int*)(0x42200784UL))
#define bFM0P_CRG_PLL_CTL2_PLLN2             *((volatile unsigned int*)(0x42200788UL))
#define bFM0P_CRG_PLL_CTL2_PLLN3             *((volatile unsigned int*)(0x4220078CUL))
#define bFM0P_CRG_PLL_CTL2_PLLN4             *((volatile unsigned int*)(0x42200790UL))
#define bFM0P_CRG_PLL_CTL2_PLLN5             *((volatile unsigned int*)(0x42200794UL))
#define bFM0P_CRG_CSV_CTL_MCSVE              *((volatile unsigned int*)(0x42200800UL))
#define bFM0P_CRG_CSV_CTL_SCSVE              *((volatile unsigned int*)(0x42200804UL))
#define bFM0P_CRG_CSV_CTL_FCSDE              *((volatile unsigned int*)(0x42200820UL))
#define bFM0P_CRG_CSV_CTL_FCSRE              *((volatile unsigned int*)(0x42200824UL))
#define bFM0P_CRG_CSV_CTL_FCD0               *((volatile unsigned int*)(0x42200830UL))
#define bFM0P_CRG_CSV_CTL_FCD1               *((volatile unsigned int*)(0x42200834UL))
#define bFM0P_CRG_CSV_CTL_FCD2               *((volatile unsigned int*)(0x42200838UL))
#define bFM0P_CRG_CSV_STR_MCMF               *((volatile unsigned int*)(0x42200880UL))
#define bFM0P_CRG_CSV_STR_SCMF               *((volatile unsigned int*)(0x42200884UL))
#define bFM0P_CRG_DBWDT_CTL_DPSWBE           *((volatile unsigned int*)(0x42200A94UL))
#define bFM0P_CRG_DBWDT_CTL_DPHWBE           *((volatile unsigned int*)(0x42200A9CUL))
#define bFM0P_CRG_INT_ENR_MCSE               *((volatile unsigned int*)(0x42200C00UL))
#define bFM0P_CRG_INT_ENR_SCSE               *((volatile unsigned int*)(0x42200C04UL))
#define bFM0P_CRG_INT_ENR_PCSE               *((volatile unsigned int*)(0x42200C08UL))
#define bFM0P_CRG_INT_ENR_FCSE               *((volatile unsigned int*)(0x42200C14UL))
#define bFM0P_CRG_INT_STR_MCSI               *((volatile unsigned int*)(0x42200C80UL))
#define bFM0P_CRG_INT_STR_SCSI               *((volatile unsigned int*)(0x42200C84UL))
#define bFM0P_CRG_INT_STR_PCSI               *((volatile unsigned int*)(0x42200C88UL))
#define bFM0P_CRG_INT_STR_FCSI               *((volatile unsigned int*)(0x42200C94UL))
#define bFM0P_CRG_INT_CLR_MCSC               *((volatile unsigned int*)(0x42200D00UL))
#define bFM0P_CRG_INT_CLR_SCSC               *((volatile unsigned int*)(0x42200D04UL))
#define bFM0P_CRG_INT_CLR_PCSC               *((volatile unsigned int*)(0x42200D08UL))
#define bFM0P_CRG_INT_CLR_FCSC               *((volatile unsigned int*)(0x42200D14UL))

/* Hardware watchdog registers */
#define bFM0P_HWWDT_WDG_CTL_INTEN              *((volatile unsigned int*)(0x42220100UL))
#define bFM0P_HWWDT_WDG_CTL_RESEN              *((volatile unsigned int*)(0x42220104UL))
#define bFM0P_HWWDT_WDG_RIS_RIS                *((volatile unsigned int*)(0x42220200UL))

/* Software watchdog registers */
#define bFM0P_SWWDT_WDOGCONTROL_INTEN          *((volatile unsigned int*)(0x42240100UL))
#define bFM0P_SWWDT_WDOGCONTROL_RESEN          *((volatile unsigned int*)(0x42240104UL))
#define bFM0P_SWWDT_WDOGCONTROL_TWD0           *((volatile unsigned int*)(0x42240108UL))
#define bFM0P_SWWDT_WDOGCONTROL_TWD1           *((volatile unsigned int*)(0x4224010CUL))
#define bFM0P_SWWDT_WDOGCONTROL_SPM            *((volatile unsigned int*)(0x42240110UL))
#define bFM0P_SWWDT_WDOGRIS_RIS                *((volatile unsigned int*)(0x42240200UL))
#define bFM0P_SWWDT_WDOGSPMC_TGR               *((volatile unsigned int*)(0x42240300UL))

