furjie/Single-BLDC-driver-and-app/s6e1a1.h
/* Dual timer 1/2 registers */
#define bFM0P_DTIM_TIMER1CONTROL_ONESHOT       *((volatile unsigned int*)(0x422A0100UL))
#define bFM0P_DTIM_TIMER1CONTROL_TIMERSIZE     *((volatile unsigned int*)(0x422A0104UL))
#define bFM0P_DTIM_TIMER1CONTROL_TIMERPRE0     *((volatile unsigned int*)(0x422A0108UL))
#define bFM0P_DTIM_TIMER1CONTROL_TIMERPRE1     *((volatile unsigned int*)(0x422A010CUL))
#define bFM0P_DTIM_TIMER1CONTROL_INTENABLE     *((volatile unsigned int*)(0x422A0114UL))
#define bFM0P_DTIM_TIMER1CONTROL_TIMERMODE     *((volatile unsigned int*)(0x422A0118UL))
#define bFM0P_DTIM_TIMER1CONTROL_TIMEREN       *((volatile unsigned int*)(0x422A011CUL))
#define bFM0P_DTIM_TIMER1RIS_TIMER1RIS         *((volatile unsigned int*)(0x422A0200UL))
#define bFM0P_DTIM_TIMER1MIS_TIMER1MIS         *((volatile unsigned int*)(0x422A0280UL))
#define bFM0P_DTIM_TIMER2CONTROL_ONESHOT       *((volatile unsigned int*)(0x422A0500UL))
#define bFM0P_DTIM_TIMER2CONTROL_TIMERSIZE     *((volatile unsigned int*)(0x422A0504UL))
#define bFM0P_DTIM_TIMER2CONTROL_TIMERPRE0     *((volatile unsigned int*)(0x422A0508UL))
#define bFM0P_DTIM_TIMER2CONTROL_TIMERPRE1     *((volatile unsigned int*)(0x422A050CUL))
#define bFM0P_DTIM_TIMER2CONTROL_INTENABLE     *((volatile unsigned int*)(0x422A0514UL))
#define bFM0P_DTIM_TIMER2CONTROL_TIMERMODE     *((volatile unsigned int*)(0x422A0518UL))
#define bFM0P_DTIM_TIMER2CONTROL_TIMEREN       *((volatile unsigned int*)(0x422A051CUL))
#define bFM0P_DTIM_TIMER2RIS_TIMER1RIS         *((volatile unsigned int*)(0x422A0600UL))
#define bFM0P_DTIM_TIMER2MIS_TIMER1MIS         *((volatile unsigned int*)(0x422A0680UL))

/* Multifunction Timer unit 0 Free Running Timer registers */
#define bFM0P_MFT0_FRT_TCDT0_FRT_TCCP016       *((volatile unsigned int*)(0x424008C0UL))
#define bFM0P_MFT0_FRT_TCDT0_FRT_TCCP017       *((volatile unsigned int*)(0x424008C4UL))
#define bFM0P_MFT0_FRT_TCDT0_FRT_TCCP018       *((volatile unsigned int*)(0x424008C8UL))
#define bFM0P_MFT0_FRT_TCDT0_FRT_TCCP019       *((volatile unsigned int*)(0x424008CCUL))
#define bFM0P_MFT0_FRT_TCDT0_FRT_TCCP020       *((volatile unsigned int*)(0x424008D0UL))
#define bFM0P_MFT0_FRT_TCDT0_FRT_TCCP021       *((volatile unsigned int*)(0x424008D4UL))
#define bFM0P_MFT0_FRT_TCDT0_FRT_TCCP022       *((volatile unsigned int*)(0x424008D8UL))
#define bFM0P_MFT0_FRT_TCDT0_FRT_TCCP023       *((volatile unsigned int*)(0x424008DCUL))
#define bFM0P_MFT0_FRT_TCDT0_FRT_TCCP024       *((volatile unsigned int*)(0x424008E0UL))
#define bFM0P_MFT0_FRT_TCDT0_FRT_TCCP025       *((volatile unsigned int*)(0x424008E4UL))
#define bFM0P_MFT0_FRT_TCDT0_FRT_TCCP026       *((volatile unsigned int*)(0x424008E8UL))
#define bFM0P_MFT0_FRT_TCSA0_CLK0              *((volatile unsigned int*)(0x42400900UL))
#define bFM0P_MFT0_FRT_TCSA0_CLK1              *((volatile unsigned int*)(0x42400904UL))
#define bFM0P_MFT0_FRT_TCSA0_CLK2              *((volatile unsigned int*)(0x42400908UL))
#define bFM0P_MFT0_FRT_TCSA0_CLK3              *((volatile unsigned int*)(0x4240090CUL))
#define bFM0P_MFT0_FRT_TCSA0_SCLR              *((volatile unsigned int*)(0x42400910UL))
#define bFM0P_MFT0_FRT_TCSA0_MODE              *((volatile unsigned int*)(0x42400914UL))
#define bFM0P_MFT0_FRT_TCSA0_STOP              *((volatile unsigned int*)(0x42400918UL))
#define bFM0P_MFT0_FRT_TCSA0_BFE               *((volatile unsigned int*)(0x4240091CUL))
#define bFM0P_MFT0_FRT_TCSA0_ICRE              *((volatile unsigned int*)(0x42400920UL))
#define bFM0P_MFT0_FRT_TCSA0_ICLR              *((volatile unsigned int*)(0x42400924UL))
#define bFM0P_MFT0_FRT_TCSA0_IRQZE             *((volatile unsigned int*)(0x42400934UL))
#define bFM0P_MFT0_FRT_TCSA0_IRQZF             *((volatile unsigned int*)(0x42400938UL))
#define bFM0P_MFT0_FRT_TCSA0_ECKE              *((volatile unsigned int*)(0x4240093CUL))
#define bFM0P_MFT0_FRT_TCSC0_MSZI0             *((volatile unsigned int*)(0x42400940UL))
#define bFM0P_MFT0_FRT_TCSC0_MSZI1             *((volatile unsigned int*)(0x42400944UL))
#define bFM0P_MFT0_FRT_TCSC0_MSZI2             *((volatile unsigned int*)(0x42400948UL))
#define bFM0P_MFT0_FRT_TCSC0_MSZI3             *((volatile unsigned int*)(0x4240094CUL))
#define bFM0P_MFT0_FRT_TCSC0_MSPI0             *((volatile unsigned int*)(0x42400950UL))
#define bFM0P_MFT0_FRT_TCSC0_MSPI1             *((volatile unsigned int*)(0x42400954UL))
#define bFM0P_MFT0_FRT_TCSC0_MSPI2             *((volatile unsigned int*)(0x42400958UL))
#define bFM0P_MFT0_FRT_TCSC0_MSPI3             *((volatile unsigned int*)(0x4240095CUL))
#define bFM0P_MFT0_FRT_TCSC0_MSZC0             *((volatile unsigned int*)(0x42400960UL))
#define bFM0P_MFT0_FRT_TCSC0_MSZC1             *((volatile unsigned int*)(0x42400964UL))
#define bFM0P_MFT0_FRT_TCSC0_MSZC2             *((volatile unsigned int*)(0x42400968UL))
#define bFM0P_MFT0_FRT_TCSC0_MSZC3             *((volatile unsigned int*)(0x4240096CUL))
#define bFM0P_MFT0_FRT_TCSC0_MSPC0             *((volatile unsigned int*)(0x42400970UL))
#define bFM0P_MFT0_FRT_TCSC0_MSPC1             *((volatile unsigned int*)(0x42400974UL))
#define bFM0P_MFT0_FRT_TCSC0_MSPC2             *((volatile unsigned int*)(0x42400978UL))
#define bFM0P_MFT0_FRT_TCSC0_MSPC3             *((volatile unsigned int*)(0x4240097CUL))
#define bFM0P_MFT0_FRT_TCDT1_FRT_TCCP016       *((volatile unsigned int*)(0x42400A40UL))
#define bFM0P_MFT0_FRT_TCDT1_FRT_TCCP017       *((volatile unsigned int*)(0x42400A44UL))
#define bFM0P_MFT0_FRT_TCDT1_FRT_TCCP018       *((volatile unsigned int*)(0x42400A48UL))
#define bFM0P_MFT0_FRT_TCDT1_FRT_TCCP019       *((volatile unsigned int*)(0x42400A4CUL))
#define bFM0P_MFT0_FRT_TCDT1_FRT_TCCP020       *((volatile unsigned int*)(0x42400A50UL))
#define bFM0P_MFT0_FRT_TCDT1_FRT_TCCP021       *((volatile unsigned int*)(0x42400A54UL))
#define bFM0P_MFT0_FRT_TCDT1_FRT_TCCP022       *((volatile unsigned int*)(0x42400A58UL))
#define bFM0P_MFT0_FRT_TCDT1_FRT_TCCP023       *((volatile unsigned int*)(0x42400A5CUL))
#define bFM0P_MFT0_FRT_TCDT1_FRT_TCCP024       *((volatile unsigned int*)(0x42400A60UL))
#define bFM0P_MFT0_FRT_TCDT1_FRT_TCCP025       *((volatile unsigned int*)(0x42400A64UL))
#define bFM0P_MFT0_FRT_TCDT1_FRT_TCCP026       *((volatile unsigned int*)(0x42400A68UL))
#define bFM0P_MFT0_FRT_TCSA1_CLK0              *((volatile unsigned int*)(0x42400A80UL))
#define bFM0P_MFT0_FRT_TCSA1_CLK1              *((volatile unsigned int*)(0x42400A84UL))
#define bFM0P_MFT0_FRT_TCSA1_CLK2              *((volatile unsigned int*)(0x42400A88UL))
#define bFM0P_MFT0_FRT_TCSA1_CLK3              *((volatile unsigned int*)(0x42400A8CUL))
#define bFM0P_MFT0_FRT_TCSA1_SCLR              *((volatile unsigned int*)(0x42400A90UL))
#define bFM0P_MFT0_FRT_TCSA1_MODE              *((volatile unsigned int*)(0x42400A94UL))
#define bFM0P_MFT0_FRT_TCSA1_STOP              *((volatile unsigned int*)(0x42400A98UL))
#define bFM0P_MFT0_FRT_TCSA1_BFE               *((volatile unsigned int*)(0x42400A9CUL))
#define bFM0P_MFT0_FRT_TCSA1_ICRE              *((volatile unsigned int*)(0x42400AA0UL))
#define bFM0P_MFT0_FRT_TCSA1_ICLR              *((volatile unsigned int*)(0x42400AA4UL))
#define bFM0P_MFT0_FRT_TCSA1_IRQZE             *((volatile unsigned int*)(0x42400AB4UL))
#define bFM0P_MFT0_FRT_TCSA1_IRQZF             *((volatile unsigned int*)(0x42400AB8UL))
#define bFM0P_MFT0_FRT_TCSA1_ECKE              *((volatile unsigned int*)(0x42400ABCUL))
#define bFM0P_MFT0_FRT_TCSC1_MSZI0             *((volatile unsigned int*)(0x42400AC0UL))
#define bFM0P_MFT0_FRT_TCSC1_MSZI1             *((volatile unsigned int*)(0x42400AC4UL))
#define bFM0P_MFT0_FRT_TCSC1_MSZI2             *((volatile unsigned int*)(0x42400AC8UL))
#define bFM0P_MFT0_FRT_TCSC1_MSZI3             *((volatile unsigned int*)(0x42400ACCUL))
#define bFM0P_MFT0_FRT_TCSC1_MSPI0             *((volatile unsigned int*)(0x42400AD0UL))
#define bFM0P_MFT0_FRT_TCSC1_MSPI1             *((volatile unsigned int*)(0x42400AD4UL))
#define bFM0P_MFT0_FRT_TCSC1_MSPI2             *((volatile unsigned int*)(0x42400AD8UL))
#define bFM0P_MFT0_FRT_TCSC1_MSPI3             *((volatile unsigned int*)(0x42400ADCUL))
#define bFM0P_MFT0_FRT_TCSC1_MSZC0             *((volatile unsigned int*)(0x42400AE0UL))
#define bFM0P_MFT0_FRT_TCSC1_MSZC1             *((volatile unsigned int*)(0x42400AE4UL))
#define bFM0P_MFT0_FRT_TCSC1_MSZC2             *((volatile unsigned int*)(0x42400AE8UL))
#define bFM0P_MFT0_FRT_TCSC1_MSZC3             *((volatile unsigned int*)(0x42400AECUL))
#define bFM0P_MFT0_FRT_TCSC1_MSPC0             *((volatile unsigned int*)(0x42400AF0UL))
#define bFM0P_MFT0_FRT_TCSC1_MSPC1             *((volatile unsigned int*)(0x42400AF4UL))
#define bFM0P_MFT0_FRT_TCSC1_MSPC2             *((volatile unsigned int*)(0x42400AF8UL))
#define bFM0P_MFT0_FRT_TCSC1_MSPC3             *((volatile unsigned int*)(0x42400AFCUL))
#define bFM0P_MFT0_FRT_TCDT2_FRT_TCCP016       *((volatile unsigned int*)(0x42400BC0UL))
#define bFM0P_MFT0_FRT_TCDT2_FRT_TCCP017       *((volatile unsigned int*)(0x42400BC4UL))
#define bFM0P_MFT0_FRT_TCDT2_FRT_TCCP018       *((volatile unsigned int*)(0x42400BC8UL))
#define bFM0P_MFT0_FRT_TCDT2_FRT_TCCP019       *((volatile unsigned int*)(0x42400BCCUL))
#define bFM0P_MFT0_FRT_TCDT2_FRT_TCCP020       *((volatile unsigned int*)(0x42400BD0UL))
#define bFM0P_MFT0_FRT_TCDT2_FRT_TCCP021       *((volatile unsigned int*)(0x42400BD4UL))
#define bFM0P_MFT0_FRT_TCDT2_FRT_TCCP022       *((volatile unsigned int*)(0x42400BD8UL))
#define bFM0P_MFT0_FRT_TCDT2_FRT_TCCP023       *((volatile unsigned int*)(0x42400BDCUL))
#define bFM0P_MFT0_FRT_TCDT2_FRT_TCCP024       *((volatile unsigned int*)(0x42400BE0UL))
#define bFM0P_MFT0_FRT_TCDT2_FRT_TCCP025       *((volatile unsigned int*)(0x42400BE4UL))
#define bFM0P_MFT0_FRT_TCDT2_FRT_TCCP026       *((volatile unsigned int*)(0x42400BE8UL))
#define bFM0P_MFT0_FRT_TCSA2_CLK0              *((volatile unsigned int*)(0x42400C00UL))
#define bFM0P_MFT0_FRT_TCSA2_CLK1              *((volatile unsigned int*)(0x42400C04UL))
#define bFM0P_MFT0_FRT_TCSA2_CLK2              *((volatile unsigned int*)(0x42400C08UL))
#define bFM0P_MFT0_FRT_TCSA2_CLK3              *((volatile unsigned int*)(0x42400C0CUL))
#define bFM0P_MFT0_FRT_TCSA2_SCLR              *((volatile unsigned int*)(0x42400C10UL))
#define bFM0P_MFT0_FRT_TCSA2_MODE              *((volatile unsigned int*)(0x42400C14UL))
#define bFM0P_MFT0_FRT_TCSA2_STOP              *((volatile unsigned int*)(0x42400C18UL))
#define bFM0P_MFT0_FRT_TCSA2_BFE               *((volatile unsigned int*)(0x42400C1CUL))
#define bFM0P_MFT0_FRT_TCSA2_ICRE              *((volatile unsigned int*)(0x42400C20UL))
#define bFM0P_MFT0_FRT_TCSA2_ICLR              *((volatile unsigned int*)(0x42400C24UL))
#define bFM0P_MFT0_FRT_TCSA2_IRQZE             *((volatile unsigned int*)(0x42400C34UL))
#define bFM0P_MFT0_FRT_TCSA2_IRQZF             *((volatile unsigned int*)(0x42400C38UL))
#define bFM0P_MFT0_FRT_TCSA2_ECKE              *((volatile unsigned int*)(0x42400C3CUL))
#define bFM0P_MFT0_FRT_TCSC2_MSZI0             *((volatile unsigned int*)(0x42400C40UL))
#define bFM0P_MFT0_FRT_TCSC2_MSZI1             *((volatile unsigned int*)(0x42400C44UL))
#define bFM0P_MFT0_FRT_TCSC2_MSZI2             *((volatile unsigned int*)(0x42400C48UL))
#define bFM0P_MFT0_FRT_TCSC2_MSZI3             *((volatile unsigned int*)(0x42400C4CUL))
#define bFM0P_MFT0_FRT_TCSC2_MSPI0             *((volatile unsigned int*)(0x42400C50UL))
#define bFM0P_MFT0_FRT_TCSC2_MSPI1             *((volatile unsigned int*)(0x42400C54UL))
#define bFM0P_MFT0_FRT_TCSC2_MSPI2             *((volatile unsigned int*)(0x42400C58UL))
#define bFM0P_MFT0_FRT_TCSC2_MSPI3             *((volatile unsigned int*)(0x42400C5CUL))
#define bFM0P_MFT0_FRT_TCSC2_MSZC0             *((volatile unsigned int*)(0x42400C60UL))
#define bFM0P_MFT0_FRT_TCSC2_MSZC1             *((volatile unsigned int*)(0x42400C64UL))
#define bFM0P_MFT0_FRT_TCSC2_MSZC2             *((volatile unsigned int*)(0x42400C68UL))
#define bFM0P_MFT0_FRT_TCSC2_MSZC3             *((volatile unsigned int*)(0x42400C6CUL))
#define bFM0P_MFT0_FRT_TCSC2_MSPC0             *((volatile unsigned int*)(0x42400C70UL))
#define bFM0P_MFT0_FRT_TCSC2_MSPC1             *((volatile unsigned int*)(0x42400C74UL))
#define bFM0P_MFT0_FRT_TCSC2_MSPC2             *((volatile unsigned int*)(0x42400C78UL))
#define bFM0P_MFT0_FRT_TCSC2_MSPC3             *((volatile unsigned int*)(0x42400C7CUL))
#define bFM0P_MFT0_FRT_TCAL_STOP00             *((volatile unsigned int*)(0x42400C80UL))
#define bFM0P_MFT0_FRT_TCAL_STOP01             *((volatile unsigned int*)(0x42400C84UL))
#define bFM0P_MFT0_FRT_TCAL_STOP02             *((volatile unsigned int*)(0x42400C88UL))
#define bFM0P_MFT0_FRT_TCAL_STOP10             *((volatile unsigned int*)(0x42400C8CUL))
#define bFM0P_MFT0_FRT_TCAL_STOP11             *((volatile unsigned int*)(0x42400C90UL))
#define bFM0P_MFT0_FRT_TCAL_STOP12             *((volatile unsigned int*)(0x42400C94UL))
#define bFM0P_MFT0_FRT_TCAL_STOP20             *((volatile unsigned int*)(0x42400C98UL))
#define bFM0P_MFT0_FRT_TCAL_STOP21             *((volatile unsigned int*)(0x42400C9CUL))
#define bFM0P_MFT0_FRT_TCAL_STOP22             *((volatile unsigned int*)(0x42400CA0UL))
#define bFM0P_MFT0_FRT_TCAL_SCLR00             *((volatile unsigned int*)(0x42400CC0UL))
#define bFM0P_MFT0_FRT_TCAL_SCLR01             *((volatile unsigned int*)(0x42400CC4UL))
#define bFM0P_MFT0_FRT_TCAL_SCLR02             *((volatile unsigned int*)(0x42400CC8UL))
#define bFM0P_MFT0_FRT_TCAL_SCLR10             *((volatile unsigned int*)(0x42400CCCUL))
#define bFM0P_MFT0_FRT_TCAL_SCLR11             *((volatile unsigned int*)(0x42400CD0UL))
#define bFM0P_MFT0_FRT_TCAL_SCLR12             *((volatile unsigned int*)(0x42400CD4UL))
#define bFM0P_MFT0_FRT_TCAL_SCLR20             *((volatile unsigned int*)(0x42400CD8UL))
#define bFM0P_MFT0_FRT_TCAL_SCLR21             *((volatile unsigned int*)(0x42400CDCUL))
#define bFM0P_MFT0_FRT_TCAL_SCLR22             *((volatile unsigned int*)(0x42400CE0UL))

