furjie/Single-BLDC-driver-and-app/s6e1a1.h
/* Multifunction Timer unit 0 Output Compare Unit registers */
#define bFM0P_MFT0_OCU_OCSA10_CST0             *((volatile unsigned int*)(0x42400300UL))
#define bFM0P_MFT0_OCU_OCSA10_CST1             *((volatile unsigned int*)(0x42400304UL))
#define bFM0P_MFT0_OCU_OCSA10_IOE0             *((volatile unsigned int*)(0x42400310UL))
#define bFM0P_MFT0_OCU_OCSA10_IOE1             *((volatile unsigned int*)(0x42400314UL))
#define bFM0P_MFT0_OCU_OCSA10_IOP0             *((volatile unsigned int*)(0x42400318UL))
#define bFM0P_MFT0_OCU_OCSA10_IOP1             *((volatile unsigned int*)(0x4240031CUL))
#define bFM0P_MFT0_OCU_OCSB10_OTD0             *((volatile unsigned int*)(0x42400320UL))
#define bFM0P_MFT0_OCU_OCSB10_OTD1             *((volatile unsigned int*)(0x42400324UL))
#define bFM0P_MFT0_OCU_OCSB10_CMOD             *((volatile unsigned int*)(0x42400330UL))
#define bFM0P_MFT0_OCU_OCSB10_FM4              *((volatile unsigned int*)(0x4240033CUL))
#define bFM0P_MFT0_OCU_OCSD10_OCCP0BUFE0       *((volatile unsigned int*)(0x42400340UL))
#define bFM0P_MFT0_OCU_OCSD10_OCCP0BUFE1       *((volatile unsigned int*)(0x42400344UL))
#define bFM0P_MFT0_OCU_OCSD10_OCCP1BUFE0       *((volatile unsigned int*)(0x42400348UL))
#define bFM0P_MFT0_OCU_OCSD10_OCCP1BUFE1       *((volatile unsigned int*)(0x4240034CUL))
#define bFM0P_MFT0_OCU_OCSD10_OCSE0BUFE0       *((volatile unsigned int*)(0x42400350UL))
#define bFM0P_MFT0_OCU_OCSD10_OCSE0BUFE1       *((volatile unsigned int*)(0x42400354UL))
#define bFM0P_MFT0_OCU_OCSD10_OCSE1BUFE0       *((volatile unsigned int*)(0x42400358UL))
#define bFM0P_MFT0_OCU_OCSD10_OCSE1BUFE1       *((volatile unsigned int*)(0x4240035CUL))
#define bFM0P_MFT0_OCU_OCSA32_CST0             *((volatile unsigned int*)(0x42400380UL))
#define bFM0P_MFT0_OCU_OCSA32_CST1             *((volatile unsigned int*)(0x42400384UL))
#define bFM0P_MFT0_OCU_OCSA32_IOE0             *((volatile unsigned int*)(0x42400390UL))
#define bFM0P_MFT0_OCU_OCSA32_IOE1             *((volatile unsigned int*)(0x42400394UL))
#define bFM0P_MFT0_OCU_OCSA32_IOP0             *((volatile unsigned int*)(0x42400398UL))
#define bFM0P_MFT0_OCU_OCSA32_IOP1             *((volatile unsigned int*)(0x4240039CUL))
#define bFM0P_MFT0_OCU_OCSB32_OTD0             *((volatile unsigned int*)(0x424003A0UL))
#define bFM0P_MFT0_OCU_OCSB32_OTD1             *((volatile unsigned int*)(0x424003A4UL))
#define bFM0P_MFT0_OCU_OCSB32_CMOD             *((volatile unsigned int*)(0x424003B0UL))
#define bFM0P_MFT0_OCU_OCSB32_FM4              *((volatile unsigned int*)(0x424003BCUL))
#define bFM0P_MFT0_OCU_OCSD32_OCCP0BUFE0       *((volatile unsigned int*)(0x424003C0UL))
#define bFM0P_MFT0_OCU_OCSD32_OCCP0BUFE1       *((volatile unsigned int*)(0x424003C4UL))
#define bFM0P_MFT0_OCU_OCSD32_OCCP1BUFE0       *((volatile unsigned int*)(0x424003C8UL))
#define bFM0P_MFT0_OCU_OCSD32_OCCP1BUFE1       *((volatile unsigned int*)(0x424003CCUL))
#define bFM0P_MFT0_OCU_OCSD32_OCSE0BUFE0       *((volatile unsigned int*)(0x424003D0UL))
#define bFM0P_MFT0_OCU_OCSD32_OCSE0BUFE1       *((volatile unsigned int*)(0x424003D4UL))
#define bFM0P_MFT0_OCU_OCSD32_OCSE1BUFE0       *((volatile unsigned int*)(0x424003D8UL))
#define bFM0P_MFT0_OCU_OCSD32_OCSE1BUFE1       *((volatile unsigned int*)(0x424003DCUL))
#define bFM0P_MFT0_OCU_OCSA54_CST0             *((volatile unsigned int*)(0x42400400UL))
#define bFM0P_MFT0_OCU_OCSA54_CST1             *((volatile unsigned int*)(0x42400404UL))
#define bFM0P_MFT0_OCU_OCSA54_IOE0             *((volatile unsigned int*)(0x42400410UL))
#define bFM0P_MFT0_OCU_OCSA54_IOE1             *((volatile unsigned int*)(0x42400414UL))
#define bFM0P_MFT0_OCU_OCSA54_IOP0             *((volatile unsigned int*)(0x42400418UL))
#define bFM0P_MFT0_OCU_OCSA54_IOP1             *((volatile unsigned int*)(0x4240041CUL))
#define bFM0P_MFT0_OCU_OCSB54_OTD0             *((volatile unsigned int*)(0x42400420UL))
#define bFM0P_MFT0_OCU_OCSB54_OTD1             *((volatile unsigned int*)(0x42400424UL))
#define bFM0P_MFT0_OCU_OCSB54_CMOD             *((volatile unsigned int*)(0x42400430UL))
#define bFM0P_MFT0_OCU_OCSB54_FM4              *((volatile unsigned int*)(0x4240043CUL))
#define bFM0P_MFT0_OCU_OCSD54_OCCP0BUFE0       *((volatile unsigned int*)(0x42400440UL))
#define bFM0P_MFT0_OCU_OCSD54_OCCP0BUFE1       *((volatile unsigned int*)(0x42400444UL))
#define bFM0P_MFT0_OCU_OCSD54_OCCP1BUFE0       *((volatile unsigned int*)(0x42400448UL))
#define bFM0P_MFT0_OCU_OCSD54_OCCP1BUFE1       *((volatile unsigned int*)(0x4240044CUL))
#define bFM0P_MFT0_OCU_OCSD54_OCSE0BUFE0       *((volatile unsigned int*)(0x42400450UL))
#define bFM0P_MFT0_OCU_OCSD54_OCSE0BUFE1       *((volatile unsigned int*)(0x42400454UL))
#define bFM0P_MFT0_OCU_OCSD54_OCSE1BUFE0       *((volatile unsigned int*)(0x42400458UL))
#define bFM0P_MFT0_OCU_OCSD54_OCSE1BUFE1       *((volatile unsigned int*)(0x4240045CUL))
#define bFM0P_MFT0_OCU_OCSC_MOD0               *((volatile unsigned int*)(0x424004A0UL))
#define bFM0P_MFT0_OCU_OCSC_MOD1               *((volatile unsigned int*)(0x424004A4UL))
#define bFM0P_MFT0_OCU_OCSC_MOD2               *((volatile unsigned int*)(0x424004A8UL))
#define bFM0P_MFT0_OCU_OCSC_MOD3               *((volatile unsigned int*)(0x424004ACUL))
#define bFM0P_MFT0_OCU_OCSC_MOD4               *((volatile unsigned int*)(0x424004B0UL))
#define bFM0P_MFT0_OCU_OCSC_MOD5               *((volatile unsigned int*)(0x424004B4UL))
#define bFM0P_MFT0_OCU_OCSE0_OCSE0             *((volatile unsigned int*)(0x42400500UL))
#define bFM0P_MFT0_OCU_OCSE0_OCSE1             *((volatile unsigned int*)(0x42400504UL))
#define bFM0P_MFT0_OCU_OCSE0_OCSE2             *((volatile unsigned int*)(0x42400508UL))
#define bFM0P_MFT0_OCU_OCSE0_OCSE3             *((volatile unsigned int*)(0x4240050CUL))
#define bFM0P_MFT0_OCU_OCSE0_OCSE4             *((volatile unsigned int*)(0x42400510UL))
#define bFM0P_MFT0_OCU_OCSE0_OCSE5             *((volatile unsigned int*)(0x42400514UL))
#define bFM0P_MFT0_OCU_OCSE0_OCSE6             *((volatile unsigned int*)(0x42400518UL))
#define bFM0P_MFT0_OCU_OCSE0_OCSE7             *((volatile unsigned int*)(0x4240051CUL))
#define bFM0P_MFT0_OCU_OCSE0_OCSE8             *((volatile unsigned int*)(0x42400520UL))
#define bFM0P_MFT0_OCU_OCSE0_OCSE9             *((volatile unsigned int*)(0x42400524UL))
#define bFM0P_MFT0_OCU_OCSE0_OCSE10            *((volatile unsigned int*)(0x42400528UL))
#define bFM0P_MFT0_OCU_OCSE0_OCSE11            *((volatile unsigned int*)(0x4240052CUL))
#define bFM0P_MFT0_OCU_OCSE0_OCSE12            *((volatile unsigned int*)(0x42400530UL))
#define bFM0P_MFT0_OCU_OCSE0_OCSE13            *((volatile unsigned int*)(0x42400534UL))
#define bFM0P_MFT0_OCU_OCSE0_OCSE14            *((volatile unsigned int*)(0x42400538UL))
#define bFM0P_MFT0_OCU_OCSE0_OCSE15            *((volatile unsigned int*)(0x4240053CUL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE0             *((volatile unsigned int*)(0x42400580UL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE1             *((volatile unsigned int*)(0x42400584UL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE2             *((volatile unsigned int*)(0x42400588UL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE3             *((volatile unsigned int*)(0x4240058CUL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE4             *((volatile unsigned int*)(0x42400590UL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE5             *((volatile unsigned int*)(0x42400594UL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE6             *((volatile unsigned int*)(0x42400598UL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE7             *((volatile unsigned int*)(0x4240059CUL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE8             *((volatile unsigned int*)(0x424005A0UL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE9             *((volatile unsigned int*)(0x424005A4UL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE10            *((volatile unsigned int*)(0x424005A8UL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE11            *((volatile unsigned int*)(0x424005ACUL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE12            *((volatile unsigned int*)(0x424005B0UL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE13            *((volatile unsigned int*)(0x424005B4UL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE14            *((volatile unsigned int*)(0x424005B8UL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE15            *((volatile unsigned int*)(0x424005BCUL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE16            *((volatile unsigned int*)(0x424005C0UL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE17            *((volatile unsigned int*)(0x424005C4UL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE18            *((volatile unsigned int*)(0x424005C8UL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE19            *((volatile unsigned int*)(0x424005CCUL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE20            *((volatile unsigned int*)(0x424005D0UL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE21            *((volatile unsigned int*)(0x424005D4UL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE22            *((volatile unsigned int*)(0x424005D8UL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE23            *((volatile unsigned int*)(0x424005DCUL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE24            *((volatile unsigned int*)(0x424005E0UL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE25            *((volatile unsigned int*)(0x424005E4UL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE26            *((volatile unsigned int*)(0x424005E8UL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE27            *((volatile unsigned int*)(0x424005ECUL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE28            *((volatile unsigned int*)(0x424005F0UL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE29            *((volatile unsigned int*)(0x424005F4UL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE30            *((volatile unsigned int*)(0x424005F8UL))
#define bFM0P_MFT0_OCU_OCSE1_OCSE31            *((volatile unsigned int*)(0x424005FCUL))
#define bFM0P_MFT0_OCU_OCSE2_OCSE0             *((volatile unsigned int*)(0x42400600UL))
#define bFM0P_MFT0_OCU_OCSE2_OCSE1             *((volatile unsigned int*)(0x42400604UL))
#define bFM0P_MFT0_OCU_OCSE2_OCSE2             *((volatile unsigned int*)(0x42400608UL))
#define bFM0P_MFT0_OCU_OCSE2_OCSE3             *((volatile unsigned int*)(0x4240060CUL))
#define bFM0P_MFT0_OCU_OCSE2_OCSE4             *((volatile unsigned int*)(0x42400610UL))
#define bFM0P_MFT0_OCU_OCSE2_OCSE5             *((volatile unsigned int*)(0x42400614UL))
#define bFM0P_MFT0_OCU_OCSE2_OCSE6             *((volatile unsigned int*)(0x42400618UL))
#define bFM0P_MFT0_OCU_OCSE2_OCSE7             *((volatile unsigned int*)(0x4240061CUL))
#define bFM0P_MFT0_OCU_OCSE2_OCSE8             *((volatile unsigned int*)(0x42400620UL))
#define bFM0P_MFT0_OCU_OCSE2_OCSE9             *((volatile unsigned int*)(0x42400624UL))
#define bFM0P_MFT0_OCU_OCSE2_OCSE10            *((volatile unsigned int*)(0x42400628UL))
#define bFM0P_MFT0_OCU_OCSE2_OCSE11            *((volatile unsigned int*)(0x4240062CUL))
#define bFM0P_MFT0_OCU_OCSE2_OCSE12            *((volatile unsigned int*)(0x42400630UL))
#define bFM0P_MFT0_OCU_OCSE2_OCSE13            *((volatile unsigned int*)(0x42400634UL))
#define bFM0P_MFT0_OCU_OCSE2_OCSE14            *((volatile unsigned int*)(0x42400638UL))
#define bFM0P_MFT0_OCU_OCSE2_OCSE15            *((volatile unsigned int*)(0x4240063CUL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE0             *((volatile unsigned int*)(0x42400680UL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE1             *((volatile unsigned int*)(0x42400684UL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE2             *((volatile unsigned int*)(0x42400688UL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE3             *((volatile unsigned int*)(0x4240068CUL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE4             *((volatile unsigned int*)(0x42400690UL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE5             *((volatile unsigned int*)(0x42400694UL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE6             *((volatile unsigned int*)(0x42400698UL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE7             *((volatile unsigned int*)(0x4240069CUL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE8             *((volatile unsigned int*)(0x424006A0UL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE9             *((volatile unsigned int*)(0x424006A4UL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE10            *((volatile unsigned int*)(0x424006A8UL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE11            *((volatile unsigned int*)(0x424006ACUL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE12            *((volatile unsigned int*)(0x424006B0UL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE13            *((volatile unsigned int*)(0x424006B4UL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE14            *((volatile unsigned int*)(0x424006B8UL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE15            *((volatile unsigned int*)(0x424006BCUL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE16            *((volatile unsigned int*)(0x424006C0UL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE17            *((volatile unsigned int*)(0x424006C4UL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE18            *((volatile unsigned int*)(0x424006C8UL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE19            *((volatile unsigned int*)(0x424006CCUL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE20            *((volatile unsigned int*)(0x424006D0UL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE21            *((volatile unsigned int*)(0x424006D4UL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE22            *((volatile unsigned int*)(0x424006D8UL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE23            *((volatile unsigned int*)(0x424006DCUL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE24            *((volatile unsigned int*)(0x424006E0UL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE25            *((volatile unsigned int*)(0x424006E4UL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE26            *((volatile unsigned int*)(0x424006E8UL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE27            *((volatile unsigned int*)(0x424006ECUL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE28            *((volatile unsigned int*)(0x424006F0UL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE29            *((volatile unsigned int*)(0x424006F4UL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE30            *((volatile unsigned int*)(0x424006F8UL))
#define bFM0P_MFT0_OCU_OCSE3_OCSE31            *((volatile unsigned int*)(0x424006FCUL))
#define bFM0P_MFT0_OCU_OCSE4_OCSE0             *((volatile unsigned int*)(0x42400700UL))
#define bFM0P_MFT0_OCU_OCSE4_OCSE1             *((volatile unsigned int*)(0x42400704UL))
#define bFM0P_MFT0_OCU_OCSE4_OCSE2             *((volatile unsigned int*)(0x42400708UL))
#define bFM0P_MFT0_OCU_OCSE4_OCSE3             *((volatile unsigned int*)(0x4240070CUL))
#define bFM0P_MFT0_OCU_OCSE4_OCSE4             *((volatile unsigned int*)(0x42400710UL))
#define bFM0P_MFT0_OCU_OCSE4_OCSE5             *((volatile unsigned int*)(0x42400714UL))
#define bFM0P_MFT0_OCU_OCSE4_OCSE6             *((volatile unsigned int*)(0x42400718UL))
#define bFM0P_MFT0_OCU_OCSE4_OCSE7             *((volatile unsigned int*)(0x4240071CUL))
#define bFM0P_MFT0_OCU_OCSE4_OCSE8             *((volatile unsigned int*)(0x42400720UL))
#define bFM0P_MFT0_OCU_OCSE4_OCSE9             *((volatile unsigned int*)(0x42400724UL))
#define bFM0P_MFT0_OCU_OCSE4_OCSE10            *((volatile unsigned int*)(0x42400728UL))
#define bFM0P_MFT0_OCU_OCSE4_OCSE11            *((volatile unsigned int*)(0x4240072CUL))
#define bFM0P_MFT0_OCU_OCSE4_OCSE12            *((volatile unsigned int*)(0x42400730UL))
#define bFM0P_MFT0_OCU_OCSE4_OCSE13            *((volatile unsigned int*)(0x42400734UL))
#define bFM0P_MFT0_OCU_OCSE4_OCSE14            *((volatile unsigned int*)(0x42400738UL))
#define bFM0P_MFT0_OCU_OCSE4_OCSE15            *((volatile unsigned int*)(0x4240073CUL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE0             *((volatile unsigned int*)(0x42400780UL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE1             *((volatile unsigned int*)(0x42400784UL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE2             *((volatile unsigned int*)(0x42400788UL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE3             *((volatile unsigned int*)(0x4240078CUL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE4             *((volatile unsigned int*)(0x42400790UL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE5             *((volatile unsigned int*)(0x42400794UL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE6             *((volatile unsigned int*)(0x42400798UL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE7             *((volatile unsigned int*)(0x4240079CUL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE8             *((volatile unsigned int*)(0x424007A0UL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE9             *((volatile unsigned int*)(0x424007A4UL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE10            *((volatile unsigned int*)(0x424007A8UL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE11            *((volatile unsigned int*)(0x424007ACUL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE12            *((volatile unsigned int*)(0x424007B0UL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE13            *((volatile unsigned int*)(0x424007B4UL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE14            *((volatile unsigned int*)(0x424007B8UL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE15            *((volatile unsigned int*)(0x424007BCUL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE16            *((volatile unsigned int*)(0x424007C0UL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE17            *((volatile unsigned int*)(0x424007C4UL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE18            *((volatile unsigned int*)(0x424007C8UL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE19            *((volatile unsigned int*)(0x424007CCUL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE20            *((volatile unsigned int*)(0x424007D0UL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE21            *((volatile unsigned int*)(0x424007D4UL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE22            *((volatile unsigned int*)(0x424007D8UL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE23            *((volatile unsigned int*)(0x424007DCUL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE24            *((volatile unsigned int*)(0x424007E0UL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE25            *((volatile unsigned int*)(0x424007E4UL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE26            *((volatile unsigned int*)(0x424007E8UL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE27            *((volatile unsigned int*)(0x424007ECUL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE28            *((volatile unsigned int*)(0x424007F0UL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE29            *((volatile unsigned int*)(0x424007F4UL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE30            *((volatile unsigned int*)(0x424007F8UL))
#define bFM0P_MFT0_OCU_OCSE5_OCSE31            *((volatile unsigned int*)(0x424007FCUL))
#define bFM0P_MFT0_OCU_OCFS10_FSO00            *((volatile unsigned int*)(0x42400D00UL))
#define bFM0P_MFT0_OCU_OCFS10_FSO01            *((volatile unsigned int*)(0x42400D04UL))
#define bFM0P_MFT0_OCU_OCFS10_FSO02            *((volatile unsigned int*)(0x42400D08UL))
#define bFM0P_MFT0_OCU_OCFS10_FSO03            *((volatile unsigned int*)(0x42400D0CUL))
#define bFM0P_MFT0_OCU_OCFS10_FSO10            *((volatile unsigned int*)(0x42400D10UL))
#define bFM0P_MFT0_OCU_OCFS10_FSO11            *((volatile unsigned int*)(0x42400D14UL))
#define bFM0P_MFT0_OCU_OCFS10_FSO12            *((volatile unsigned int*)(0x42400D18UL))
#define bFM0P_MFT0_OCU_OCFS10_FSO13            *((volatile unsigned int*)(0x42400D1CUL))
#define bFM0P_MFT0_OCU_OCFS32_FSO00            *((volatile unsigned int*)(0x42400D20UL))
#define bFM0P_MFT0_OCU_OCFS32_FSO01            *((volatile unsigned int*)(0x42400D24UL))
#define bFM0P_MFT0_OCU_OCFS32_FSO02            *((volatile unsigned int*)(0x42400D28UL))
#define bFM0P_MFT0_OCU_OCFS32_FSO03            *((volatile unsigned int*)(0x42400D2CUL))
#define bFM0P_MFT0_OCU_OCFS32_FSO10            *((volatile unsigned int*)(0x42400D30UL))
#define bFM0P_MFT0_OCU_OCFS32_FSO11            *((volatile unsigned int*)(0x42400D34UL))
#define bFM0P_MFT0_OCU_OCFS32_FSO12            *((volatile unsigned int*)(0x42400D38UL))
#define bFM0P_MFT0_OCU_OCFS32_FSO13            *((volatile unsigned int*)(0x42400D3CUL))
#define bFM0P_MFT0_OCU_OCFS54_FSO00            *((volatile unsigned int*)(0x42400D40UL))
#define bFM0P_MFT0_OCU_OCFS54_FSO01            *((volatile unsigned int*)(0x42400D44UL))
#define bFM0P_MFT0_OCU_OCFS54_FSO02            *((volatile unsigned int*)(0x42400D48UL))
#define bFM0P_MFT0_OCU_OCFS54_FSO03            *((volatile unsigned int*)(0x42400D4CUL))
#define bFM0P_MFT0_OCU_OCFS54_FSO10            *((volatile unsigned int*)(0x42400D50UL))
#define bFM0P_MFT0_OCU_OCFS54_FSO11            *((volatile unsigned int*)(0x42400D54UL))
#define bFM0P_MFT0_OCU_OCFS54_FSO12            *((volatile unsigned int*)(0x42400D58UL))
#define bFM0P_MFT0_OCU_OCFS54_FSO13            *((volatile unsigned int*)(0x42400D5CUL))

