furjie/Single-BLDC-driver-and-app/s6e1a1.h
/* Multifunction Timer unit 0 Waveform Generator and Noise Canceler registers */
#define bFM0P_MFT0_WFG_WFSA10_DCK0             *((volatile unsigned int*)(0x42401480UL))
#define bFM0P_MFT0_WFG_WFSA10_DCK1             *((volatile unsigned int*)(0x42401484UL))
#define bFM0P_MFT0_WFG_WFSA10_DCK2             *((volatile unsigned int*)(0x42401488UL))
#define bFM0P_MFT0_WFG_WFSA10_TMD0             *((volatile unsigned int*)(0x4240148CUL))
#define bFM0P_MFT0_WFG_WFSA10_TMD1             *((volatile unsigned int*)(0x42401490UL))
#define bFM0P_MFT0_WFG_WFSA10_TMD2             *((volatile unsigned int*)(0x42401494UL))
#define bFM0P_MFT0_WFG_WFSA10_GTEN0            *((volatile unsigned int*)(0x42401498UL))
#define bFM0P_MFT0_WFG_WFSA10_GTEN1            *((volatile unsigned int*)(0x4240149CUL))
#define bFM0P_MFT0_WFG_WFSA10_PSEL0            *((volatile unsigned int*)(0x424014A0UL))
#define bFM0P_MFT0_WFG_WFSA10_PSEL1            *((volatile unsigned int*)(0x424014A4UL))
#define bFM0P_MFT0_WFG_WFSA10_PGEN0            *((volatile unsigned int*)(0x424014A8UL))
#define bFM0P_MFT0_WFG_WFSA10_PGEN1            *((volatile unsigned int*)(0x424014ACUL))
#define bFM0P_MFT0_WFG_WFSA10_DMOD0            *((volatile unsigned int*)(0x424014B0UL))
#define bFM0P_MFT0_WFG_WFSA10_DMOD1            *((volatile unsigned int*)(0x424014B4UL))
#define bFM0P_MFT0_WFG_WFSA32_DCK0             *((volatile unsigned int*)(0x42401500UL))
#define bFM0P_MFT0_WFG_WFSA32_DCK1             *((volatile unsigned int*)(0x42401504UL))
#define bFM0P_MFT0_WFG_WFSA32_DCK2             *((volatile unsigned int*)(0x42401508UL))
#define bFM0P_MFT0_WFG_WFSA32_TMD0             *((volatile unsigned int*)(0x4240150CUL))
#define bFM0P_MFT0_WFG_WFSA32_TMD1             *((volatile unsigned int*)(0x42401510UL))
#define bFM0P_MFT0_WFG_WFSA32_TMD2             *((volatile unsigned int*)(0x42401514UL))
#define bFM0P_MFT0_WFG_WFSA32_GTEN0            *((volatile unsigned int*)(0x42401518UL))
#define bFM0P_MFT0_WFG_WFSA32_GTEN1            *((volatile unsigned int*)(0x4240151CUL))
#define bFM0P_MFT0_WFG_WFSA32_PSEL0            *((volatile unsigned int*)(0x42401520UL))
#define bFM0P_MFT0_WFG_WFSA32_PSEL1            *((volatile unsigned int*)(0x42401524UL))
#define bFM0P_MFT0_WFG_WFSA32_PGEN0            *((volatile unsigned int*)(0x42401528UL))
#define bFM0P_MFT0_WFG_WFSA32_PGEN1            *((volatile unsigned int*)(0x4240152CUL))
#define bFM0P_MFT0_WFG_WFSA32_DMOD0            *((volatile unsigned int*)(0x42401530UL))
#define bFM0P_MFT0_WFG_WFSA32_DMOD1            *((volatile unsigned int*)(0x42401534UL))
#define bFM0P_MFT0_WFG_WFSA54_DCK0             *((volatile unsigned int*)(0x42401580UL))
#define bFM0P_MFT0_WFG_WFSA54_DCK1             *((volatile unsigned int*)(0x42401584UL))
#define bFM0P_MFT0_WFG_WFSA54_DCK2             *((volatile unsigned int*)(0x42401588UL))
#define bFM0P_MFT0_WFG_WFSA54_TMD0             *((volatile unsigned int*)(0x4240158CUL))
#define bFM0P_MFT0_WFG_WFSA54_TMD1             *((volatile unsigned int*)(0x42401590UL))
#define bFM0P_MFT0_WFG_WFSA54_TMD2             *((volatile unsigned int*)(0x42401594UL))
#define bFM0P_MFT0_WFG_WFSA54_GTEN0            *((volatile unsigned int*)(0x42401598UL))
#define bFM0P_MFT0_WFG_WFSA54_GTEN1            *((volatile unsigned int*)(0x4240159CUL))
#define bFM0P_MFT0_WFG_WFSA54_PSEL0            *((volatile unsigned int*)(0x424015A0UL))
#define bFM0P_MFT0_WFG_WFSA54_PSEL1            *((volatile unsigned int*)(0x424015A4UL))
#define bFM0P_MFT0_WFG_WFSA54_PGEN0            *((volatile unsigned int*)(0x424015A8UL))
#define bFM0P_MFT0_WFG_WFSA54_PGEN1            *((volatile unsigned int*)(0x424015ACUL))
#define bFM0P_MFT0_WFG_WFSA54_DMOD0            *((volatile unsigned int*)(0x424015B0UL))
#define bFM0P_MFT0_WFG_WFSA54_DMOD1            *((volatile unsigned int*)(0x424015B4UL))
#define bFM0P_MFT0_WFG_WFIR_DTIFA              *((volatile unsigned int*)(0x42401600UL))
#define bFM0P_MFT0_WFG_WFIR_DTICA              *((volatile unsigned int*)(0x42401604UL))
#define bFM0P_MFT0_WFG_WFIR_DTIFB              *((volatile unsigned int*)(0x42401608UL))
#define bFM0P_MFT0_WFG_WFIR_DTICB              *((volatile unsigned int*)(0x4240160CUL))
#define bFM0P_MFT0_WFG_WFIR_TMIF10             *((volatile unsigned int*)(0x42401610UL))
#define bFM0P_MFT0_WFG_WFIR_TMIC10             *((volatile unsigned int*)(0x42401614UL))
#define bFM0P_MFT0_WFG_WFIR_TMIE10             *((volatile unsigned int*)(0x42401618UL))
#define bFM0P_MFT0_WFG_WFIR_TMIS10             *((volatile unsigned int*)(0x4240161CUL))
#define bFM0P_MFT0_WFG_WFIR_TMIF32             *((volatile unsigned int*)(0x42401620UL))
#define bFM0P_MFT0_WFG_WFIR_TMIC32             *((volatile unsigned int*)(0x42401624UL))
#define bFM0P_MFT0_WFG_WFIR_TMIE32             *((volatile unsigned int*)(0x42401628UL))
#define bFM0P_MFT0_WFG_WFIR_TMIS32             *((volatile unsigned int*)(0x4240162CUL))
#define bFM0P_MFT0_WFG_WFIR_TMIF54             *((volatile unsigned int*)(0x42401630UL))
#define bFM0P_MFT0_WFG_WFIR_TMIC54             *((volatile unsigned int*)(0x42401634UL))
#define bFM0P_MFT0_WFG_WFIR_TMIE54             *((volatile unsigned int*)(0x42401638UL))
#define bFM0P_MFT0_WFG_WFIR_TMIS54             *((volatile unsigned int*)(0x4240163CUL))
#define bFM0P_MFT0_WFG_NZCL_DTIEA              *((volatile unsigned int*)(0x42401680UL))
#define bFM0P_MFT0_WFG_NZCL_NWS0               *((volatile unsigned int*)(0x42401684UL))
#define bFM0P_MFT0_WFG_NZCL_NWS1               *((volatile unsigned int*)(0x42401688UL))
#define bFM0P_MFT0_WFG_NZCL_NWS2               *((volatile unsigned int*)(0x4240168CUL))
#define bFM0P_MFT0_WFG_NZCL_SDTI               *((volatile unsigned int*)(0x42401690UL))
#define bFM0P_MFT0_WFG_NZCL_DTIEB              *((volatile unsigned int*)(0x42401694UL))
#define bFM0P_MFT0_WFG_NZCL_DIMA               *((volatile unsigned int*)(0x424016A0UL))
#define bFM0P_MFT0_WFG_NZCL_DIMB               *((volatile unsigned int*)(0x424016A4UL))
#define bFM0P_MFT0_WFG_NZCL_WIM10              *((volatile unsigned int*)(0x424016B0UL))
#define bFM0P_MFT0_WFG_NZCL_WIM32              *((volatile unsigned int*)(0x424016B4UL))
#define bFM0P_MFT0_WFG_NZCL_WIM54              *((volatile unsigned int*)(0x424016B8UL))

