furjie/Single-BLDC-driver-and-app/s6e1a1.h
/* Multifunction Timer unit 0 Input Capture Unit registers */
#define bFM0P_MFT0_ICU_ICFS10_FSI00            *((volatile unsigned int*)(0x42400D80UL))
#define bFM0P_MFT0_ICU_ICFS10_FSI01            *((volatile unsigned int*)(0x42400D84UL))
#define bFM0P_MFT0_ICU_ICFS10_FSI02            *((volatile unsigned int*)(0x42400D88UL))
#define bFM0P_MFT0_ICU_ICFS10_FSI03            *((volatile unsigned int*)(0x42400D8CUL))
#define bFM0P_MFT0_ICU_ICFS10_FSI10            *((volatile unsigned int*)(0x42400D90UL))
#define bFM0P_MFT0_ICU_ICFS10_FSI11            *((volatile unsigned int*)(0x42400D94UL))
#define bFM0P_MFT0_ICU_ICFS10_FSI12            *((volatile unsigned int*)(0x42400D98UL))
#define bFM0P_MFT0_ICU_ICFS10_FSI13            *((volatile unsigned int*)(0x42400D9CUL))
#define bFM0P_MFT0_ICU_ICFS32_FSI00            *((volatile unsigned int*)(0x42400DA0UL))
#define bFM0P_MFT0_ICU_ICFS32_FSI01            *((volatile unsigned int*)(0x42400DA4UL))
#define bFM0P_MFT0_ICU_ICFS32_FSI02            *((volatile unsigned int*)(0x42400DA8UL))
#define bFM0P_MFT0_ICU_ICFS32_FSI03            *((volatile unsigned int*)(0x42400DACUL))
#define bFM0P_MFT0_ICU_ICFS32_FSI10            *((volatile unsigned int*)(0x42400DB0UL))
#define bFM0P_MFT0_ICU_ICFS32_FSI11            *((volatile unsigned int*)(0x42400DB4UL))
#define bFM0P_MFT0_ICU_ICFS32_FSI12            *((volatile unsigned int*)(0x42400DB8UL))
#define bFM0P_MFT0_ICU_ICFS32_FSI13            *((volatile unsigned int*)(0x42400DBCUL))
#define bFM0P_MFT0_ICU_ICSA10_EG00             *((volatile unsigned int*)(0x42401080UL))
#define bFM0P_MFT0_ICU_ICSA10_EG01             *((volatile unsigned int*)(0x42401084UL))
#define bFM0P_MFT0_ICU_ICSA10_EG10             *((volatile unsigned int*)(0x42401088UL))
#define bFM0P_MFT0_ICU_ICSA10_EG11             *((volatile unsigned int*)(0x4240108CUL))
#define bFM0P_MFT0_ICU_ICSA10_ICE0             *((volatile unsigned int*)(0x42401090UL))
#define bFM0P_MFT0_ICU_ICSA10_ICE1             *((volatile unsigned int*)(0x42401094UL))
#define bFM0P_MFT0_ICU_ICSA10_ICP0             *((volatile unsigned int*)(0x42401098UL))
#define bFM0P_MFT0_ICU_ICSA10_ICP1             *((volatile unsigned int*)(0x4240109CUL))
#define bFM0P_MFT0_ICU_ICSB10_IEI0             *((volatile unsigned int*)(0x424010A0UL))
#define bFM0P_MFT0_ICU_ICSB10_IEI1             *((volatile unsigned int*)(0x424010A4UL))
#define bFM0P_MFT0_ICU_ICSA32_EG00             *((volatile unsigned int*)(0x42401100UL))
#define bFM0P_MFT0_ICU_ICSA32_EG01             *((volatile unsigned int*)(0x42401104UL))
#define bFM0P_MFT0_ICU_ICSA32_EG10             *((volatile unsigned int*)(0x42401108UL))
#define bFM0P_MFT0_ICU_ICSA32_EG11             *((volatile unsigned int*)(0x4240110CUL))
#define bFM0P_MFT0_ICU_ICSA32_ICE0             *((volatile unsigned int*)(0x42401110UL))
#define bFM0P_MFT0_ICU_ICSA32_ICE1             *((volatile unsigned int*)(0x42401114UL))
#define bFM0P_MFT0_ICU_ICSA32_ICP0             *((volatile unsigned int*)(0x42401118UL))
#define bFM0P_MFT0_ICU_ICSA32_ICP1             *((volatile unsigned int*)(0x4240111CUL))
#define bFM0P_MFT0_ICU_ICSB32_IEI0             *((volatile unsigned int*)(0x42401120UL))
#define bFM0P_MFT0_ICU_ICSB32_IEI1             *((volatile unsigned int*)(0x42401124UL))

/* Multifunction Timer unit 0 ADC Start Compare Unit registers */
#define bFM0P_MFT0_ADCMP_ACFS10_FSA00          *((volatile unsigned int*)(0x42400E00UL))
#define bFM0P_MFT0_ADCMP_ACFS10_FSA01          *((volatile unsigned int*)(0x42400E04UL))
#define bFM0P_MFT0_ADCMP_ACFS10_FSA02          *((volatile unsigned int*)(0x42400E08UL))
#define bFM0P_MFT0_ADCMP_ACFS10_FSA03          *((volatile unsigned int*)(0x42400E0CUL))
#define bFM0P_MFT0_ADCMP_ACFS10_FSA10          *((volatile unsigned int*)(0x42400E10UL))
#define bFM0P_MFT0_ADCMP_ACFS10_FSA11          *((volatile unsigned int*)(0x42400E14UL))
#define bFM0P_MFT0_ADCMP_ACFS10_FSA12          *((volatile unsigned int*)(0x42400E18UL))
#define bFM0P_MFT0_ADCMP_ACFS10_FSA13          *((volatile unsigned int*)(0x42400E1CUL))
#define bFM0P_MFT0_ADCMP_ACFS32_FSA00          *((volatile unsigned int*)(0x42400E20UL))
#define bFM0P_MFT0_ADCMP_ACFS32_FSA01          *((volatile unsigned int*)(0x42400E24UL))
#define bFM0P_MFT0_ADCMP_ACFS32_FSA02          *((volatile unsigned int*)(0x42400E28UL))
#define bFM0P_MFT0_ADCMP_ACFS32_FSA03          *((volatile unsigned int*)(0x42400E2CUL))
#define bFM0P_MFT0_ADCMP_ACFS32_FSA10          *((volatile unsigned int*)(0x42400E30UL))
#define bFM0P_MFT0_ADCMP_ACFS32_FSA11          *((volatile unsigned int*)(0x42400E34UL))
#define bFM0P_MFT0_ADCMP_ACFS32_FSA12          *((volatile unsigned int*)(0x42400E38UL))
#define bFM0P_MFT0_ADCMP_ACFS32_FSA13          *((volatile unsigned int*)(0x42400E3CUL))
#define bFM0P_MFT0_ADCMP_ACFS54_FSA00          *((volatile unsigned int*)(0x42400E40UL))
#define bFM0P_MFT0_ADCMP_ACFS54_FSA01          *((volatile unsigned int*)(0x42400E44UL))
#define bFM0P_MFT0_ADCMP_ACFS54_FSA02          *((volatile unsigned int*)(0x42400E48UL))
#define bFM0P_MFT0_ADCMP_ACFS54_FSA03          *((volatile unsigned int*)(0x42400E4CUL))
#define bFM0P_MFT0_ADCMP_ACFS54_FSA10          *((volatile unsigned int*)(0x42400E50UL))
#define bFM0P_MFT0_ADCMP_ACFS54_FSA11          *((volatile unsigned int*)(0x42400E54UL))
#define bFM0P_MFT0_ADCMP_ACFS54_FSA12          *((volatile unsigned int*)(0x42400E58UL))
#define bFM0P_MFT0_ADCMP_ACFS54_FSA13          *((volatile unsigned int*)(0x42400E5CUL))
#define bFM0P_MFT0_ADCMP_ACMP0_ACMP0           *((volatile unsigned int*)(0x42401740UL))
#define bFM0P_MFT0_ADCMP_ACMP0_ACMP1           *((volatile unsigned int*)(0x42401744UL))
#define bFM0P_MFT0_ADCMP_ACMP0_ACMP2           *((volatile unsigned int*)(0x42401748UL))
#define bFM0P_MFT0_ADCMP_ACMP0_ACMP3           *((volatile unsigned int*)(0x4240174CUL))
#define bFM0P_MFT0_ADCMP_ACMP0_ACMP4           *((volatile unsigned int*)(0x42401750UL))
#define bFM0P_MFT0_ADCMP_ACMP0_ACMP5           *((volatile unsigned int*)(0x42401754UL))
#define bFM0P_MFT0_ADCMP_ACMP0_ACMP6           *((volatile unsigned int*)(0x42401758UL))
#define bFM0P_MFT0_ADCMP_ACMP0_ACMP7           *((volatile unsigned int*)(0x4240175CUL))
#define bFM0P_MFT0_ADCMP_ACMP0_ACMP8           *((volatile unsigned int*)(0x42401760UL))
#define bFM0P_MFT0_ADCMP_ACMP0_ACMP9           *((volatile unsigned int*)(0x42401764UL))
#define bFM0P_MFT0_ADCMP_ACMP0_ACMP10          *((volatile unsigned int*)(0x42401768UL))
#define bFM0P_MFT0_ADCMP_ACMP0_ACMP11          *((volatile unsigned int*)(0x4240176CUL))
#define bFM0P_MFT0_ADCMP_ACMP0_ACMP12          *((volatile unsigned int*)(0x42401770UL))
#define bFM0P_MFT0_ADCMP_ACMP0_ACMP13          *((volatile unsigned int*)(0x42401774UL))
#define bFM0P_MFT0_ADCMP_ACMP0_ACMP14          *((volatile unsigned int*)(0x42401778UL))
#define bFM0P_MFT0_ADCMP_ACMP0_ACMP15          *((volatile unsigned int*)(0x4240177CUL))
#define bFM0P_MFT0_ADCMP_ACMP1_ACMP0           *((volatile unsigned int*)(0x424017C0UL))
#define bFM0P_MFT0_ADCMP_ACMP1_ACMP1           *((volatile unsigned int*)(0x424017C4UL))
#define bFM0P_MFT0_ADCMP_ACMP1_ACMP2           *((volatile unsigned int*)(0x424017C8UL))
#define bFM0P_MFT0_ADCMP_ACMP1_ACMP3           *((volatile unsigned int*)(0x424017CCUL))
#define bFM0P_MFT0_ADCMP_ACMP1_ACMP4           *((volatile unsigned int*)(0x424017D0UL))
#define bFM0P_MFT0_ADCMP_ACMP1_ACMP5           *((volatile unsigned int*)(0x424017D4UL))
#define bFM0P_MFT0_ADCMP_ACMP1_ACMP6           *((volatile unsigned int*)(0x424017D8UL))
#define bFM0P_MFT0_ADCMP_ACMP1_ACMP7           *((volatile unsigned int*)(0x424017DCUL))
#define bFM0P_MFT0_ADCMP_ACMP1_ACMP8           *((volatile unsigned int*)(0x424017E0UL))
#define bFM0P_MFT0_ADCMP_ACMP1_ACMP9           *((volatile unsigned int*)(0x424017E4UL))
#define bFM0P_MFT0_ADCMP_ACMP1_ACMP10          *((volatile unsigned int*)(0x424017E8UL))
#define bFM0P_MFT0_ADCMP_ACMP1_ACMP11          *((volatile unsigned int*)(0x424017ECUL))
#define bFM0P_MFT0_ADCMP_ACMP1_ACMP12          *((volatile unsigned int*)(0x424017F0UL))
#define bFM0P_MFT0_ADCMP_ACMP1_ACMP13          *((volatile unsigned int*)(0x424017F4UL))
#define bFM0P_MFT0_ADCMP_ACMP1_ACMP14          *((volatile unsigned int*)(0x424017F8UL))
#define bFM0P_MFT0_ADCMP_ACMP1_ACMP15          *((volatile unsigned int*)(0x424017FCUL))
#define bFM0P_MFT0_ADCMP_ACMP2_ACMP0           *((volatile unsigned int*)(0x42401840UL))
#define bFM0P_MFT0_ADCMP_ACMP2_ACMP1           *((volatile unsigned int*)(0x42401844UL))
#define bFM0P_MFT0_ADCMP_ACMP2_ACMP2           *((volatile unsigned int*)(0x42401848UL))
#define bFM0P_MFT0_ADCMP_ACMP2_ACMP3           *((volatile unsigned int*)(0x4240184CUL))
#define bFM0P_MFT0_ADCMP_ACMP2_ACMP4           *((volatile unsigned int*)(0x42401850UL))
#define bFM0P_MFT0_ADCMP_ACMP2_ACMP5           *((volatile unsigned int*)(0x42401854UL))
#define bFM0P_MFT0_ADCMP_ACMP2_ACMP6           *((volatile unsigned int*)(0x42401858UL))
#define bFM0P_MFT0_ADCMP_ACMP2_ACMP7           *((volatile unsigned int*)(0x4240185CUL))
#define bFM0P_MFT0_ADCMP_ACMP2_ACMP8           *((volatile unsigned int*)(0x42401860UL))
#define bFM0P_MFT0_ADCMP_ACMP2_ACMP9           *((volatile unsigned int*)(0x42401864UL))
#define bFM0P_MFT0_ADCMP_ACMP2_ACMP10          *((volatile unsigned int*)(0x42401868UL))
#define bFM0P_MFT0_ADCMP_ACMP2_ACMP11          *((volatile unsigned int*)(0x4240186CUL))
#define bFM0P_MFT0_ADCMP_ACMP2_ACMP12          *((volatile unsigned int*)(0x42401870UL))
#define bFM0P_MFT0_ADCMP_ACMP2_ACMP13          *((volatile unsigned int*)(0x42401874UL))
#define bFM0P_MFT0_ADCMP_ACMP2_ACMP14          *((volatile unsigned int*)(0x42401878UL))
#define bFM0P_MFT0_ADCMP_ACMP2_ACMP15          *((volatile unsigned int*)(0x4240187CUL))
#define bFM0P_MFT0_ADCMP_ACMP3_ACMP0           *((volatile unsigned int*)(0x424018C0UL))
#define bFM0P_MFT0_ADCMP_ACMP3_ACMP1           *((volatile unsigned int*)(0x424018C4UL))
#define bFM0P_MFT0_ADCMP_ACMP3_ACMP2           *((volatile unsigned int*)(0x424018C8UL))
#define bFM0P_MFT0_ADCMP_ACMP3_ACMP3           *((volatile unsigned int*)(0x424018CCUL))
#define bFM0P_MFT0_ADCMP_ACMP3_ACMP4           *((volatile unsigned int*)(0x424018D0UL))
#define bFM0P_MFT0_ADCMP_ACMP3_ACMP5           *((volatile unsigned int*)(0x424018D4UL))
#define bFM0P_MFT0_ADCMP_ACMP3_ACMP6           *((volatile unsigned int*)(0x424018D8UL))
#define bFM0P_MFT0_ADCMP_ACMP3_ACMP7           *((volatile unsigned int*)(0x424018DCUL))
#define bFM0P_MFT0_ADCMP_ACMP3_ACMP8           *((volatile unsigned int*)(0x424018E0UL))
#define bFM0P_MFT0_ADCMP_ACMP3_ACMP9           *((volatile unsigned int*)(0x424018E4UL))
#define bFM0P_MFT0_ADCMP_ACMP3_ACMP10          *((volatile unsigned int*)(0x424018E8UL))
#define bFM0P_MFT0_ADCMP_ACMP3_ACMP11          *((volatile unsigned int*)(0x424018ECUL))
#define bFM0P_MFT0_ADCMP_ACMP3_ACMP12          *((volatile unsigned int*)(0x424018F0UL))
#define bFM0P_MFT0_ADCMP_ACMP3_ACMP13          *((volatile unsigned int*)(0x424018F4UL))
#define bFM0P_MFT0_ADCMP_ACMP3_ACMP14          *((volatile unsigned int*)(0x424018F8UL))
#define bFM0P_MFT0_ADCMP_ACMP3_ACMP15          *((volatile unsigned int*)(0x424018FCUL))
#define bFM0P_MFT0_ADCMP_ACMP4_ACMP0           *((volatile unsigned int*)(0x42401940UL))
#define bFM0P_MFT0_ADCMP_ACMP4_ACMP1           *((volatile unsigned int*)(0x42401944UL))
#define bFM0P_MFT0_ADCMP_ACMP4_ACMP2           *((volatile unsigned int*)(0x42401948UL))
#define bFM0P_MFT0_ADCMP_ACMP4_ACMP3           *((volatile unsigned int*)(0x4240194CUL))
#define bFM0P_MFT0_ADCMP_ACMP4_ACMP4           *((volatile unsigned int*)(0x42401950UL))
#define bFM0P_MFT0_ADCMP_ACMP4_ACMP5           *((volatile unsigned int*)(0x42401954UL))
#define bFM0P_MFT0_ADCMP_ACMP4_ACMP6           *((volatile unsigned int*)(0x42401958UL))
#define bFM0P_MFT0_ADCMP_ACMP4_ACMP7           *((volatile unsigned int*)(0x4240195CUL))
#define bFM0P_MFT0_ADCMP_ACMP4_ACMP8           *((volatile unsigned int*)(0x42401960UL))
#define bFM0P_MFT0_ADCMP_ACMP4_ACMP9           *((volatile unsigned int*)(0x42401964UL))
#define bFM0P_MFT0_ADCMP_ACMP4_ACMP10          *((volatile unsigned int*)(0x42401968UL))
#define bFM0P_MFT0_ADCMP_ACMP4_ACMP11          *((volatile unsigned int*)(0x4240196CUL))
#define bFM0P_MFT0_ADCMP_ACMP4_ACMP12          *((volatile unsigned int*)(0x42401970UL))
#define bFM0P_MFT0_ADCMP_ACMP4_ACMP13          *((volatile unsigned int*)(0x42401974UL))
#define bFM0P_MFT0_ADCMP_ACMP4_ACMP14          *((volatile unsigned int*)(0x42401978UL))
#define bFM0P_MFT0_ADCMP_ACMP4_ACMP15          *((volatile unsigned int*)(0x4240197CUL))
#define bFM0P_MFT0_ADCMP_ACMP5_ACMP0           *((volatile unsigned int*)(0x424019C0UL))
#define bFM0P_MFT0_ADCMP_ACMP5_ACMP1           *((volatile unsigned int*)(0x424019C4UL))
#define bFM0P_MFT0_ADCMP_ACMP5_ACMP2           *((volatile unsigned int*)(0x424019C8UL))
#define bFM0P_MFT0_ADCMP_ACMP5_ACMP3           *((volatile unsigned int*)(0x424019CCUL))
#define bFM0P_MFT0_ADCMP_ACMP5_ACMP4           *((volatile unsigned int*)(0x424019D0UL))
#define bFM0P_MFT0_ADCMP_ACMP5_ACMP5           *((volatile unsigned int*)(0x424019D4UL))
#define bFM0P_MFT0_ADCMP_ACMP5_ACMP6           *((volatile unsigned int*)(0x424019D8UL))
#define bFM0P_MFT0_ADCMP_ACMP5_ACMP7           *((volatile unsigned int*)(0x424019DCUL))
#define bFM0P_MFT0_ADCMP_ACMP5_ACMP8           *((volatile unsigned int*)(0x424019E0UL))
#define bFM0P_MFT0_ADCMP_ACMP5_ACMP9           *((volatile unsigned int*)(0x424019E4UL))
#define bFM0P_MFT0_ADCMP_ACMP5_ACMP10          *((volatile unsigned int*)(0x424019E8UL))
#define bFM0P_MFT0_ADCMP_ACMP5_ACMP11          *((volatile unsigned int*)(0x424019ECUL))
#define bFM0P_MFT0_ADCMP_ACMP5_ACMP12          *((volatile unsigned int*)(0x424019F0UL))
#define bFM0P_MFT0_ADCMP_ACMP5_ACMP13          *((volatile unsigned int*)(0x424019F4UL))
#define bFM0P_MFT0_ADCMP_ACMP5_ACMP14          *((volatile unsigned int*)(0x424019F8UL))
#define bFM0P_MFT0_ADCMP_ACMP5_ACMP15          *((volatile unsigned int*)(0x424019FCUL))
#define bFM0P_MFT0_ADCMP_ACSA_CE00            *((volatile unsigned int*)(0x42401A00UL))
#define bFM0P_MFT0_ADCMP_ACSA_CE01            *((volatile unsigned int*)(0x42401A04UL))
#define bFM0P_MFT0_ADCMP_ACSA_CE10            *((volatile unsigned int*)(0x42401A08UL))
#define bFM0P_MFT0_ADCMP_ACSA_CE11            *((volatile unsigned int*)(0x42401A0CUL))
#define bFM0P_MFT0_ADCMP_ACSA_CE20            *((volatile unsigned int*)(0x42401A10UL))
#define bFM0P_MFT0_ADCMP_ACSA_CE21            *((volatile unsigned int*)(0x42401A14UL))
#define bFM0P_MFT0_ADCMP_ACSA_SEL00           *((volatile unsigned int*)(0x42401A20UL))
#define bFM0P_MFT0_ADCMP_ACSA_SEL01           *((volatile unsigned int*)(0x42401A24UL))
#define bFM0P_MFT0_ADCMP_ACSA_SEL10           *((volatile unsigned int*)(0x42401A28UL))
#define bFM0P_MFT0_ADCMP_ACSA_SEL11           *((volatile unsigned int*)(0x42401A2CUL))
#define bFM0P_MFT0_ADCMP_ACSA_SEL20           *((volatile unsigned int*)(0x42401A30UL))
#define bFM0P_MFT0_ADCMP_ACSA_SEL21           *((volatile unsigned int*)(0x42401A34UL))
#define bFM0P_MFT0_ADCMP_ACSC0_BUFE0           *((volatile unsigned int*)(0x42401A80UL))
#define bFM0P_MFT0_ADCMP_ACSC0_BUFE1           *((volatile unsigned int*)(0x42401A84UL))
#define bFM0P_MFT0_ADCMP_ACSC0_ADSEL0          *((volatile unsigned int*)(0x42401A88UL))
#define bFM0P_MFT0_ADCMP_ACSC0_ADSEL1          *((volatile unsigned int*)(0x42401A8CUL))
#define bFM0P_MFT0_ADCMP_ACSC0_ADSEL2          *((volatile unsigned int*)(0x42401A90UL))
#define bFM0P_MFT0_ADCMP_ACSD0_AMOD            *((volatile unsigned int*)(0x42401AA0UL))
#define bFM0P_MFT0_ADCMP_ACSD0_OCUS            *((volatile unsigned int*)(0x42401AA4UL))
#define bFM0P_MFT0_ADCMP_ACSD0_DE              *((volatile unsigned int*)(0x42401AB0UL))
#define bFM0P_MFT0_ADCMP_ACSD0_PE              *((volatile unsigned int*)(0x42401AB4UL))
#define bFM0P_MFT0_ADCMP_ACSD0_UE              *((volatile unsigned int*)(0x42401AB8UL))
#define bFM0P_MFT0_ADCMP_ACSD0_ZE              *((volatile unsigned int*)(0x42401ABCUL))
#define bFM0P_MFT0_ADCMP_ACSC1_BUFE0           *((volatile unsigned int*)(0x42401B00UL))
#define bFM0P_MFT0_ADCMP_ACSC1_BUFE1           *((volatile unsigned int*)(0x42401B04UL))
#define bFM0P_MFT0_ADCMP_ACSC1_ADSEL0          *((volatile unsigned int*)(0x42401B08UL))
#define bFM0P_MFT0_ADCMP_ACSC1_ADSEL1          *((volatile unsigned int*)(0x42401B0CUL))
#define bFM0P_MFT0_ADCMP_ACSC1_ADSEL2          *((volatile unsigned int*)(0x42401B10UL))
#define bFM0P_MFT0_ADCMP_ACSD1_AMOD            *((volatile unsigned int*)(0x42401B20UL))
#define bFM0P_MFT0_ADCMP_ACSD1_OCUS            *((volatile unsigned int*)(0x42401B24UL))
#define bFM0P_MFT0_ADCMP_ACSD1_DE              *((volatile unsigned int*)(0x42401B30UL))
#define bFM0P_MFT0_ADCMP_ACSD1_PE              *((volatile unsigned int*)(0x42401B34UL))
#define bFM0P_MFT0_ADCMP_ACSD1_UE              *((volatile unsigned int*)(0x42401B38UL))
#define bFM0P_MFT0_ADCMP_ACSD1_ZE              *((volatile unsigned int*)(0x42401B3CUL))
#define bFM0P_MFT0_ADCMP_ACSC2_BUFE0           *((volatile unsigned int*)(0x42401B80UL))
#define bFM0P_MFT0_ADCMP_ACSC2_BUFE1           *((volatile unsigned int*)(0x42401B84UL))
#define bFM0P_MFT0_ADCMP_ACSC2_ADSEL0          *((volatile unsigned int*)(0x42401B88UL))
#define bFM0P_MFT0_ADCMP_ACSC2_ADSEL1          *((volatile unsigned int*)(0x42401B8CUL))
#define bFM0P_MFT0_ADCMP_ACSC2_ADSEL2          *((volatile unsigned int*)(0x42401B90UL))
#define bFM0P_MFT0_ADCMP_ACSD2_AMOD            *((volatile unsigned int*)(0x42401BA0UL))
#define bFM0P_MFT0_ADCMP_ACSD2_OCUS            *((volatile unsigned int*)(0x42401BA4UL))
#define bFM0P_MFT0_ADCMP_ACSD2_DE              *((volatile unsigned int*)(0x42401BB0UL))
#define bFM0P_MFT0_ADCMP_ACSD2_PE              *((volatile unsigned int*)(0x42401BB4UL))
#define bFM0P_MFT0_ADCMP_ACSD2_UE              *((volatile unsigned int*)(0x42401BB8UL))
#define bFM0P_MFT0_ADCMP_ACSD2_ZE              *((volatile unsigned int*)(0x42401BBCUL))
#define bFM0P_MFT0_ADCMP_ACSC3_BUFE0           *((volatile unsigned int*)(0x42401C00UL))
#define bFM0P_MFT0_ADCMP_ACSC3_BUFE1           *((volatile unsigned int*)(0x42401C04UL))
#define bFM0P_MFT0_ADCMP_ACSC3_ADSEL0          *((volatile unsigned int*)(0x42401C08UL))
#define bFM0P_MFT0_ADCMP_ACSC3_ADSEL1          *((volatile unsigned int*)(0x42401C0CUL))
#define bFM0P_MFT0_ADCMP_ACSC3_ADSEL2          *((volatile unsigned int*)(0x42401C10UL))
#define bFM0P_MFT0_ADCMP_ACSD3_AMOD            *((volatile unsigned int*)(0x42401C20UL))
#define bFM0P_MFT0_ADCMP_ACSD3_OCUS            *((volatile unsigned int*)(0x42401C24UL))
#define bFM0P_MFT0_ADCMP_ACSD3_DE              *((volatile unsigned int*)(0x42401C30UL))
#define bFM0P_MFT0_ADCMP_ACSD3_PE              *((volatile unsigned int*)(0x42401C34UL))
#define bFM0P_MFT0_ADCMP_ACSD3_UE              *((volatile unsigned int*)(0x42401C38UL))
#define bFM0P_MFT0_ADCMP_ACSD3_ZE              *((volatile unsigned int*)(0x42401C3CUL))
#define bFM0P_MFT0_ADCMP_ACSC4_BUFE0           *((volatile unsigned int*)(0x42401C80UL))
#define bFM0P_MFT0_ADCMP_ACSC4_BUFE1           *((volatile unsigned int*)(0x42401C84UL))
#define bFM0P_MFT0_ADCMP_ACSC4_ADSEL0          *((volatile unsigned int*)(0x42401C88UL))
#define bFM0P_MFT0_ADCMP_ACSC4_ADSEL1          *((volatile unsigned int*)(0x42401C8CUL))
#define bFM0P_MFT0_ADCMP_ACSC4_ADSEL2          *((volatile unsigned int*)(0x42401C90UL))
#define bFM0P_MFT0_ADCMP_ACSD4_AMOD            *((volatile unsigned int*)(0x42401CA0UL))
#define bFM0P_MFT0_ADCMP_ACSD4_OCUS            *((volatile unsigned int*)(0x42401CA4UL))
#define bFM0P_MFT0_ADCMP_ACSD4_DE              *((volatile unsigned int*)(0x42401CB0UL))
#define bFM0P_MFT0_ADCMP_ACSD4_PE              *((volatile unsigned int*)(0x42401CB4UL))
#define bFM0P_MFT0_ADCMP_ACSD4_UE              *((volatile unsigned int*)(0x42401CB8UL))
#define bFM0P_MFT0_ADCMP_ACSD4_ZE              *((volatile unsigned int*)(0x42401CBCUL))
#define bFM0P_MFT0_ADCMP_ACSC5_BUFE0           *((volatile unsigned int*)(0x42401D00UL))
#define bFM0P_MFT0_ADCMP_ACSC5_BUFE1           *((volatile unsigned int*)(0x42401D04UL))
#define bFM0P_MFT0_ADCMP_ACSC5_ADSEL0          *((volatile unsigned int*)(0x42401D08UL))
#define bFM0P_MFT0_ADCMP_ACSC5_ADSEL1          *((volatile unsigned int*)(0x42401D0CUL))
#define bFM0P_MFT0_ADCMP_ACSC5_ADSEL2          *((volatile unsigned int*)(0x42401D10UL))
#define bFM0P_MFT0_ADCMP_ACSD5_AMOD            *((volatile unsigned int*)(0x42401D20UL))
#define bFM0P_MFT0_ADCMP_ACSD5_OCUS            *((volatile unsigned int*)(0x42401D24UL))
#define bFM0P_MFT0_ADCMP_ACSD5_DE              *((volatile unsigned int*)(0x42401D30UL))
#define bFM0P_MFT0_ADCMP_ACSD5_PE              *((volatile unsigned int*)(0x42401D34UL))
#define bFM0P_MFT0_ADCMP_ACSD5_UE              *((volatile unsigned int*)(0x42401D38UL))
#define bFM0P_MFT0_ADCMP_ACSD5_ZE              *((volatile unsigned int*)(0x42401D3CUL))


