furjie/Single-BLDC-driver-and-app/s6e1a1.h
/* Multifunction Timer PPG registers */
#define bFM0P_MFT_PPG_TTCR0_STR0               *((volatile unsigned int*)(0x42480060UL))
#define bFM0P_MFT_PPG_TTCR0_MONI0              *((volatile unsigned int*)(0x42480064UL))
#define bFM0P_MFT_PPG_TTCR0_CS00               *((volatile unsigned int*)(0x42480068UL))
#define bFM0P_MFT_PPG_TTCR0_CS01               *((volatile unsigned int*)(0x4248006CUL))
#define bFM0P_MFT_PPG_TTCR0_TRG0O              *((volatile unsigned int*)(0x42480070UL))
#define bFM0P_MFT_PPG_TTCR0_TRG2O              *((volatile unsigned int*)(0x42480074UL))
#define bFM0P_MFT_PPG_TTCR0_TRG4O              *((volatile unsigned int*)(0x42480078UL))
#define bFM0P_MFT_PPG_TTCR0_TRG6O              *((volatile unsigned int*)(0x4248007CUL))
#define bFM0P_MFT_PPG_TTCR1_STR1               *((volatile unsigned int*)(0x42480420UL))
#define bFM0P_MFT_PPG_TTCR1_MONI1              *((volatile unsigned int*)(0x42480424UL))
#define bFM0P_MFT_PPG_TTCR1_CS10               *((volatile unsigned int*)(0x42480428UL))
#define bFM0P_MFT_PPG_TTCR1_CS11               *((volatile unsigned int*)(0x4248042CUL))
#define bFM0P_MFT_PPG_TTCR1_TRG1O              *((volatile unsigned int*)(0x42480430UL))
#define bFM0P_MFT_PPG_TTCR1_TRG3O              *((volatile unsigned int*)(0x42480434UL))
#define bFM0P_MFT_PPG_TTCR1_TRG5O              *((volatile unsigned int*)(0x42480438UL))
#define bFM0P_MFT_PPG_TTCR1_TRG7O              *((volatile unsigned int*)(0x4248043CUL))
#define bFM0P_MFT_PPG_TTCR2_STR2               *((volatile unsigned int*)(0x42480820UL))
#define bFM0P_MFT_PPG_TTCR2_MONI2              *((volatile unsigned int*)(0x42480824UL))
#define bFM0P_MFT_PPG_TTCR2_CS20               *((volatile unsigned int*)(0x42480828UL))
#define bFM0P_MFT_PPG_TTCR2_CS21               *((volatile unsigned int*)(0x4248082CUL))
#define bFM0P_MFT_PPG_TTCR2_TRG16O             *((volatile unsigned int*)(0x42480830UL))
#define bFM0P_MFT_PPG_TTCR2_TRG18O             *((volatile unsigned int*)(0x42480834UL))
#define bFM0P_MFT_PPG_TTCR2_TRG20O             *((volatile unsigned int*)(0x42480838UL))
#define bFM0P_MFT_PPG_TTCR2_TRG22O             *((volatile unsigned int*)(0x4248083CUL))
#define bFM0P_MFT_PPG_TRG_PEN00                *((volatile unsigned int*)(0x42482000UL))
#define bFM0P_MFT_PPG_TRG_PEN01                *((volatile unsigned int*)(0x42482004UL))
#define bFM0P_MFT_PPG_TRG_PEN02                *((volatile unsigned int*)(0x42482008UL))
#define bFM0P_MFT_PPG_TRG_PEN03                *((volatile unsigned int*)(0x4248200CUL))
#define bFM0P_MFT_PPG_TRG_PEN04                *((volatile unsigned int*)(0x42482010UL))
#define bFM0P_MFT_PPG_TRG_PEN05                *((volatile unsigned int*)(0x42482014UL))
#define bFM0P_MFT_PPG_TRG_PEN06                *((volatile unsigned int*)(0x42482018UL))
#define bFM0P_MFT_PPG_TRG_PEN07                *((volatile unsigned int*)(0x4248201CUL))
#define bFM0P_MFT_PPG_TRG_PEN08                *((volatile unsigned int*)(0x42482020UL))
#define bFM0P_MFT_PPG_TRG_PEN09                *((volatile unsigned int*)(0x42482024UL))
#define bFM0P_MFT_PPG_TRG_PEN10                *((volatile unsigned int*)(0x42482028UL))
#define bFM0P_MFT_PPG_TRG_PEN11                *((volatile unsigned int*)(0x4248202CUL))
#define bFM0P_MFT_PPG_TRG_PEN12                *((volatile unsigned int*)(0x42482030UL))
#define bFM0P_MFT_PPG_TRG_PEN13                *((volatile unsigned int*)(0x42482034UL))
#define bFM0P_MFT_PPG_TRG_PEN14                *((volatile unsigned int*)(0x42482038UL))
#define bFM0P_MFT_PPG_TRG_PEN15                *((volatile unsigned int*)(0x4248203CUL))
#define bFM0P_MFT_PPG_REVC0_REV00              *((volatile unsigned int*)(0x42482080UL))
#define bFM0P_MFT_PPG_REVC0_REV01              *((volatile unsigned int*)(0x42482084UL))
#define bFM0P_MFT_PPG_REVC0_REV02              *((volatile unsigned int*)(0x42482088UL))
#define bFM0P_MFT_PPG_REVC0_REV03              *((volatile unsigned int*)(0x4248208CUL))
#define bFM0P_MFT_PPG_REVC0_REV04              *((volatile unsigned int*)(0x42482090UL))
#define bFM0P_MFT_PPG_REVC0_REV05              *((volatile unsigned int*)(0x42482094UL))
#define bFM0P_MFT_PPG_REVC0_REV06              *((volatile unsigned int*)(0x42482098UL))
#define bFM0P_MFT_PPG_REVC0_REV07              *((volatile unsigned int*)(0x4248209CUL))
#define bFM0P_MFT_PPG_REVC0_REV08              *((volatile unsigned int*)(0x424820A0UL))
#define bFM0P_MFT_PPG_REVC0_REV09              *((volatile unsigned int*)(0x424820A4UL))
#define bFM0P_MFT_PPG_REVC0_REV10              *((volatile unsigned int*)(0x424820A8UL))
#define bFM0P_MFT_PPG_REVC0_REV11              *((volatile unsigned int*)(0x424820ACUL))
#define bFM0P_MFT_PPG_REVC0_REV12              *((volatile unsigned int*)(0x424820B0UL))
#define bFM0P_MFT_PPG_REVC0_REV13              *((volatile unsigned int*)(0x424820B4UL))
#define bFM0P_MFT_PPG_REVC0_REV14              *((volatile unsigned int*)(0x424820B8UL))
#define bFM0P_MFT_PPG_REVC0_REV15              *((volatile unsigned int*)(0x424820BCUL))
#define bFM0P_MFT_PPG_TRG1_PEN16               *((volatile unsigned int*)(0x42482800UL))
#define bFM0P_MFT_PPG_TRG1_PEN17               *((volatile unsigned int*)(0x42482804UL))
#define bFM0P_MFT_PPG_TRG1_PEN18               *((volatile unsigned int*)(0x42482808UL))
#define bFM0P_MFT_PPG_TRG1_PEN19               *((volatile unsigned int*)(0x4248280CUL))
#define bFM0P_MFT_PPG_TRG1_PEN20               *((volatile unsigned int*)(0x42482810UL))
#define bFM0P_MFT_PPG_TRG1_PEN21               *((volatile unsigned int*)(0x42482814UL))
#define bFM0P_MFT_PPG_TRG1_PEN22               *((volatile unsigned int*)(0x42482818UL))
#define bFM0P_MFT_PPG_TRG1_PEN23               *((volatile unsigned int*)(0x4248281CUL))
#define bFM0P_MFT_PPG_REVC1_REV16              *((volatile unsigned int*)(0x42482880UL))
#define bFM0P_MFT_PPG_REVC1_REV17              *((volatile unsigned int*)(0x42482884UL))
#define bFM0P_MFT_PPG_REVC1_REV18              *((volatile unsigned int*)(0x42482888UL))
#define bFM0P_MFT_PPG_REVC1_REV19              *((volatile unsigned int*)(0x4248288CUL))
#define bFM0P_MFT_PPG_REVC1_REV20              *((volatile unsigned int*)(0x42482890UL))
#define bFM0P_MFT_PPG_REVC1_REV21              *((volatile unsigned int*)(0x42482894UL))
#define bFM0P_MFT_PPG_REVC1_REV22              *((volatile unsigned int*)(0x42482898UL))
#define bFM0P_MFT_PPG_REVC1_REV23              *((volatile unsigned int*)(0x4248289CUL))
#define bFM0P_MFT_PPG_PPGC1_TTRG               *((volatile unsigned int*)(0x42484000UL))
#define bFM0P_MFT_PPG_PPGC1_MD0                *((volatile unsigned int*)(0x42484004UL))
#define bFM0P_MFT_PPG_PPGC1_MD1                *((volatile unsigned int*)(0x42484008UL))
#define bFM0P_MFT_PPG_PPGC1_PCS0               *((volatile unsigned int*)(0x4248400CUL))
#define bFM0P_MFT_PPG_PPGC1_PCS1               *((volatile unsigned int*)(0x42484010UL))
#define bFM0P_MFT_PPG_PPGC1_INTM               *((volatile unsigned int*)(0x42484014UL))
#define bFM0P_MFT_PPG_PPGC1_PUF                *((volatile unsigned int*)(0x42484018UL))
#define bFM0P_MFT_PPG_PPGC1_PIE                *((volatile unsigned int*)(0x4248401CUL))
#define bFM0P_MFT_PPG_PPGC0_TTRG               *((volatile unsigned int*)(0x42484020UL))
#define bFM0P_MFT_PPG_PPGC0_MD0                *((volatile unsigned int*)(0x42484024UL))
#define bFM0P_MFT_PPG_PPGC0_MD1                *((volatile unsigned int*)(0x42484028UL))
#define bFM0P_MFT_PPG_PPGC0_PCS0               *((volatile unsigned int*)(0x4248402CUL))
#define bFM0P_MFT_PPG_PPGC0_PCS1               *((volatile unsigned int*)(0x42484030UL))
#define bFM0P_MFT_PPG_PPGC0_INTM               *((volatile unsigned int*)(0x42484034UL))
#define bFM0P_MFT_PPG_PPGC0_PUF                *((volatile unsigned int*)(0x42484038UL))
#define bFM0P_MFT_PPG_PPGC0_PIE                *((volatile unsigned int*)(0x4248403CUL))
#define bFM0P_MFT_PPG_PPGC3_TTRG               *((volatile unsigned int*)(0x42484080UL))
#define bFM0P_MFT_PPG_PPGC3_MD0                *((volatile unsigned int*)(0x42484084UL))
#define bFM0P_MFT_PPG_PPGC3_MD1                *((volatile unsigned int*)(0x42484088UL))
#define bFM0P_MFT_PPG_PPGC3_PCS0               *((volatile unsigned int*)(0x4248408CUL))
#define bFM0P_MFT_PPG_PPGC3_PCS1               *((volatile unsigned int*)(0x42484090UL))
#define bFM0P_MFT_PPG_PPGC3_INTM               *((volatile unsigned int*)(0x42484094UL))
#define bFM0P_MFT_PPG_PPGC3_PUF                *((volatile unsigned int*)(0x42484098UL))
#define bFM0P_MFT_PPG_PPGC3_PIE                *((volatile unsigned int*)(0x4248409CUL))
#define bFM0P_MFT_PPG_PPGC2_TTRG               *((volatile unsigned int*)(0x424840A0UL))
#define bFM0P_MFT_PPG_PPGC2_MD0                *((volatile unsigned int*)(0x424840A4UL))
#define bFM0P_MFT_PPG_PPGC2_MD1                *((volatile unsigned int*)(0x424840A8UL))
#define bFM0P_MFT_PPG_PPGC2_PCS0               *((volatile unsigned int*)(0x424840ACUL))
#define bFM0P_MFT_PPG_PPGC2_PCS1               *((volatile unsigned int*)(0x424840B0UL))
#define bFM0P_MFT_PPG_PPGC2_INTM               *((volatile unsigned int*)(0x424840B4UL))
#define bFM0P_MFT_PPG_PPGC2_PUF                *((volatile unsigned int*)(0x424840B8UL))
#define bFM0P_MFT_PPG_PPGC2_PIE                *((volatile unsigned int*)(0x424840BCUL))
#define bFM0P_MFT_PPG_PRLL0_PRLL0              *((volatile unsigned int*)(0x42484100UL))
#define bFM0P_MFT_PPG_PRLL0_PRLL1              *((volatile unsigned int*)(0x42484104UL))
#define bFM0P_MFT_PPG_PRLL0_PRLL2              *((volatile unsigned int*)(0x42484108UL))
#define bFM0P_MFT_PPG_PRLL0_PRLL3              *((volatile unsigned int*)(0x4248410CUL))
#define bFM0P_MFT_PPG_PRLL0_PRLL4              *((volatile unsigned int*)(0x42484110UL))
#define bFM0P_MFT_PPG_PRLL0_PRLL5              *((volatile unsigned int*)(0x42484114UL))
#define bFM0P_MFT_PPG_PRLL0_PRLL6              *((volatile unsigned int*)(0x42484118UL))
#define bFM0P_MFT_PPG_PRLL0_PRLL7              *((volatile unsigned int*)(0x4248411CUL))
#define bFM0P_MFT_PPG_PRLH0_PRLH0              *((volatile unsigned int*)(0x42484120UL))
#define bFM0P_MFT_PPG_PRLH0_PRLH1              *((volatile unsigned int*)(0x42484124UL))
#define bFM0P_MFT_PPG_PRLH0_PRLH2              *((volatile unsigned int*)(0x42484128UL))
#define bFM0P_MFT_PPG_PRLH0_PRLH3              *((volatile unsigned int*)(0x4248412CUL))
#define bFM0P_MFT_PPG_PRLH0_PRLH4              *((volatile unsigned int*)(0x42484130UL))
#define bFM0P_MFT_PPG_PRLH0_PRLH5              *((volatile unsigned int*)(0x42484134UL))
#define bFM0P_MFT_PPG_PRLH0_PRLH6              *((volatile unsigned int*)(0x42484138UL))
#define bFM0P_MFT_PPG_PRLH0_PRLH7              *((volatile unsigned int*)(0x4248413CUL))
#define bFM0P_MFT_PPG_PRLL1_PRLL0              *((volatile unsigned int*)(0x42484180UL))
#define bFM0P_MFT_PPG_PRLL1_PRLL1              *((volatile unsigned int*)(0x42484184UL))
#define bFM0P_MFT_PPG_PRLL1_PRLL2              *((volatile unsigned int*)(0x42484188UL))
#define bFM0P_MFT_PPG_PRLL1_PRLL3              *((volatile unsigned int*)(0x4248418CUL))
#define bFM0P_MFT_PPG_PRLL1_PRLL4              *((volatile unsigned int*)(0x42484190UL))
#define bFM0P_MFT_PPG_PRLL1_PRLL5              *((volatile unsigned int*)(0x42484194UL))
#define bFM0P_MFT_PPG_PRLL1_PRLL6              *((volatile unsigned int*)(0x42484198UL))
#define bFM0P_MFT_PPG_PRLL1_PRLL7              *((volatile unsigned int*)(0x4248419CUL))
#define bFM0P_MFT_PPG_PRLH1_PRLH0              *((volatile unsigned int*)(0x424841A0UL))
#define bFM0P_MFT_PPG_PRLH1_PRLH1              *((volatile unsigned int*)(0x424841A4UL))
#define bFM0P_MFT_PPG_PRLH1_PRLH2              *((volatile unsigned int*)(0x424841A8UL))
#define bFM0P_MFT_PPG_PRLH1_PRLH3              *((volatile unsigned int*)(0x424841ACUL))
#define bFM0P_MFT_PPG_PRLH1_PRLH4              *((volatile unsigned int*)(0x424841B0UL))
#define bFM0P_MFT_PPG_PRLH1_PRLH5              *((volatile unsigned int*)(0x424841B4UL))
#define bFM0P_MFT_PPG_PRLH1_PRLH6              *((volatile unsigned int*)(0x424841B8UL))
#define bFM0P_MFT_PPG_PRLH1_PRLH7              *((volatile unsigned int*)(0x424841BCUL))
#define bFM0P_MFT_PPG_PRLL2_PRLL0              *((volatile unsigned int*)(0x42484200UL))
#define bFM0P_MFT_PPG_PRLL2_PRLL1              *((volatile unsigned int*)(0x42484204UL))
#define bFM0P_MFT_PPG_PRLL2_PRLL2              *((volatile unsigned int*)(0x42484208UL))
#define bFM0P_MFT_PPG_PRLL2_PRLL3              *((volatile unsigned int*)(0x4248420CUL))
#define bFM0P_MFT_PPG_PRLL2_PRLL4              *((volatile unsigned int*)(0x42484210UL))
#define bFM0P_MFT_PPG_PRLL2_PRLL5              *((volatile unsigned int*)(0x42484214UL))
#define bFM0P_MFT_PPG_PRLL2_PRLL6              *((volatile unsigned int*)(0x42484218UL))
#define bFM0P_MFT_PPG_PRLL2_PRLL7              *((volatile unsigned int*)(0x4248421CUL))
#define bFM0P_MFT_PPG_PRLH2_PRLH0              *((volatile unsigned int*)(0x42484220UL))
#define bFM0P_MFT_PPG_PRLH2_PRLH1              *((volatile unsigned int*)(0x42484224UL))
#define bFM0P_MFT_PPG_PRLH2_PRLH2              *((volatile unsigned int*)(0x42484228UL))
#define bFM0P_MFT_PPG_PRLH2_PRLH3              *((volatile unsigned int*)(0x4248422CUL))
#define bFM0P_MFT_PPG_PRLH2_PRLH4              *((volatile unsigned int*)(0x42484230UL))
#define bFM0P_MFT_PPG_PRLH2_PRLH5              *((volatile unsigned int*)(0x42484234UL))
#define bFM0P_MFT_PPG_PRLH2_PRLH6              *((volatile unsigned int*)(0x42484238UL))
#define bFM0P_MFT_PPG_PRLH2_PRLH7              *((volatile unsigned int*)(0x4248423CUL))
#define bFM0P_MFT_PPG_PRLL3_PRLL0              *((volatile unsigned int*)(0x42484280UL))
#define bFM0P_MFT_PPG_PRLL3_PRLL1              *((volatile unsigned int*)(0x42484284UL))
#define bFM0P_MFT_PPG_PRLL3_PRLL2              *((volatile unsigned int*)(0x42484288UL))
#define bFM0P_MFT_PPG_PRLL3_PRLL3              *((volatile unsigned int*)(0x4248428CUL))
#define bFM0P_MFT_PPG_PRLL3_PRLL4              *((volatile unsigned int*)(0x42484290UL))
#define bFM0P_MFT_PPG_PRLL3_PRLL5              *((volatile unsigned int*)(0x42484294UL))
#define bFM0P_MFT_PPG_PRLL3_PRLL6              *((volatile unsigned int*)(0x42484298UL))
#define bFM0P_MFT_PPG_PRLL3_PRLL7              *((volatile unsigned int*)(0x4248429CUL))
#define bFM0P_MFT_PPG_PRLH3_PRLH0              *((volatile unsigned int*)(0x424842A0UL))
#define bFM0P_MFT_PPG_PRLH3_PRLH1              *((volatile unsigned int*)(0x424842A4UL))
#define bFM0P_MFT_PPG_PRLH3_PRLH2              *((volatile unsigned int*)(0x424842A8UL))
#define bFM0P_MFT_PPG_PRLH3_PRLH3              *((volatile unsigned int*)(0x424842ACUL))
#define bFM0P_MFT_PPG_PRLH3_PRLH4              *((volatile unsigned int*)(0x424842B0UL))
#define bFM0P_MFT_PPG_PRLH3_PRLH5              *((volatile unsigned int*)(0x424842B4UL))
#define bFM0P_MFT_PPG_PRLH3_PRLH6              *((volatile unsigned int*)(0x424842B8UL))
#define bFM0P_MFT_PPG_PRLH3_PRLH7              *((volatile unsigned int*)(0x424842BCUL))
#define bFM0P_MFT_PPG_GATEC0_EDGE0             *((volatile unsigned int*)(0x42484300UL))
#define bFM0P_MFT_PPG_GATEC0_STRG0             *((volatile unsigned int*)(0x42484304UL))
#define bFM0P_MFT_PPG_GATEC0_EDGE2             *((volatile unsigned int*)(0x42484310UL))
#define bFM0P_MFT_PPG_GATEC0_STRG2             *((volatile unsigned int*)(0x42484314UL))
#define bFM0P_MFT_PPG_PPGC5_TTRG               *((volatile unsigned int*)(0x42484800UL))
#define bFM0P_MFT_PPG_PPGC5_MD0                *((volatile unsigned int*)(0x42484804UL))
#define bFM0P_MFT_PPG_PPGC5_MD1                *((volatile unsigned int*)(0x42484808UL))
#define bFM0P_MFT_PPG_PPGC5_PCS0               *((volatile unsigned int*)(0x4248480CUL))
#define bFM0P_MFT_PPG_PPGC5_PCS1               *((volatile unsigned int*)(0x42484810UL))
#define bFM0P_MFT_PPG_PPGC5_INTM               *((volatile unsigned int*)(0x42484814UL))
#define bFM0P_MFT_PPG_PPGC5_PUF                *((volatile unsigned int*)(0x42484818UL))
#define bFM0P_MFT_PPG_PPGC5_PIE                *((volatile unsigned int*)(0x4248481CUL))
#define bFM0P_MFT_PPG_PPGC4_TTRG               *((volatile unsigned int*)(0x42484820UL))
#define bFM0P_MFT_PPG_PPGC4_MD0                *((volatile unsigned int*)(0x42484824UL))
#define bFM0P_MFT_PPG_PPGC4_MD1                *((volatile unsigned int*)(0x42484828UL))
#define bFM0P_MFT_PPG_PPGC4_PCS0               *((volatile unsigned int*)(0x4248482CUL))
#define bFM0P_MFT_PPG_PPGC4_PCS1               *((volatile unsigned int*)(0x42484830UL))
#define bFM0P_MFT_PPG_PPGC4_INTM               *((volatile unsigned int*)(0x42484834UL))
#define bFM0P_MFT_PPG_PPGC4_PUF                *((volatile unsigned int*)(0x42484838UL))
#define bFM0P_MFT_PPG_PPGC4_PIE                *((volatile unsigned int*)(0x4248483CUL))
#define bFM0P_MFT_PPG_PPGC7_TTRG               *((volatile unsigned int*)(0x42484880UL))
#define bFM0P_MFT_PPG_PPGC7_MD0                *((volatile unsigned int*)(0x42484884UL))
#define bFM0P_MFT_PPG_PPGC7_MD1                *((volatile unsigned int*)(0x42484888UL))
#define bFM0P_MFT_PPG_PPGC7_PCS0               *((volatile unsigned int*)(0x4248488CUL))
#define bFM0P_MFT_PPG_PPGC7_PCS1               *((volatile unsigned int*)(0x42484890UL))
#define bFM0P_MFT_PPG_PPGC7_INTM               *((volatile unsigned int*)(0x42484894UL))
#define bFM0P_MFT_PPG_PPGC7_PUF                *((volatile unsigned int*)(0x42484898UL))
#define bFM0P_MFT_PPG_PPGC7_PIE                *((volatile unsigned int*)(0x4248489CUL))
#define bFM0P_MFT_PPG_PPGC6_TTRG               *((volatile unsigned int*)(0x424848A0UL))
#define bFM0P_MFT_PPG_PPGC6_MD0                *((volatile unsigned int*)(0x424848A4UL))
#define bFM0P_MFT_PPG_PPGC6_MD1                *((volatile unsigned int*)(0x424848A8UL))
#define bFM0P_MFT_PPG_PPGC6_PCS0               *((volatile unsigned int*)(0x424848ACUL))
#define bFM0P_MFT_PPG_PPGC6_PCS1               *((volatile unsigned int*)(0x424848B0UL))
#define bFM0P_MFT_PPG_PPGC6_INTM               *((volatile unsigned int*)(0x424848B4UL))
#define bFM0P_MFT_PPG_PPGC6_PUF                *((volatile unsigned int*)(0x424848B8UL))
#define bFM0P_MFT_PPG_PPGC6_PIE                *((volatile unsigned int*)(0x424848BCUL))
#define bFM0P_MFT_PPG_PRLL4_PRLL0              *((volatile unsigned int*)(0x42484900UL))
#define bFM0P_MFT_PPG_PRLL4_PRLL1              *((volatile unsigned int*)(0x42484904UL))
#define bFM0P_MFT_PPG_PRLL4_PRLL2              *((volatile unsigned int*)(0x42484908UL))
#define bFM0P_MFT_PPG_PRLL4_PRLL3              *((volatile unsigned int*)(0x4248490CUL))
#define bFM0P_MFT_PPG_PRLL4_PRLL4              *((volatile unsigned int*)(0x42484910UL))
#define bFM0P_MFT_PPG_PRLL4_PRLL5              *((volatile unsigned int*)(0x42484914UL))
#define bFM0P_MFT_PPG_PRLL4_PRLL6              *((volatile unsigned int*)(0x42484918UL))
#define bFM0P_MFT_PPG_PRLL4_PRLL7              *((volatile unsigned int*)(0x4248491CUL))
#define bFM0P_MFT_PPG_PRLH4_PRLH0              *((volatile unsigned int*)(0x42484920UL))
#define bFM0P_MFT_PPG_PRLH4_PRLH1              *((volatile unsigned int*)(0x42484924UL))
#define bFM0P_MFT_PPG_PRLH4_PRLH2              *((volatile unsigned int*)(0x42484928UL))
#define bFM0P_MFT_PPG_PRLH4_PRLH3              *((volatile unsigned int*)(0x4248492CUL))
#define bFM0P_MFT_PPG_PRLH4_PRLH4              *((volatile unsigned int*)(0x42484930UL))
#define bFM0P_MFT_PPG_PRLH4_PRLH5              *((volatile unsigned int*)(0x42484934UL))
#define bFM0P_MFT_PPG_PRLH4_PRLH6              *((volatile unsigned int*)(0x42484938UL))
#define bFM0P_MFT_PPG_PRLH4_PRLH7              *((volatile unsigned int*)(0x4248493CUL))
#define bFM0P_MFT_PPG_PRLL5_PRLL0              *((volatile unsigned int*)(0x42484980UL))
#define bFM0P_MFT_PPG_PRLL5_PRLL1              *((volatile unsigned int*)(0x42484984UL))
#define bFM0P_MFT_PPG_PRLL5_PRLL2              *((volatile unsigned int*)(0x42484988UL))
#define bFM0P_MFT_PPG_PRLL5_PRLL3              *((volatile unsigned int*)(0x4248498CUL))
#define bFM0P_MFT_PPG_PRLL5_PRLL4              *((volatile unsigned int*)(0x42484990UL))
#define bFM0P_MFT_PPG_PRLL5_PRLL5              *((volatile unsigned int*)(0x42484994UL))
#define bFM0P_MFT_PPG_PRLL5_PRLL6              *((volatile unsigned int*)(0x42484998UL))
#define bFM0P_MFT_PPG_PRLL5_PRLL7              *((volatile unsigned int*)(0x4248499CUL))
#define bFM0P_MFT_PPG_PRLH5_PRLH0              *((volatile unsigned int*)(0x424849A0UL))
#define bFM0P_MFT_PPG_PRLH5_PRLH1              *((volatile unsigned int*)(0x424849A4UL))
#define bFM0P_MFT_PPG_PRLH5_PRLH2              *((volatile unsigned int*)(0x424849A8UL))
#define bFM0P_MFT_PPG_PRLH5_PRLH3              *((volatile unsigned int*)(0x424849ACUL))
#define bFM0P_MFT_PPG_PRLH5_PRLH4              *((volatile unsigned int*)(0x424849B0UL))
#define bFM0P_MFT_PPG_PRLH5_PRLH5              *((volatile unsigned int*)(0x424849B4UL))
#define bFM0P_MFT_PPG_PRLH5_PRLH6              *((volatile unsigned int*)(0x424849B8UL))
#define bFM0P_MFT_PPG_PRLH5_PRLH7              *((volatile unsigned int*)(0x424849BCUL))
#define bFM0P_MFT_PPG_PRLL6_PRLL0              *((volatile unsigned int*)(0x42484A00UL))
#define bFM0P_MFT_PPG_PRLL6_PRLL1              *((volatile unsigned int*)(0x42484A04UL))
#define bFM0P_MFT_PPG_PRLL6_PRLL2              *((volatile unsigned int*)(0x42484A08UL))
#define bFM0P_MFT_PPG_PRLL6_PRLL3              *((volatile unsigned int*)(0x42484A0CUL))
#define bFM0P_MFT_PPG_PRLL6_PRLL4              *((volatile unsigned int*)(0x42484A10UL))
#define bFM0P_MFT_PPG_PRLL6_PRLL5              *((volatile unsigned int*)(0x42484A14UL))
#define bFM0P_MFT_PPG_PRLL6_PRLL6              *((volatile unsigned int*)(0x42484A18UL))
#define bFM0P_MFT_PPG_PRLL6_PRLL7              *((volatile unsigned int*)(0x42484A1CUL))
#define bFM0P_MFT_PPG_PRLH6_PRLH0              *((volatile unsigned int*)(0x42484A20UL))
#define bFM0P_MFT_PPG_PRLH6_PRLH1              *((volatile unsigned int*)(0x42484A24UL))
#define bFM0P_MFT_PPG_PRLH6_PRLH2              *((volatile unsigned int*)(0x42484A28UL))
#define bFM0P_MFT_PPG_PRLH6_PRLH3              *((volatile unsigned int*)(0x42484A2CUL))
#define bFM0P_MFT_PPG_PRLH6_PRLH4              *((volatile unsigned int*)(0x42484A30UL))
#define bFM0P_MFT_PPG_PRLH6_PRLH5              *((volatile unsigned int*)(0x42484A34UL))
#define bFM0P_MFT_PPG_PRLH6_PRLH6              *((volatile unsigned int*)(0x42484A38UL))
#define bFM0P_MFT_PPG_PRLH6_PRLH7              *((volatile unsigned int*)(0x42484A3CUL))
#define bFM0P_MFT_PPG_PRLL7_PRLL0              *((volatile unsigned int*)(0x42484A80UL))
#define bFM0P_MFT_PPG_PRLL7_PRLL1              *((volatile unsigned int*)(0x42484A84UL))
#define bFM0P_MFT_PPG_PRLL7_PRLL2              *((volatile unsigned int*)(0x42484A88UL))
#define bFM0P_MFT_PPG_PRLL7_PRLL3              *((volatile unsigned int*)(0x42484A8CUL))
#define bFM0P_MFT_PPG_PRLL7_PRLL4              *((volatile unsigned int*)(0x42484A90UL))
#define bFM0P_MFT_PPG_PRLL7_PRLL5              *((volatile unsigned int*)(0x42484A94UL))
#define bFM0P_MFT_PPG_PRLL7_PRLL6              *((volatile unsigned int*)(0x42484A98UL))
#define bFM0P_MFT_PPG_PRLL7_PRLL7              *((volatile unsigned int*)(0x42484A9CUL))
#define bFM0P_MFT_PPG_PRLH7_PRLH0              *((volatile unsigned int*)(0x42484AA0UL))
#define bFM0P_MFT_PPG_PRLH7_PRLH1              *((volatile unsigned int*)(0x42484AA4UL))
#define bFM0P_MFT_PPG_PRLH7_PRLH2              *((volatile unsigned int*)(0x42484AA8UL))
#define bFM0P_MFT_PPG_PRLH7_PRLH3              *((volatile unsigned int*)(0x42484AACUL))
#define bFM0P_MFT_PPG_PRLH7_PRLH4              *((volatile unsigned int*)(0x42484AB0UL))
#define bFM0P_MFT_PPG_PRLH7_PRLH5              *((volatile unsigned int*)(0x42484AB4UL))
