furjie/Single-BLDC-driver-and-app/s6e1a1.h
#define bFM0P_MFT_PPG_PRLH7_PRLH6              *((volatile unsigned int*)(0x42484AB8UL))
#define bFM0P_MFT_PPG_PRLH7_PRLH7              *((volatile unsigned int*)(0x42484ABCUL))
#define bFM0P_MFT_PPG_GATEC4_EDGE4             *((volatile unsigned int*)(0x42484B00UL))
#define bFM0P_MFT_PPG_GATEC4_STRG4             *((volatile unsigned int*)(0x42484B04UL))
#define bFM0P_MFT_PPG_GATEC4_EDGE6             *((volatile unsigned int*)(0x42484B10UL))
#define bFM0P_MFT_PPG_GATEC4_STRG6             *((volatile unsigned int*)(0x42484B14UL))
#define bFM0P_MFT_PPG_PPGC9_TTRG               *((volatile unsigned int*)(0x42485000UL))
#define bFM0P_MFT_PPG_PPGC9_MD0                *((volatile unsigned int*)(0x42485004UL))
#define bFM0P_MFT_PPG_PPGC9_MD1                *((volatile unsigned int*)(0x42485008UL))
#define bFM0P_MFT_PPG_PPGC9_PCS0               *((volatile unsigned int*)(0x4248500CUL))
#define bFM0P_MFT_PPG_PPGC9_PCS1               *((volatile unsigned int*)(0x42485010UL))
#define bFM0P_MFT_PPG_PPGC9_INTM               *((volatile unsigned int*)(0x42485014UL))
#define bFM0P_MFT_PPG_PPGC9_PUF                *((volatile unsigned int*)(0x42485018UL))
#define bFM0P_MFT_PPG_PPGC9_PIE                *((volatile unsigned int*)(0x4248501CUL))
#define bFM0P_MFT_PPG_PPGC8_TTRG               *((volatile unsigned int*)(0x42485020UL))
#define bFM0P_MFT_PPG_PPGC8_MD0                *((volatile unsigned int*)(0x42485024UL))
#define bFM0P_MFT_PPG_PPGC8_MD1                *((volatile unsigned int*)(0x42485028UL))
#define bFM0P_MFT_PPG_PPGC8_PCS0               *((volatile unsigned int*)(0x4248502CUL))
#define bFM0P_MFT_PPG_PPGC8_PCS1               *((volatile unsigned int*)(0x42485030UL))
#define bFM0P_MFT_PPG_PPGC8_INTM               *((volatile unsigned int*)(0x42485034UL))
#define bFM0P_MFT_PPG_PPGC8_PUF                *((volatile unsigned int*)(0x42485038UL))
#define bFM0P_MFT_PPG_PPGC8_PIE                *((volatile unsigned int*)(0x4248503CUL))
#define bFM0P_MFT_PPG_PPGC11_TTRG              *((volatile unsigned int*)(0x42485080UL))
#define bFM0P_MFT_PPG_PPGC11_MD0               *((volatile unsigned int*)(0x42485084UL))
#define bFM0P_MFT_PPG_PPGC11_MD1               *((volatile unsigned int*)(0x42485088UL))
#define bFM0P_MFT_PPG_PPGC11_PCS0              *((volatile unsigned int*)(0x4248508CUL))
#define bFM0P_MFT_PPG_PPGC11_PCS1              *((volatile unsigned int*)(0x42485090UL))
#define bFM0P_MFT_PPG_PPGC11_INTM              *((volatile unsigned int*)(0x42485094UL))
#define bFM0P_MFT_PPG_PPGC11_PUF               *((volatile unsigned int*)(0x42485098UL))
#define bFM0P_MFT_PPG_PPGC11_PIE               *((volatile unsigned int*)(0x4248509CUL))
#define bFM0P_MFT_PPG_PPGC10_TTRG              *((volatile unsigned int*)(0x424850A0UL))
#define bFM0P_MFT_PPG_PPGC10_MD0               *((volatile unsigned int*)(0x424850A4UL))
#define bFM0P_MFT_PPG_PPGC10_MD1               *((volatile unsigned int*)(0x424850A8UL))
#define bFM0P_MFT_PPG_PPGC10_PCS0              *((volatile unsigned int*)(0x424850ACUL))
#define bFM0P_MFT_PPG_PPGC10_PCS1              *((volatile unsigned int*)(0x424850B0UL))
#define bFM0P_MFT_PPG_PPGC10_INTM              *((volatile unsigned int*)(0x424850B4UL))
#define bFM0P_MFT_PPG_PPGC10_PUF               *((volatile unsigned int*)(0x424850B8UL))
#define bFM0P_MFT_PPG_PPGC10_PIE               *((volatile unsigned int*)(0x424850BCUL))
#define bFM0P_MFT_PPG_PRLL8_PRLL0              *((volatile unsigned int*)(0x42485100UL))
#define bFM0P_MFT_PPG_PRLL8_PRLL1              *((volatile unsigned int*)(0x42485104UL))
#define bFM0P_MFT_PPG_PRLL8_PRLL2              *((volatile unsigned int*)(0x42485108UL))
#define bFM0P_MFT_PPG_PRLL8_PRLL3              *((volatile unsigned int*)(0x4248510CUL))
#define bFM0P_MFT_PPG_PRLL8_PRLL4              *((volatile unsigned int*)(0x42485110UL))
#define bFM0P_MFT_PPG_PRLL8_PRLL5              *((volatile unsigned int*)(0x42485114UL))
#define bFM0P_MFT_PPG_PRLL8_PRLL6              *((volatile unsigned int*)(0x42485118UL))
#define bFM0P_MFT_PPG_PRLL8_PRLL7              *((volatile unsigned int*)(0x4248511CUL))
#define bFM0P_MFT_PPG_PRLH8_PRLH0              *((volatile unsigned int*)(0x42485120UL))
#define bFM0P_MFT_PPG_PRLH8_PRLH1              *((volatile unsigned int*)(0x42485124UL))
#define bFM0P_MFT_PPG_PRLH8_PRLH2              *((volatile unsigned int*)(0x42485128UL))
#define bFM0P_MFT_PPG_PRLH8_PRLH3              *((volatile unsigned int*)(0x4248512CUL))
#define bFM0P_MFT_PPG_PRLH8_PRLH4              *((volatile unsigned int*)(0x42485130UL))
#define bFM0P_MFT_PPG_PRLH8_PRLH5              *((volatile unsigned int*)(0x42485134UL))
#define bFM0P_MFT_PPG_PRLH8_PRLH6              *((volatile unsigned int*)(0x42485138UL))
#define bFM0P_MFT_PPG_PRLH8_PRLH7              *((volatile unsigned int*)(0x4248513CUL))
#define bFM0P_MFT_PPG_PRLL9_PRLL0              *((volatile unsigned int*)(0x42485180UL))
#define bFM0P_MFT_PPG_PRLL9_PRLL1              *((volatile unsigned int*)(0x42485184UL))
#define bFM0P_MFT_PPG_PRLL9_PRLL2              *((volatile unsigned int*)(0x42485188UL))
#define bFM0P_MFT_PPG_PRLL9_PRLL3              *((volatile unsigned int*)(0x4248518CUL))
#define bFM0P_MFT_PPG_PRLL9_PRLL4              *((volatile unsigned int*)(0x42485190UL))
#define bFM0P_MFT_PPG_PRLL9_PRLL5              *((volatile unsigned int*)(0x42485194UL))
#define bFM0P_MFT_PPG_PRLL9_PRLL6              *((volatile unsigned int*)(0x42485198UL))
#define bFM0P_MFT_PPG_PRLL9_PRLL7              *((volatile unsigned int*)(0x4248519CUL))
#define bFM0P_MFT_PPG_PRLH9_PRLH0              *((volatile unsigned int*)(0x424851A0UL))
#define bFM0P_MFT_PPG_PRLH9_PRLH1              *((volatile unsigned int*)(0x424851A4UL))
#define bFM0P_MFT_PPG_PRLH9_PRLH2              *((volatile unsigned int*)(0x424851A8UL))
#define bFM0P_MFT_PPG_PRLH9_PRLH3              *((volatile unsigned int*)(0x424851ACUL))
#define bFM0P_MFT_PPG_PRLH9_PRLH4              *((volatile unsigned int*)(0x424851B0UL))
#define bFM0P_MFT_PPG_PRLH9_PRLH5              *((volatile unsigned int*)(0x424851B4UL))
#define bFM0P_MFT_PPG_PRLH9_PRLH6              *((volatile unsigned int*)(0x424851B8UL))
#define bFM0P_MFT_PPG_PRLH9_PRLH7              *((volatile unsigned int*)(0x424851BCUL))
#define bFM0P_MFT_PPG_PRLL10_PRLL0             *((volatile unsigned int*)(0x42485200UL))
#define bFM0P_MFT_PPG_PRLL10_PRLL1             *((volatile unsigned int*)(0x42485204UL))
#define bFM0P_MFT_PPG_PRLL10_PRLL2             *((volatile unsigned int*)(0x42485208UL))
#define bFM0P_MFT_PPG_PRLL10_PRLL3             *((volatile unsigned int*)(0x4248520CUL))
#define bFM0P_MFT_PPG_PRLL10_PRLL4             *((volatile unsigned int*)(0x42485210UL))
#define bFM0P_MFT_PPG_PRLL10_PRLL5             *((volatile unsigned int*)(0x42485214UL))
#define bFM0P_MFT_PPG_PRLL10_PRLL6             *((volatile unsigned int*)(0x42485218UL))
#define bFM0P_MFT_PPG_PRLL10_PRLL7             *((volatile unsigned int*)(0x4248521CUL))
#define bFM0P_MFT_PPG_PRLH10_PRLH0             *((volatile unsigned int*)(0x42485220UL))
#define bFM0P_MFT_PPG_PRLH10_PRLH1             *((volatile unsigned int*)(0x42485224UL))
#define bFM0P_MFT_PPG_PRLH10_PRLH2             *((volatile unsigned int*)(0x42485228UL))
#define bFM0P_MFT_PPG_PRLH10_PRLH3             *((volatile unsigned int*)(0x4248522CUL))
#define bFM0P_MFT_PPG_PRLH10_PRLH4             *((volatile unsigned int*)(0x42485230UL))
#define bFM0P_MFT_PPG_PRLH10_PRLH5             *((volatile unsigned int*)(0x42485234UL))
#define bFM0P_MFT_PPG_PRLH10_PRLH6             *((volatile unsigned int*)(0x42485238UL))
#define bFM0P_MFT_PPG_PRLH10_PRLH7             *((volatile unsigned int*)(0x4248523CUL))
#define bFM0P_MFT_PPG_PRLL11_PRLL0             *((volatile unsigned int*)(0x42485280UL))
#define bFM0P_MFT_PPG_PRLL11_PRLL1             *((volatile unsigned int*)(0x42485284UL))
#define bFM0P_MFT_PPG_PRLL11_PRLL2             *((volatile unsigned int*)(0x42485288UL))
#define bFM0P_MFT_PPG_PRLL11_PRLL3             *((volatile unsigned int*)(0x4248528CUL))
#define bFM0P_MFT_PPG_PRLL11_PRLL4             *((volatile unsigned int*)(0x42485290UL))
#define bFM0P_MFT_PPG_PRLL11_PRLL5             *((volatile unsigned int*)(0x42485294UL))
#define bFM0P_MFT_PPG_PRLL11_PRLL6             *((volatile unsigned int*)(0x42485298UL))
#define bFM0P_MFT_PPG_PRLL11_PRLL7             *((volatile unsigned int*)(0x4248529CUL))
#define bFM0P_MFT_PPG_PRLH11_PRLH0             *((volatile unsigned int*)(0x424852A0UL))
#define bFM0P_MFT_PPG_PRLH11_PRLH1             *((volatile unsigned int*)(0x424852A4UL))
#define bFM0P_MFT_PPG_PRLH11_PRLH2             *((volatile unsigned int*)(0x424852A8UL))
#define bFM0P_MFT_PPG_PRLH11_PRLH3             *((volatile unsigned int*)(0x424852ACUL))
#define bFM0P_MFT_PPG_PRLH11_PRLH4             *((volatile unsigned int*)(0x424852B0UL))
#define bFM0P_MFT_PPG_PRLH11_PRLH5             *((volatile unsigned int*)(0x424852B4UL))
#define bFM0P_MFT_PPG_PRLH11_PRLH6             *((volatile unsigned int*)(0x424852B8UL))
#define bFM0P_MFT_PPG_PRLH11_PRLH7             *((volatile unsigned int*)(0x424852BCUL))
#define bFM0P_MFT_PPG_GATEC8_EDGE8             *((volatile unsigned int*)(0x42485300UL))
#define bFM0P_MFT_PPG_GATEC8_STRG8             *((volatile unsigned int*)(0x42485304UL))
#define bFM0P_MFT_PPG_GATEC8_EDGE10            *((volatile unsigned int*)(0x42485310UL))
#define bFM0P_MFT_PPG_GATEC8_STRG10            *((volatile unsigned int*)(0x42485314UL))
#define bFM0P_MFT_PPG_PPGC13_TTRG              *((volatile unsigned int*)(0x42485800UL))
#define bFM0P_MFT_PPG_PPGC13_MD0               *((volatile unsigned int*)(0x42485804UL))
#define bFM0P_MFT_PPG_PPGC13_MD1               *((volatile unsigned int*)(0x42485808UL))
#define bFM0P_MFT_PPG_PPGC13_PCS0              *((volatile unsigned int*)(0x4248580CUL))
#define bFM0P_MFT_PPG_PPGC13_PCS1              *((volatile unsigned int*)(0x42485810UL))
#define bFM0P_MFT_PPG_PPGC13_INTM              *((volatile unsigned int*)(0x42485814UL))
#define bFM0P_MFT_PPG_PPGC13_PUF               *((volatile unsigned int*)(0x42485818UL))
#define bFM0P_MFT_PPG_PPGC13_PIE               *((volatile unsigned int*)(0x4248581CUL))
#define bFM0P_MFT_PPG_PPGC12_TTRG              *((volatile unsigned int*)(0x42485820UL))
#define bFM0P_MFT_PPG_PPGC12_MD0               *((volatile unsigned int*)(0x42485824UL))
#define bFM0P_MFT_PPG_PPGC12_MD1               *((volatile unsigned int*)(0x42485828UL))
#define bFM0P_MFT_PPG_PPGC12_PCS0              *((volatile unsigned int*)(0x4248582CUL))
#define bFM0P_MFT_PPG_PPGC12_PCS1              *((volatile unsigned int*)(0x42485830UL))
#define bFM0P_MFT_PPG_PPGC12_INTM              *((volatile unsigned int*)(0x42485834UL))
#define bFM0P_MFT_PPG_PPGC12_PUF               *((volatile unsigned int*)(0x42485838UL))
#define bFM0P_MFT_PPG_PPGC12_PIE               *((volatile unsigned int*)(0x4248583CUL))
#define bFM0P_MFT_PPG_PPGC15_TTRG              *((volatile unsigned int*)(0x42485880UL))
#define bFM0P_MFT_PPG_PPGC15_MD0               *((volatile unsigned int*)(0x42485884UL))
#define bFM0P_MFT_PPG_PPGC15_MD1               *((volatile unsigned int*)(0x42485888UL))
#define bFM0P_MFT_PPG_PPGC15_PCS0              *((volatile unsigned int*)(0x4248588CUL))
#define bFM0P_MFT_PPG_PPGC15_PCS1              *((volatile unsigned int*)(0x42485890UL))
#define bFM0P_MFT_PPG_PPGC15_INTM              *((volatile unsigned int*)(0x42485894UL))
#define bFM0P_MFT_PPG_PPGC15_PUF               *((volatile unsigned int*)(0x42485898UL))
#define bFM0P_MFT_PPG_PPGC15_PIE               *((volatile unsigned int*)(0x4248589CUL))
#define bFM0P_MFT_PPG_PPGC14_TTRG              *((volatile unsigned int*)(0x424858A0UL))
#define bFM0P_MFT_PPG_PPGC14_MD0               *((volatile unsigned int*)(0x424858A4UL))
#define bFM0P_MFT_PPG_PPGC14_MD1               *((volatile unsigned int*)(0x424858A8UL))
#define bFM0P_MFT_PPG_PPGC14_PCS0              *((volatile unsigned int*)(0x424858ACUL))
#define bFM0P_MFT_PPG_PPGC14_PCS1              *((volatile unsigned int*)(0x424858B0UL))
#define bFM0P_MFT_PPG_PPGC14_INTM              *((volatile unsigned int*)(0x424858B4UL))
#define bFM0P_MFT_PPG_PPGC14_PUF               *((volatile unsigned int*)(0x424858B8UL))
#define bFM0P_MFT_PPG_PPGC14_PIE               *((volatile unsigned int*)(0x424858BCUL))
#define bFM0P_MFT_PPG_PRLL12_PRLL0             *((volatile unsigned int*)(0x42485900UL))
#define bFM0P_MFT_PPG_PRLL12_PRLL1             *((volatile unsigned int*)(0x42485904UL))
#define bFM0P_MFT_PPG_PRLL12_PRLL2             *((volatile unsigned int*)(0x42485908UL))
#define bFM0P_MFT_PPG_PRLL12_PRLL3             *((volatile unsigned int*)(0x4248590CUL))
#define bFM0P_MFT_PPG_PRLL12_PRLL4             *((volatile unsigned int*)(0x42485910UL))
#define bFM0P_MFT_PPG_PRLL12_PRLL5             *((volatile unsigned int*)(0x42485914UL))
#define bFM0P_MFT_PPG_PRLL12_PRLL6             *((volatile unsigned int*)(0x42485918UL))
#define bFM0P_MFT_PPG_PRLL12_PRLL7             *((volatile unsigned int*)(0x4248591CUL))
#define bFM0P_MFT_PPG_PRLH12_PRLH0             *((volatile unsigned int*)(0x42485920UL))
#define bFM0P_MFT_PPG_PRLH12_PRLH1             *((volatile unsigned int*)(0x42485924UL))
#define bFM0P_MFT_PPG_PRLH12_PRLH2             *((volatile unsigned int*)(0x42485928UL))
#define bFM0P_MFT_PPG_PRLH12_PRLH3             *((volatile unsigned int*)(0x4248592CUL))
#define bFM0P_MFT_PPG_PRLH12_PRLH4             *((volatile unsigned int*)(0x42485930UL))
#define bFM0P_MFT_PPG_PRLH12_PRLH5             *((volatile unsigned int*)(0x42485934UL))
#define bFM0P_MFT_PPG_PRLH12_PRLH6             *((volatile unsigned int*)(0x42485938UL))
#define bFM0P_MFT_PPG_PRLH12_PRLH7             *((volatile unsigned int*)(0x4248593CUL))
#define bFM0P_MFT_PPG_PRLL13_PRLL0             *((volatile unsigned int*)(0x42485980UL))
#define bFM0P_MFT_PPG_PRLL13_PRLL1             *((volatile unsigned int*)(0x42485984UL))
#define bFM0P_MFT_PPG_PRLL13_PRLL2             *((volatile unsigned int*)(0x42485988UL))
#define bFM0P_MFT_PPG_PRLL13_PRLL3             *((volatile unsigned int*)(0x4248598CUL))
#define bFM0P_MFT_PPG_PRLL13_PRLL4             *((volatile unsigned int*)(0x42485990UL))
#define bFM0P_MFT_PPG_PRLL13_PRLL5             *((volatile unsigned int*)(0x42485994UL))
#define bFM0P_MFT_PPG_PRLL13_PRLL6             *((volatile unsigned int*)(0x42485998UL))
#define bFM0P_MFT_PPG_PRLL13_PRLL7             *((volatile unsigned int*)(0x4248599CUL))
#define bFM0P_MFT_PPG_PRLH13_PRLH0             *((volatile unsigned int*)(0x424859A0UL))
#define bFM0P_MFT_PPG_PRLH13_PRLH1             *((volatile unsigned int*)(0x424859A4UL))
#define bFM0P_MFT_PPG_PRLH13_PRLH2             *((volatile unsigned int*)(0x424859A8UL))
#define bFM0P_MFT_PPG_PRLH13_PRLH3             *((volatile unsigned int*)(0x424859ACUL))
#define bFM0P_MFT_PPG_PRLH13_PRLH4             *((volatile unsigned int*)(0x424859B0UL))
#define bFM0P_MFT_PPG_PRLH13_PRLH5             *((volatile unsigned int*)(0x424859B4UL))
#define bFM0P_MFT_PPG_PRLH13_PRLH6             *((volatile unsigned int*)(0x424859B8UL))
#define bFM0P_MFT_PPG_PRLH13_PRLH7             *((volatile unsigned int*)(0x424859BCUL))
#define bFM0P_MFT_PPG_PRLL14_PRLL0             *((volatile unsigned int*)(0x42485A00UL))
#define bFM0P_MFT_PPG_PRLL14_PRLL1             *((volatile unsigned int*)(0x42485A04UL))
#define bFM0P_MFT_PPG_PRLL14_PRLL2             *((volatile unsigned int*)(0x42485A08UL))
#define bFM0P_MFT_PPG_PRLL14_PRLL3             *((volatile unsigned int*)(0x42485A0CUL))
#define bFM0P_MFT_PPG_PRLL14_PRLL4             *((volatile unsigned int*)(0x42485A10UL))
#define bFM0P_MFT_PPG_PRLL14_PRLL5             *((volatile unsigned int*)(0x42485A14UL))
#define bFM0P_MFT_PPG_PRLL14_PRLL6             *((volatile unsigned int*)(0x42485A18UL))
#define bFM0P_MFT_PPG_PRLL14_PRLL7             *((volatile unsigned int*)(0x42485A1CUL))
#define bFM0P_MFT_PPG_PRLH14_PRLH0             *((volatile unsigned int*)(0x42485A20UL))
#define bFM0P_MFT_PPG_PRLH14_PRLH1             *((volatile unsigned int*)(0x42485A24UL))
#define bFM0P_MFT_PPG_PRLH14_PRLH2             *((volatile unsigned int*)(0x42485A28UL))
#define bFM0P_MFT_PPG_PRLH14_PRLH3             *((volatile unsigned int*)(0x42485A2CUL))
#define bFM0P_MFT_PPG_PRLH14_PRLH4             *((volatile unsigned int*)(0x42485A30UL))
#define bFM0P_MFT_PPG_PRLH14_PRLH5             *((volatile unsigned int*)(0x42485A34UL))
#define bFM0P_MFT_PPG_PRLH14_PRLH6             *((volatile unsigned int*)(0x42485A38UL))
#define bFM0P_MFT_PPG_PRLH14_PRLH7             *((volatile unsigned int*)(0x42485A3CUL))
#define bFM0P_MFT_PPG_PRLL15_PRLL0             *((volatile unsigned int*)(0x42485A80UL))
#define bFM0P_MFT_PPG_PRLL15_PRLL1             *((volatile unsigned int*)(0x42485A84UL))
#define bFM0P_MFT_PPG_PRLL15_PRLL2             *((volatile unsigned int*)(0x42485A88UL))
#define bFM0P_MFT_PPG_PRLL15_PRLL3             *((volatile unsigned int*)(0x42485A8CUL))
#define bFM0P_MFT_PPG_PRLL15_PRLL4             *((volatile unsigned int*)(0x42485A90UL))
#define bFM0P_MFT_PPG_PRLL15_PRLL5             *((volatile unsigned int*)(0x42485A94UL))
#define bFM0P_MFT_PPG_PRLL15_PRLL6             *((volatile unsigned int*)(0x42485A98UL))
#define bFM0P_MFT_PPG_PRLL15_PRLL7             *((volatile unsigned int*)(0x42485A9CUL))
#define bFM0P_MFT_PPG_PRLH15_PRLH0             *((volatile unsigned int*)(0x42485AA0UL))
#define bFM0P_MFT_PPG_PRLH15_PRLH1             *((volatile unsigned int*)(0x42485AA4UL))
#define bFM0P_MFT_PPG_PRLH15_PRLH2             *((volatile unsigned int*)(0x42485AA8UL))
#define bFM0P_MFT_PPG_PRLH15_PRLH3             *((volatile unsigned int*)(0x42485AACUL))
#define bFM0P_MFT_PPG_PRLH15_PRLH4             *((volatile unsigned int*)(0x42485AB0UL))
#define bFM0P_MFT_PPG_PRLH15_PRLH5             *((volatile unsigned int*)(0x42485AB4UL))
#define bFM0P_MFT_PPG_PRLH15_PRLH6             *((volatile unsigned int*)(0x42485AB8UL))
#define bFM0P_MFT_PPG_PRLH15_PRLH7             *((volatile unsigned int*)(0x42485ABCUL))
#define bFM0P_MFT_PPG_GATEC12_EDGE12           *((volatile unsigned int*)(0x42485B00UL))
#define bFM0P_MFT_PPG_GATEC12_STRG12           *((volatile unsigned int*)(0x42485B04UL))
#define bFM0P_MFT_PPG_GATEC12_EDGE14           *((volatile unsigned int*)(0x42485B10UL))
#define bFM0P_MFT_PPG_GATEC12_STRG14           *((volatile unsigned int*)(0x42485B14UL))
#define bFM0P_MFT_PPG_PPGC17_TTRG              *((volatile unsigned int*)(0x42486000UL))
#define bFM0P_MFT_PPG_PPGC17_MD0               *((volatile unsigned int*)(0x42486004UL))
#define bFM0P_MFT_PPG_PPGC17_MD1               *((volatile unsigned int*)(0x42486008UL))
#define bFM0P_MFT_PPG_PPGC17_PCS0              *((volatile unsigned int*)(0x4248600CUL))
#define bFM0P_MFT_PPG_PPGC17_PCS1              *((volatile unsigned int*)(0x42486010UL))
#define bFM0P_MFT_PPG_PPGC17_INTM              *((volatile unsigned int*)(0x42486014UL))
#define bFM0P_MFT_PPG_PPGC17_PUF               *((volatile unsigned int*)(0x42486018UL))
#define bFM0P_MFT_PPG_PPGC17_PIE               *((volatile unsigned int*)(0x4248601CUL))
#define bFM0P_MFT_PPG_PPGC16_TTRG              *((volatile unsigned int*)(0x42486020UL))
#define bFM0P_MFT_PPG_PPGC16_MD0               *((volatile unsigned int*)(0x42486024UL))
#define bFM0P_MFT_PPG_PPGC16_MD1               *((volatile unsigned int*)(0x42486028UL))
#define bFM0P_MFT_PPG_PPGC16_PCS0              *((volatile unsigned int*)(0x4248602CUL))
#define bFM0P_MFT_PPG_PPGC16_PCS1              *((volatile unsigned int*)(0x42486030UL))
#define bFM0P_MFT_PPG_PPGC16_INTM              *((volatile unsigned int*)(0x42486034UL))
#define bFM0P_MFT_PPG_PPGC16_PUF               *((volatile unsigned int*)(0x42486038UL))
#define bFM0P_MFT_PPG_PPGC16_PIE               *((volatile unsigned int*)(0x4248603CUL))
#define bFM0P_MFT_PPG_PPGC19_TTRG              *((volatile unsigned int*)(0x42486080UL))
#define bFM0P_MFT_PPG_PPGC19_MD0               *((volatile unsigned int*)(0x42486084UL))
#define bFM0P_MFT_PPG_PPGC19_MD1               *((volatile unsigned int*)(0x42486088UL))
#define bFM0P_MFT_PPG_PPGC19_PCS0              *((volatile unsigned int*)(0x4248608CUL))
#define bFM0P_MFT_PPG_PPGC19_PCS1              *((volatile unsigned int*)(0x42486090UL))
#define bFM0P_MFT_PPG_PPGC19_INTM              *((volatile unsigned int*)(0x42486094UL))
#define bFM0P_MFT_PPG_PPGC19_PUF               *((volatile unsigned int*)(0x42486098UL))
#define bFM0P_MFT_PPG_PPGC19_PIE               *((volatile unsigned int*)(0x4248609CUL))
#define bFM0P_MFT_PPG_PPGC18_TTRG              *((volatile unsigned int*)(0x424860A0UL))
#define bFM0P_MFT_PPG_PPGC18_MD0               *((volatile unsigned int*)(0x424860A4UL))
#define bFM0P_MFT_PPG_PPGC18_MD1               *((volatile unsigned int*)(0x424860A8UL))
#define bFM0P_MFT_PPG_PPGC18_PCS0              *((volatile unsigned int*)(0x424860ACUL))
#define bFM0P_MFT_PPG_PPGC18_PCS1              *((volatile unsigned int*)(0x424860B0UL))
#define bFM0P_MFT_PPG_PPGC18_INTM              *((volatile unsigned int*)(0x424860B4UL))
#define bFM0P_MFT_PPG_PPGC18_PUF               *((volatile unsigned int*)(0x424860B8UL))
#define bFM0P_MFT_PPG_PPGC18_PIE               *((volatile unsigned int*)(0x424860BCUL))
#define bFM0P_MFT_PPG_PRLL16_PRLL0             *((volatile unsigned int*)(0x42486100UL))
#define bFM0P_MFT_PPG_PRLL16_PRLL1             *((volatile unsigned int*)(0x42486104UL))
#define bFM0P_MFT_PPG_PRLL16_PRLL2             *((volatile unsigned int*)(0x42486108UL))
#define bFM0P_MFT_PPG_PRLL16_PRLL3             *((volatile unsigned int*)(0x4248610CUL))
#define bFM0P_MFT_PPG_PRLL16_PRLL4             *((volatile unsigned int*)(0x42486110UL))
#define bFM0P_MFT_PPG_PRLL16_PRLL5             *((volatile unsigned int*)(0x42486114UL))
#define bFM0P_MFT_PPG_PRLL16_PRLL6             *((volatile unsigned int*)(0x42486118UL))
#define bFM0P_MFT_PPG_PRLL16_PRLL7             *((volatile unsigned int*)(0x4248611CUL))
#define bFM0P_MFT_PPG_PRLH16_PRLH0             *((volatile unsigned int*)(0x42486120UL))
#define bFM0P_MFT_PPG_PRLH16_PRLH1             *((volatile unsigned int*)(0x42486124UL))
#define bFM0P_MFT_PPG_PRLH16_PRLH2             *((volatile unsigned int*)(0x42486128UL))
#define bFM0P_MFT_PPG_PRLH16_PRLH3             *((volatile unsigned int*)(0x4248612CUL))
#define bFM0P_MFT_PPG_PRLH16_PRLH4             *((volatile unsigned int*)(0x42486130UL))
#define bFM0P_MFT_PPG_PRLH16_PRLH5             *((volatile unsigned int*)(0x42486134UL))
#define bFM0P_MFT_PPG_PRLH16_PRLH6             *((volatile unsigned int*)(0x42486138UL))
#define bFM0P_MFT_PPG_PRLH16_PRLH7             *((volatile unsigned int*)(0x4248613CUL))
#define bFM0P_MFT_PPG_PRLL17_PRLL0             *((volatile unsigned int*)(0x42486180UL))
#define bFM0P_MFT_PPG_PRLL17_PRLL1             *((volatile unsigned int*)(0x42486184UL))
#define bFM0P_MFT_PPG_PRLL17_PRLL2             *((volatile unsigned int*)(0x42486188UL))
#define bFM0P_MFT_PPG_PRLL17_PRLL3             *((volatile unsigned int*)(0x4248618CUL))
#define bFM0P_MFT_PPG_PRLL17_PRLL4             *((volatile unsigned int*)(0x42486190UL))
#define bFM0P_MFT_PPG_PRLL17_PRLL5             *((volatile unsigned int*)(0x42486194UL))
#define bFM0P_MFT_PPG_PRLL17_PRLL6             *((volatile unsigned int*)(0x42486198UL))
#define bFM0P_MFT_PPG_PRLL17_PRLL7             *((volatile unsigned int*)(0x4248619CUL))
#define bFM0P_MFT_PPG_PRLH17_PRLH0             *((volatile unsigned int*)(0x424861A0UL))
#define bFM0P_MFT_PPG_PRLH17_PRLH1             *((volatile unsigned int*)(0x424861A4UL))
#define bFM0P_MFT_PPG_PRLH17_PRLH2             *((volatile unsigned int*)(0x424861A8UL))
#define bFM0P_MFT_PPG_PRLH17_PRLH3             *((volatile unsigned int*)(0x424861ACUL))
