furjie/Single-BLDC-driver-and-app/s6e1a1.h
#define bFM0P_MFT_PPG_PRLH17_PRLH4             *((volatile unsigned int*)(0x424861B0UL))
#define bFM0P_MFT_PPG_PRLH17_PRLH5             *((volatile unsigned int*)(0x424861B4UL))
#define bFM0P_MFT_PPG_PRLH17_PRLH6             *((volatile unsigned int*)(0x424861B8UL))
#define bFM0P_MFT_PPG_PRLH17_PRLH7             *((volatile unsigned int*)(0x424861BCUL))
#define bFM0P_MFT_PPG_PRLL18_PRLL0             *((volatile unsigned int*)(0x42486200UL))
#define bFM0P_MFT_PPG_PRLL18_PRLL1             *((volatile unsigned int*)(0x42486204UL))
#define bFM0P_MFT_PPG_PRLL18_PRLL2             *((volatile unsigned int*)(0x42486208UL))
#define bFM0P_MFT_PPG_PRLL18_PRLL3             *((volatile unsigned int*)(0x4248620CUL))
#define bFM0P_MFT_PPG_PRLL18_PRLL4             *((volatile unsigned int*)(0x42486210UL))
#define bFM0P_MFT_PPG_PRLL18_PRLL5             *((volatile unsigned int*)(0x42486214UL))
#define bFM0P_MFT_PPG_PRLL18_PRLL6             *((volatile unsigned int*)(0x42486218UL))
#define bFM0P_MFT_PPG_PRLL18_PRLL7             *((volatile unsigned int*)(0x4248621CUL))
#define bFM0P_MFT_PPG_PRLH18_PRLH0             *((volatile unsigned int*)(0x42486220UL))
#define bFM0P_MFT_PPG_PRLH18_PRLH1             *((volatile unsigned int*)(0x42486224UL))
#define bFM0P_MFT_PPG_PRLH18_PRLH2             *((volatile unsigned int*)(0x42486228UL))
#define bFM0P_MFT_PPG_PRLH18_PRLH3             *((volatile unsigned int*)(0x4248622CUL))
#define bFM0P_MFT_PPG_PRLH18_PRLH4             *((volatile unsigned int*)(0x42486230UL))
#define bFM0P_MFT_PPG_PRLH18_PRLH5             *((volatile unsigned int*)(0x42486234UL))
#define bFM0P_MFT_PPG_PRLH18_PRLH6             *((volatile unsigned int*)(0x42486238UL))
#define bFM0P_MFT_PPG_PRLH18_PRLH7             *((volatile unsigned int*)(0x4248623CUL))
#define bFM0P_MFT_PPG_PRLL19_PRLL0             *((volatile unsigned int*)(0x42486280UL))
#define bFM0P_MFT_PPG_PRLL19_PRLL1             *((volatile unsigned int*)(0x42486284UL))
#define bFM0P_MFT_PPG_PRLL19_PRLL2             *((volatile unsigned int*)(0x42486288UL))
#define bFM0P_MFT_PPG_PRLL19_PRLL3             *((volatile unsigned int*)(0x4248628CUL))
#define bFM0P_MFT_PPG_PRLL19_PRLL4             *((volatile unsigned int*)(0x42486290UL))
#define bFM0P_MFT_PPG_PRLL19_PRLL5             *((volatile unsigned int*)(0x42486294UL))
#define bFM0P_MFT_PPG_PRLL19_PRLL6             *((volatile unsigned int*)(0x42486298UL))
#define bFM0P_MFT_PPG_PRLL19_PRLL7             *((volatile unsigned int*)(0x4248629CUL))
#define bFM0P_MFT_PPG_PRLH19_PRLH0             *((volatile unsigned int*)(0x424862A0UL))
#define bFM0P_MFT_PPG_PRLH19_PRLH1             *((volatile unsigned int*)(0x424862A4UL))
#define bFM0P_MFT_PPG_PRLH19_PRLH2             *((volatile unsigned int*)(0x424862A8UL))
#define bFM0P_MFT_PPG_PRLH19_PRLH3             *((volatile unsigned int*)(0x424862ACUL))
#define bFM0P_MFT_PPG_PRLH19_PRLH4             *((volatile unsigned int*)(0x424862B0UL))
#define bFM0P_MFT_PPG_PRLH19_PRLH5             *((volatile unsigned int*)(0x424862B4UL))
#define bFM0P_MFT_PPG_PRLH19_PRLH6             *((volatile unsigned int*)(0x424862B8UL))
#define bFM0P_MFT_PPG_PRLH19_PRLH7             *((volatile unsigned int*)(0x424862BCUL))
#define bFM0P_MFT_PPG_GATEC16_EDGE16           *((volatile unsigned int*)(0x42486300UL))
#define bFM0P_MFT_PPG_GATEC16_STRG16           *((volatile unsigned int*)(0x42486304UL))
#define bFM0P_MFT_PPG_GATEC16_EDGE18           *((volatile unsigned int*)(0x42486310UL))
#define bFM0P_MFT_PPG_GATEC16_STRG18           *((volatile unsigned int*)(0x42486314UL))
#define bFM0P_MFT_PPG_PPGC21_TTRG              *((volatile unsigned int*)(0x42486800UL))
#define bFM0P_MFT_PPG_PPGC21_MD0               *((volatile unsigned int*)(0x42486804UL))
#define bFM0P_MFT_PPG_PPGC21_MD1               *((volatile unsigned int*)(0x42486808UL))
#define bFM0P_MFT_PPG_PPGC21_PCS0              *((volatile unsigned int*)(0x4248680CUL))
#define bFM0P_MFT_PPG_PPGC21_PCS1              *((volatile unsigned int*)(0x42486810UL))
#define bFM0P_MFT_PPG_PPGC21_INTM              *((volatile unsigned int*)(0x42486814UL))
#define bFM0P_MFT_PPG_PPGC21_PUF               *((volatile unsigned int*)(0x42486818UL))
#define bFM0P_MFT_PPG_PPGC21_PIE               *((volatile unsigned int*)(0x4248681CUL))
#define bFM0P_MFT_PPG_PPGC20_TTRG              *((volatile unsigned int*)(0x42486820UL))
#define bFM0P_MFT_PPG_PPGC20_MD0               *((volatile unsigned int*)(0x42486824UL))
#define bFM0P_MFT_PPG_PPGC20_MD1               *((volatile unsigned int*)(0x42486828UL))
#define bFM0P_MFT_PPG_PPGC20_PCS0              *((volatile unsigned int*)(0x4248682CUL))
#define bFM0P_MFT_PPG_PPGC20_PCS1              *((volatile unsigned int*)(0x42486830UL))
#define bFM0P_MFT_PPG_PPGC20_INTM              *((volatile unsigned int*)(0x42486834UL))
#define bFM0P_MFT_PPG_PPGC20_PUF               *((volatile unsigned int*)(0x42486838UL))
#define bFM0P_MFT_PPG_PPGC20_PIE               *((volatile unsigned int*)(0x4248683CUL))
#define bFM0P_MFT_PPG_PPGC23_TTRG              *((volatile unsigned int*)(0x42486880UL))
#define bFM0P_MFT_PPG_PPGC23_MD0               *((volatile unsigned int*)(0x42486884UL))
#define bFM0P_MFT_PPG_PPGC23_MD1               *((volatile unsigned int*)(0x42486888UL))
#define bFM0P_MFT_PPG_PPGC23_PCS0              *((volatile unsigned int*)(0x4248688CUL))
#define bFM0P_MFT_PPG_PPGC23_PCS1              *((volatile unsigned int*)(0x42486890UL))
#define bFM0P_MFT_PPG_PPGC23_INTM              *((volatile unsigned int*)(0x42486894UL))
#define bFM0P_MFT_PPG_PPGC23_PUF               *((volatile unsigned int*)(0x42486898UL))
#define bFM0P_MFT_PPG_PPGC23_PIE               *((volatile unsigned int*)(0x4248689CUL))
#define bFM0P_MFT_PPG_PPGC22_TTRG              *((volatile unsigned int*)(0x424868A0UL))
#define bFM0P_MFT_PPG_PPGC22_MD0               *((volatile unsigned int*)(0x424868A4UL))
#define bFM0P_MFT_PPG_PPGC22_MD1               *((volatile unsigned int*)(0x424868A8UL))
#define bFM0P_MFT_PPG_PPGC22_PCS0              *((volatile unsigned int*)(0x424868ACUL))
#define bFM0P_MFT_PPG_PPGC22_PCS1              *((volatile unsigned int*)(0x424868B0UL))
#define bFM0P_MFT_PPG_PPGC22_INTM              *((volatile unsigned int*)(0x424868B4UL))
#define bFM0P_MFT_PPG_PPGC22_PUF               *((volatile unsigned int*)(0x424868B8UL))
#define bFM0P_MFT_PPG_PPGC22_PIE               *((volatile unsigned int*)(0x424868BCUL))
#define bFM0P_MFT_PPG_PRLL20_PRLL0             *((volatile unsigned int*)(0x42486900UL))
#define bFM0P_MFT_PPG_PRLL20_PRLL1             *((volatile unsigned int*)(0x42486904UL))
#define bFM0P_MFT_PPG_PRLL20_PRLL2             *((volatile unsigned int*)(0x42486908UL))
#define bFM0P_MFT_PPG_PRLL20_PRLL3             *((volatile unsigned int*)(0x4248690CUL))
#define bFM0P_MFT_PPG_PRLL20_PRLL4             *((volatile unsigned int*)(0x42486910UL))
#define bFM0P_MFT_PPG_PRLL20_PRLL5             *((volatile unsigned int*)(0x42486914UL))
#define bFM0P_MFT_PPG_PRLL20_PRLL6             *((volatile unsigned int*)(0x42486918UL))
#define bFM0P_MFT_PPG_PRLL20_PRLL7             *((volatile unsigned int*)(0x4248691CUL))
#define bFM0P_MFT_PPG_PRLH20_PRLH0             *((volatile unsigned int*)(0x42486920UL))
#define bFM0P_MFT_PPG_PRLH20_PRLH1             *((volatile unsigned int*)(0x42486924UL))
#define bFM0P_MFT_PPG_PRLH20_PRLH2             *((volatile unsigned int*)(0x42486928UL))
#define bFM0P_MFT_PPG_PRLH20_PRLH3             *((volatile unsigned int*)(0x4248692CUL))
#define bFM0P_MFT_PPG_PRLH20_PRLH4             *((volatile unsigned int*)(0x42486930UL))
#define bFM0P_MFT_PPG_PRLH20_PRLH5             *((volatile unsigned int*)(0x42486934UL))
#define bFM0P_MFT_PPG_PRLH20_PRLH6             *((volatile unsigned int*)(0x42486938UL))
#define bFM0P_MFT_PPG_PRLH20_PRLH7             *((volatile unsigned int*)(0x4248693CUL))
#define bFM0P_MFT_PPG_PRLL21_PRLL0             *((volatile unsigned int*)(0x42486980UL))
#define bFM0P_MFT_PPG_PRLL21_PRLL1             *((volatile unsigned int*)(0x42486984UL))
#define bFM0P_MFT_PPG_PRLL21_PRLL2             *((volatile unsigned int*)(0x42486988UL))
#define bFM0P_MFT_PPG_PRLL21_PRLL3             *((volatile unsigned int*)(0x4248698CUL))
#define bFM0P_MFT_PPG_PRLL21_PRLL4             *((volatile unsigned int*)(0x42486990UL))
#define bFM0P_MFT_PPG_PRLL21_PRLL5             *((volatile unsigned int*)(0x42486994UL))
#define bFM0P_MFT_PPG_PRLL21_PRLL6             *((volatile unsigned int*)(0x42486998UL))
#define bFM0P_MFT_PPG_PRLL21_PRLL7             *((volatile unsigned int*)(0x4248699CUL))
#define bFM0P_MFT_PPG_PRLH21_PRLH0             *((volatile unsigned int*)(0x424869A0UL))
#define bFM0P_MFT_PPG_PRLH21_PRLH1             *((volatile unsigned int*)(0x424869A4UL))
#define bFM0P_MFT_PPG_PRLH21_PRLH2             *((volatile unsigned int*)(0x424869A8UL))
#define bFM0P_MFT_PPG_PRLH21_PRLH3             *((volatile unsigned int*)(0x424869ACUL))
#define bFM0P_MFT_PPG_PRLH21_PRLH4             *((volatile unsigned int*)(0x424869B0UL))
#define bFM0P_MFT_PPG_PRLH21_PRLH5             *((volatile unsigned int*)(0x424869B4UL))
#define bFM0P_MFT_PPG_PRLH21_PRLH6             *((volatile unsigned int*)(0x424869B8UL))
#define bFM0P_MFT_PPG_PRLH21_PRLH7             *((volatile unsigned int*)(0x424869BCUL))
#define bFM0P_MFT_PPG_PRLL22_PRLL0             *((volatile unsigned int*)(0x42486A00UL))
#define bFM0P_MFT_PPG_PRLL22_PRLL1             *((volatile unsigned int*)(0x42486A04UL))
#define bFM0P_MFT_PPG_PRLL22_PRLL2             *((volatile unsigned int*)(0x42486A08UL))
#define bFM0P_MFT_PPG_PRLL22_PRLL3             *((volatile unsigned int*)(0x42486A0CUL))
#define bFM0P_MFT_PPG_PRLL22_PRLL4             *((volatile unsigned int*)(0x42486A10UL))
#define bFM0P_MFT_PPG_PRLL22_PRLL5             *((volatile unsigned int*)(0x42486A14UL))
#define bFM0P_MFT_PPG_PRLL22_PRLL6             *((volatile unsigned int*)(0x42486A18UL))
#define bFM0P_MFT_PPG_PRLL22_PRLL7             *((volatile unsigned int*)(0x42486A1CUL))
#define bFM0P_MFT_PPG_PRLH22_PRLH0             *((volatile unsigned int*)(0x42486A20UL))
#define bFM0P_MFT_PPG_PRLH22_PRLH1             *((volatile unsigned int*)(0x42486A24UL))
#define bFM0P_MFT_PPG_PRLH22_PRLH2             *((volatile unsigned int*)(0x42486A28UL))
#define bFM0P_MFT_PPG_PRLH22_PRLH3             *((volatile unsigned int*)(0x42486A2CUL))
#define bFM0P_MFT_PPG_PRLH22_PRLH4             *((volatile unsigned int*)(0x42486A30UL))
#define bFM0P_MFT_PPG_PRLH22_PRLH5             *((volatile unsigned int*)(0x42486A34UL))
#define bFM0P_MFT_PPG_PRLH22_PRLH6             *((volatile unsigned int*)(0x42486A38UL))
#define bFM0P_MFT_PPG_PRLH22_PRLH7             *((volatile unsigned int*)(0x42486A3CUL))
#define bFM0P_MFT_PPG_PRLL23_PRLL0             *((volatile unsigned int*)(0x42486A80UL))
#define bFM0P_MFT_PPG_PRLL23_PRLL1             *((volatile unsigned int*)(0x42486A84UL))
#define bFM0P_MFT_PPG_PRLL23_PRLL2             *((volatile unsigned int*)(0x42486A88UL))
#define bFM0P_MFT_PPG_PRLL23_PRLL3             *((volatile unsigned int*)(0x42486A8CUL))
#define bFM0P_MFT_PPG_PRLL23_PRLL4             *((volatile unsigned int*)(0x42486A90UL))
#define bFM0P_MFT_PPG_PRLL23_PRLL5             *((volatile unsigned int*)(0x42486A94UL))
#define bFM0P_MFT_PPG_PRLL23_PRLL6             *((volatile unsigned int*)(0x42486A98UL))
#define bFM0P_MFT_PPG_PRLL23_PRLL7             *((volatile unsigned int*)(0x42486A9CUL))
#define bFM0P_MFT_PPG_PRLH23_PRLH0             *((volatile unsigned int*)(0x42486AA0UL))
#define bFM0P_MFT_PPG_PRLH23_PRLH1             *((volatile unsigned int*)(0x42486AA4UL))
#define bFM0P_MFT_PPG_PRLH23_PRLH2             *((volatile unsigned int*)(0x42486AA8UL))
#define bFM0P_MFT_PPG_PRLH23_PRLH3             *((volatile unsigned int*)(0x42486AACUL))
#define bFM0P_MFT_PPG_PRLH23_PRLH4             *((volatile unsigned int*)(0x42486AB0UL))
#define bFM0P_MFT_PPG_PRLH23_PRLH5             *((volatile unsigned int*)(0x42486AB4UL))
#define bFM0P_MFT_PPG_PRLH23_PRLH6             *((volatile unsigned int*)(0x42486AB8UL))
#define bFM0P_MFT_PPG_PRLH23_PRLH7             *((volatile unsigned int*)(0x42486ABCUL))
#define bFM0P_MFT_PPG_GATEC20_EDGE20           *((volatile unsigned int*)(0x42486B00UL))
#define bFM0P_MFT_PPG_GATEC20_STRG20           *((volatile unsigned int*)(0x42486B04UL))
#define bFM0P_MFT_PPG_GATEC20_EDGE22           *((volatile unsigned int*)(0x42486B10UL))
#define bFM0P_MFT_PPG_GATEC20_STRG22           *((volatile unsigned int*)(0x42486B14UL))
#define bFM0P_MFT_PPG_IGBTC_IGBTMD             *((volatile unsigned int*)(0x42487000UL))
#define bFM0P_MFT_PPG_IGBTC_IGTRGLV            *((volatile unsigned int*)(0x42487004UL))
#define bFM0P_MFT_PPG_IGBTC_IGOSEL0            *((volatile unsigned int*)(0x42487008UL))
#define bFM0P_MFT_PPG_IGBTC_IGOSEL1            *((volatile unsigned int*)(0x4248700CUL))
#define bFM0P_MFT_PPG_IGBTC_IGNFW0             *((volatile unsigned int*)(0x42487010UL))
#define bFM0P_MFT_PPG_IGBTC_IGNFW1             *((volatile unsigned int*)(0x42487014UL))
#define bFM0P_MFT_PPG_IGBTC_IGNFW2             *((volatile unsigned int*)(0x42487018UL))
#define bFM0P_MFT_PPG_IGBTC_IGATIH             *((volatile unsigned int*)(0x4248701CUL))

/* Base Timer 0 PPG registers */
#define bFM0P_BT0_PPG_TMCR_STRG                *((volatile unsigned int*)(0x424A0180UL))
#define bFM0P_BT0_PPG_TMCR_CTEN                *((volatile unsigned int*)(0x424A0184UL))
#define bFM0P_BT0_PPG_TMCR_MDSE                *((volatile unsigned int*)(0x424A0188UL))
#define bFM0P_BT0_PPG_TMCR_OSEL                *((volatile unsigned int*)(0x424A018CUL))
#define bFM0P_BT0_PPG_TMCR_FMD0                *((volatile unsigned int*)(0x424A0190UL))
#define bFM0P_BT0_PPG_TMCR_FMD1                *((volatile unsigned int*)(0x424A0194UL))
#define bFM0P_BT0_PPG_TMCR_FMD2                *((volatile unsigned int*)(0x424A0198UL))
#define bFM0P_BT0_PPG_TMCR_EGS0                *((volatile unsigned int*)(0x424A01A0UL))
#define bFM0P_BT0_PPG_TMCR_EGS1                *((volatile unsigned int*)(0x424A01A4UL))
#define bFM0P_BT0_PPG_TMCR_PMSK                *((volatile unsigned int*)(0x424A01A8UL))
#define bFM0P_BT0_PPG_TMCR_RTGEN               *((volatile unsigned int*)(0x424A01ACUL))
#define bFM0P_BT0_PPG_TMCR_CKS0                *((volatile unsigned int*)(0x424A01B0UL))
#define bFM0P_BT0_PPG_TMCR_CKS1                *((volatile unsigned int*)(0x424A01B4UL))
#define bFM0P_BT0_PPG_TMCR_CKS2                *((volatile unsigned int*)(0x424A01B8UL))
#define bFM0P_BT0_PPG_STC_UDIR                 *((volatile unsigned int*)(0x424A0200UL))
#define bFM0P_BT0_PPG_STC_TGIR                 *((volatile unsigned int*)(0x424A0208UL))
#define bFM0P_BT0_PPG_STC_UDIE                 *((volatile unsigned int*)(0x424A0210UL))
#define bFM0P_BT0_PPG_STC_TGIE                 *((volatile unsigned int*)(0x424A0218UL))
#define bFM0P_BT0_PPG_TMCR2_CKS3               *((volatile unsigned int*)(0x424A0220UL))

