furjie/Single-BLDC-driver-and-app/s6e1a1.h
/* Base Timer I/O selector channel 0 - channel 3 registers */
#define bFM0P_BTIOSEL03_BTSEL0123_SEL01_0       *((volatile unsigned int*)(0x424A2020UL))
#define bFM0P_BTIOSEL03_BTSEL0123_SEL01_1       *((volatile unsigned int*)(0x424A2024UL))
#define bFM0P_BTIOSEL03_BTSEL0123_SEL01_2       *((volatile unsigned int*)(0x424A2028UL))
#define bFM0P_BTIOSEL03_BTSEL0123_SEL01_3       *((volatile unsigned int*)(0x424A202CUL))
#define bFM0P_BTIOSEL03_BTSEL0123_SEL23_0       *((volatile unsigned int*)(0x424A2030UL))
#define bFM0P_BTIOSEL03_BTSEL0123_SEL23_1       *((volatile unsigned int*)(0x424A2034UL))
#define bFM0P_BTIOSEL03_BTSEL0123_SEL23_2       *((volatile unsigned int*)(0x424A2038UL))
#define bFM0P_BTIOSEL03_BTSEL0123_SEL23_3       *((volatile unsigned int*)(0x424A203CUL))

/* Software based Simulation Startup (Base Timer) register */
#define bFM0P_SBSSR_BTSSSR_SSSR0               *((volatile unsigned int*)(0x424BFF80UL))
#define bFM0P_SBSSR_BTSSSR_SSSR1               *((volatile unsigned int*)(0x424BFF84UL))
#define bFM0P_SBSSR_BTSSSR_SSSR2               *((volatile unsigned int*)(0x424BFF88UL))
#define bFM0P_SBSSR_BTSSSR_SSSR3               *((volatile unsigned int*)(0x424BFF8CUL))

/* Quad position and revolution counter channel 0 registers */
#define bFM0P_QPRC0_QICRL_QPCMIE               *((volatile unsigned int*)(0x424C0280UL))
#define bFM0P_QPRC0_QICRL_QPCMF                *((volatile unsigned int*)(0x424C0284UL))
#define bFM0P_QPRC0_QICRL_QPRCMIE              *((volatile unsigned int*)(0x424C0288UL))
#define bFM0P_QPRC0_QICRL_QPRCMF               *((volatile unsigned int*)(0x424C028CUL))
#define bFM0P_QPRC0_QICRL_OUZIE                *((volatile unsigned int*)(0x424C0290UL))
#define bFM0P_QPRC0_QICRL_UFDF                 *((volatile unsigned int*)(0x424C0294UL))
#define bFM0P_QPRC0_QICRL_OFDF                 *((volatile unsigned int*)(0x424C0298UL))
#define bFM0P_QPRC0_QICRL_ZIIF                 *((volatile unsigned int*)(0x424C029CUL))
#define bFM0P_QPRC0_QICRH_CDCIE                *((volatile unsigned int*)(0x424C02A0UL))
#define bFM0P_QPRC0_QICRH_CDCF                 *((volatile unsigned int*)(0x424C02A4UL))
#define bFM0P_QPRC0_QICRH_DIRPC                *((volatile unsigned int*)(0x424C02A8UL))
#define bFM0P_QPRC0_QICRH_DIROU                *((volatile unsigned int*)(0x424C02ACUL))
#define bFM0P_QPRC0_QICRH_QPCNRCMIE            *((volatile unsigned int*)(0x424C02B0UL))
#define bFM0P_QPRC0_QICRH_QPCNRCMF             *((volatile unsigned int*)(0x424C02B4UL))
#define bFM0P_QPRC0_QCRL_PCM0                  *((volatile unsigned int*)(0x424C0300UL))
#define bFM0P_QPRC0_QCRL_PCM1                  *((volatile unsigned int*)(0x424C0304UL))
#define bFM0P_QPRC0_QCRL_RCM0                  *((volatile unsigned int*)(0x424C0308UL))
#define bFM0P_QPRC0_QCRL_RCM1                  *((volatile unsigned int*)(0x424C030CUL))
#define bFM0P_QPRC0_QCRL_PSTP                  *((volatile unsigned int*)(0x424C0310UL))
#define bFM0P_QPRC0_QCRL_CGSC                  *((volatile unsigned int*)(0x424C0314UL))
#define bFM0P_QPRC0_QCRL_RSEL                  *((volatile unsigned int*)(0x424C0318UL))
#define bFM0P_QPRC0_QCRL_SWAP                  *((volatile unsigned int*)(0x424C031CUL))
#define bFM0P_QPRC0_QCRH_PCRM0                 *((volatile unsigned int*)(0x424C0320UL))
#define bFM0P_QPRC0_QCRH_PCRM1                 *((volatile unsigned int*)(0x424C0324UL))
#define bFM0P_QPRC0_QCRH_AES0                  *((volatile unsigned int*)(0x424C0328UL))
#define bFM0P_QPRC0_QCRH_AES1                  *((volatile unsigned int*)(0x424C032CUL))
#define bFM0P_QPRC0_QCRH_BES0                  *((volatile unsigned int*)(0x424C0330UL))
#define bFM0P_QPRC0_QCRH_BES1                  *((volatile unsigned int*)(0x424C0334UL))
#define bFM0P_QPRC0_QCRH_CGE0                  *((volatile unsigned int*)(0x424C0338UL))
#define bFM0P_QPRC0_QCRH_CGE1                  *((volatile unsigned int*)(0x424C033CUL))
#define bFM0P_QPRC0_QECR_ORNGMD                *((volatile unsigned int*)(0x424C0380UL))
#define bFM0P_QPRC0_QECR_ORNGF                 *((volatile unsigned int*)(0x424C0384UL))
#define bFM0P_QPRC0_QECR_ORNGIE                *((volatile unsigned int*)(0x424C0388UL))

/* QPRC0_NF registers */
#define bFM0P_QPRC0_NF_NFCTLA_AINNWS0          *((volatile unsigned int*)(0x424C2000UL))
#define bFM0P_QPRC0_NF_NFCTLA_AINNWS1          *((volatile unsigned int*)(0x424C2004UL))
#define bFM0P_QPRC0_NF_NFCTLA_AINNWS2          *((volatile unsigned int*)(0x424C2008UL))
#define bFM0P_QPRC0_NF_NFCTLA_AINLV            *((volatile unsigned int*)(0x424C2010UL))
#define bFM0P_QPRC0_NF_NFCTLA_AINMD            *((volatile unsigned int*)(0x424C2014UL))
#define bFM0P_QPRC0_NF_NFCTLB_BINNWS0          *((volatile unsigned int*)(0x424C2080UL))
#define bFM0P_QPRC0_NF_NFCTLB_BINNWS1          *((volatile unsigned int*)(0x424C2084UL))
#define bFM0P_QPRC0_NF_NFCTLB_BINNWS2          *((volatile unsigned int*)(0x424C2088UL))
#define bFM0P_QPRC0_NF_NFCTLB_BINLV            *((volatile unsigned int*)(0x424C2090UL))
#define bFM0P_QPRC0_NF_NFCTLB_BINMD            *((volatile unsigned int*)(0x424C2094UL))
#define bFM0P_QPRC0_NF_NFCTLZ_ZINNWS0          *((volatile unsigned int*)(0x424C2100UL))
#define bFM0P_QPRC0_NF_NFCTLZ_ZINNWS1          *((volatile unsigned int*)(0x424C2104UL))
#define bFM0P_QPRC0_NF_NFCTLZ_ZINNWS2          *((volatile unsigned int*)(0x424C2108UL))
#define bFM0P_QPRC0_NF_NFCTLZ_ZINLV            *((volatile unsigned int*)(0x424C2110UL))
#define bFM0P_QPRC0_NF_NFCTLZ_ZINMD            *((volatile unsigned int*)(0x424C2114UL))

/* 12-bit ADC unit 0 registers */
#define bFM0P_ADC0_ADSR_SCS                    *((volatile unsigned int*)(0x424E0000UL))
#define bFM0P_ADC0_ADSR_PCS                    *((volatile unsigned int*)(0x424E0004UL))
#define bFM0P_ADC0_ADSR_PCNS                   *((volatile unsigned int*)(0x424E0008UL))
#define bFM0P_ADC0_ADSR_FDAS                   *((volatile unsigned int*)(0x424E0018UL))
#define bFM0P_ADC0_ADSR_ADSTP                  *((volatile unsigned int*)(0x424E001CUL))
#define bFM0P_ADC0_ADCR_OVRIE                  *((volatile unsigned int*)(0x424E0020UL))
#define bFM0P_ADC0_ADCR_CMPIE                  *((volatile unsigned int*)(0x424E0024UL))
#define bFM0P_ADC0_ADCR_PCIE                   *((volatile unsigned int*)(0x424E0028UL))
#define bFM0P_ADC0_ADCR_SCIE                   *((volatile unsigned int*)(0x424E002CUL))
#define bFM0P_ADC0_ADCR_CMPIF                  *((volatile unsigned int*)(0x424E0034UL))
#define bFM0P_ADC0_ADCR_PCIF                   *((volatile unsigned int*)(0x424E0038UL))
#define bFM0P_ADC0_ADCR_SCIF                   *((volatile unsigned int*)(0x424E003CUL))
#define bFM0P_ADC0_SFNS_SFS0                   *((volatile unsigned int*)(0x424E0100UL))
#define bFM0P_ADC0_SFNS_SFS1                   *((volatile unsigned int*)(0x424E0104UL))
#define bFM0P_ADC0_SFNS_SFS2                   *((volatile unsigned int*)(0x424E0108UL))
#define bFM0P_ADC0_SFNS_SFS3                   *((volatile unsigned int*)(0x424E010CUL))
#define bFM0P_ADC0_SCCR_SSTR                   *((volatile unsigned int*)(0x424E0120UL))
#define bFM0P_ADC0_SCCR_SHEN                   *((volatile unsigned int*)(0x424E0124UL))
#define bFM0P_ADC0_SCCR_RPT                    *((volatile unsigned int*)(0x424E0128UL))
#define bFM0P_ADC0_SCCR_SFCLR                  *((volatile unsigned int*)(0x424E0130UL))
#define bFM0P_ADC0_SCCR_SOVR                   *((volatile unsigned int*)(0x424E0134UL))
#define bFM0P_ADC0_SCCR_SFUL                   *((volatile unsigned int*)(0x424E0138UL))
#define bFM0P_ADC0_SCCR_SEMP                   *((volatile unsigned int*)(0x424E013CUL))
#define bFM0P_ADC0_SCFD_SC0                    *((volatile unsigned int*)(0x424E0180UL))
#define bFM0P_ADC0_SCFD_SC1                    *((volatile unsigned int*)(0x424E0184UL))
#define bFM0P_ADC0_SCFD_SC2                    *((volatile unsigned int*)(0x424E0188UL))
#define bFM0P_ADC0_SCFD_SC3                    *((volatile unsigned int*)(0x424E018CUL))
#define bFM0P_ADC0_SCFD_SC4                    *((volatile unsigned int*)(0x424E0190UL))
#define bFM0P_ADC0_SCFD_RS0                    *((volatile unsigned int*)(0x424E01A0UL))
#define bFM0P_ADC0_SCFD_RS1                    *((volatile unsigned int*)(0x424E01A4UL))
#define bFM0P_ADC0_SCFD_INVL                   *((volatile unsigned int*)(0x424E01B0UL))
#define bFM0P_ADC0_SCFD_SD0                    *((volatile unsigned int*)(0x424E01D0UL))
#define bFM0P_ADC0_SCFD_SD1                    *((volatile unsigned int*)(0x424E01D4UL))
#define bFM0P_ADC0_SCFD_SD2                    *((volatile unsigned int*)(0x424E01D8UL))
#define bFM0P_ADC0_SCFD_SD3                    *((volatile unsigned int*)(0x424E01DCUL))
#define bFM0P_ADC0_SCFD_SD4                    *((volatile unsigned int*)(0x424E01E0UL))
#define bFM0P_ADC0_SCFD_SD5                    *((volatile unsigned int*)(0x424E01E4UL))
#define bFM0P_ADC0_SCFD_SD6                    *((volatile unsigned int*)(0x424E01E8UL))
#define bFM0P_ADC0_SCFD_SD7                    *((volatile unsigned int*)(0x424E01ECUL))
#define bFM0P_ADC0_SCFD_SD8                    *((volatile unsigned int*)(0x424E01F0UL))
#define bFM0P_ADC0_SCFD_SD9                    *((volatile unsigned int*)(0x424E01F4UL))
#define bFM0P_ADC0_SCFD_SD10                   *((volatile unsigned int*)(0x424E01F8UL))
#define bFM0P_ADC0_SCFD_SD11                   *((volatile unsigned int*)(0x424E01FCUL))
#define bFM0P_ADC0_SCIS2_AN16                  *((volatile unsigned int*)(0x424E0200UL))
#define bFM0P_ADC0_SCIS2_AN17                  *((volatile unsigned int*)(0x424E0204UL))
#define bFM0P_ADC0_SCIS2_AN18                  *((volatile unsigned int*)(0x424E0208UL))
#define bFM0P_ADC0_SCIS2_AN19                  *((volatile unsigned int*)(0x424E020CUL))
#define bFM0P_ADC0_SCIS2_AN20                  *((volatile unsigned int*)(0x424E0210UL))
#define bFM0P_ADC0_SCIS2_AN21                  *((volatile unsigned int*)(0x424E0214UL))
#define bFM0P_ADC0_SCIS2_AN22                  *((volatile unsigned int*)(0x424E0218UL))
#define bFM0P_ADC0_SCIS2_AN23                  *((volatile unsigned int*)(0x424E021CUL))
#define bFM0P_ADC0_SCIS3_AN24                  *((volatile unsigned int*)(0x424E0220UL))
#define bFM0P_ADC0_SCIS3_AN25                  *((volatile unsigned int*)(0x424E0224UL))
#define bFM0P_ADC0_SCIS3_AN26                  *((volatile unsigned int*)(0x424E0228UL))
#define bFM0P_ADC0_SCIS3_AN27                  *((volatile unsigned int*)(0x424E022CUL))
#define bFM0P_ADC0_SCIS3_AN28                  *((volatile unsigned int*)(0x424E0230UL))
#define bFM0P_ADC0_SCIS3_AN29                  *((volatile unsigned int*)(0x424E0234UL))
#define bFM0P_ADC0_SCIS3_AN30                  *((volatile unsigned int*)(0x424E0238UL))
#define bFM0P_ADC0_SCIS3_AN31                  *((volatile unsigned int*)(0x424E023CUL))
#define bFM0P_ADC0_SCIS0_AN0                   *((volatile unsigned int*)(0x424E0280UL))
#define bFM0P_ADC0_SCIS0_AN1                   *((volatile unsigned int*)(0x424E0284UL))
#define bFM0P_ADC0_SCIS0_AN2                   *((volatile unsigned int*)(0x424E0288UL))
#define bFM0P_ADC0_SCIS0_AN3                   *((volatile unsigned int*)(0x424E028CUL))
#define bFM0P_ADC0_SCIS0_AN4                   *((volatile unsigned int*)(0x424E0290UL))
#define bFM0P_ADC0_SCIS0_AN5                   *((volatile unsigned int*)(0x424E0294UL))
#define bFM0P_ADC0_SCIS0_AN6                   *((volatile unsigned int*)(0x424E0298UL))
#define bFM0P_ADC0_SCIS0_AN7                   *((volatile unsigned int*)(0x424E029CUL))
#define bFM0P_ADC0_SCIS1_AN8                   *((volatile unsigned int*)(0x424E02A0UL))
#define bFM0P_ADC0_SCIS1_AN9                   *((volatile unsigned int*)(0x424E02A4UL))
#define bFM0P_ADC0_SCIS1_AN10                  *((volatile unsigned int*)(0x424E02A8UL))
#define bFM0P_ADC0_SCIS1_AN11                  *((volatile unsigned int*)(0x424E02ACUL))
#define bFM0P_ADC0_SCIS1_AN12                  *((volatile unsigned int*)(0x424E02B0UL))
#define bFM0P_ADC0_SCIS1_AN13                  *((volatile unsigned int*)(0x424E02B4UL))
#define bFM0P_ADC0_SCIS1_AN14                  *((volatile unsigned int*)(0x424E02B8UL))
#define bFM0P_ADC0_SCIS1_AN15                  *((volatile unsigned int*)(0x424E02BCUL))
#define bFM0P_ADC0_PFNS_PFS0                   *((volatile unsigned int*)(0x424E0300UL))
#define bFM0P_ADC0_PFNS_PFS1                   *((volatile unsigned int*)(0x424E0304UL))
#define bFM0P_ADC0_PFNS_TEST0                  *((volatile unsigned int*)(0x424E0310UL))
#define bFM0P_ADC0_PFNS_TEST1                  *((volatile unsigned int*)(0x424E0314UL))
#define bFM0P_ADC0_PCCR_PSTR                   *((volatile unsigned int*)(0x424E0320UL))
#define bFM0P_ADC0_PCCR_PHEN                   *((volatile unsigned int*)(0x424E0324UL))
#define bFM0P_ADC0_PCCR_PEEN                   *((volatile unsigned int*)(0x424E0328UL))
#define bFM0P_ADC0_PCCR_ESCE                   *((volatile unsigned int*)(0x424E032CUL))
#define bFM0P_ADC0_PCCR_PFCLR                  *((volatile unsigned int*)(0x424E0330UL))
#define bFM0P_ADC0_PCCR_POVR                   *((volatile unsigned int*)(0x424E0334UL))
#define bFM0P_ADC0_PCCR_PFUL                   *((volatile unsigned int*)(0x424E0338UL))
#define bFM0P_ADC0_PCCR_PEMP                   *((volatile unsigned int*)(0x424E033CUL))
#define bFM0P_ADC0_PCFD_PC0                    *((volatile unsigned int*)(0x424E0380UL))
#define bFM0P_ADC0_PCFD_PC1                    *((volatile unsigned int*)(0x424E0384UL))
#define bFM0P_ADC0_PCFD_PC2                    *((volatile unsigned int*)(0x424E0388UL))
#define bFM0P_ADC0_PCFD_PC3                    *((volatile unsigned int*)(0x424E038CUL))
#define bFM0P_ADC0_PCFD_PC4                    *((volatile unsigned int*)(0x424E0390UL))
#define bFM0P_ADC0_PCFD_RS0                    *((volatile unsigned int*)(0x424E03A0UL))
#define bFM0P_ADC0_PCFD_RS1                    *((volatile unsigned int*)(0x424E03A4UL))
#define bFM0P_ADC0_PCFD_RS2                    *((volatile unsigned int*)(0x424E03A8UL))
#define bFM0P_ADC0_PCFD_INVL                   *((volatile unsigned int*)(0x424E03B0UL))
#define bFM0P_ADC0_PCFD_PD0                    *((volatile unsigned int*)(0x424E03D0UL))
#define bFM0P_ADC0_PCFD_PD1                    *((volatile unsigned int*)(0x424E03D4UL))
#define bFM0P_ADC0_PCFD_PD2                    *((volatile unsigned int*)(0x424E03D8UL))
#define bFM0P_ADC0_PCFD_PD3                    *((volatile unsigned int*)(0x424E03DCUL))
#define bFM0P_ADC0_PCFD_PD4                    *((volatile unsigned int*)(0x424E03E0UL))
#define bFM0P_ADC0_PCFD_PD5                    *((volatile unsigned int*)(0x424E03E4UL))
#define bFM0P_ADC0_PCFD_PD6                    *((volatile unsigned int*)(0x424E03E8UL))
#define bFM0P_ADC0_PCFD_PD7                    *((volatile unsigned int*)(0x424E03ECUL))
#define bFM0P_ADC0_PCFD_PD8                    *((volatile unsigned int*)(0x424E03F0UL))
#define bFM0P_ADC0_PCFD_PD9                    *((volatile unsigned int*)(0x424E03F4UL))
#define bFM0P_ADC0_PCFD_PD10                   *((volatile unsigned int*)(0x424E03F8UL))
#define bFM0P_ADC0_PCFD_PD11                   *((volatile unsigned int*)(0x424E03FCUL))
#define bFM0P_ADC0_PCIS_P1A0                   *((volatile unsigned int*)(0x424E0400UL))
#define bFM0P_ADC0_PCIS_P1A1                   *((volatile unsigned int*)(0x424E0404UL))
#define bFM0P_ADC0_PCIS_P1A2                   *((volatile unsigned int*)(0x424E0408UL))
#define bFM0P_ADC0_PCIS_P2A0                   *((volatile unsigned int*)(0x424E040CUL))
#define bFM0P_ADC0_PCIS_P2A1                   *((volatile unsigned int*)(0x424E0410UL))
#define bFM0P_ADC0_PCIS_P2A2                   *((volatile unsigned int*)(0x424E0414UL))
#define bFM0P_ADC0_PCIS_P2A3                   *((volatile unsigned int*)(0x424E0418UL))
#define bFM0P_ADC0_PCIS_P2A4                   *((volatile unsigned int*)(0x424E041CUL))
#define bFM0P_ADC0_CMPCR_CCH0                  *((volatile unsigned int*)(0x424E0480UL))
#define bFM0P_ADC0_CMPCR_CCH1                  *((volatile unsigned int*)(0x424E0484UL))
#define bFM0P_ADC0_CMPCR_CCH2                  *((volatile unsigned int*)(0x424E0488UL))
#define bFM0P_ADC0_CMPCR_CCH3                  *((volatile unsigned int*)(0x424E048CUL))
#define bFM0P_ADC0_CMPCR_CCH4                  *((volatile unsigned int*)(0x424E0490UL))
#define bFM0P_ADC0_CMPCR_CMD0                  *((volatile unsigned int*)(0x424E0494UL))
#define bFM0P_ADC0_CMPCR_CMD1                  *((volatile unsigned int*)(0x424E0498UL))
#define bFM0P_ADC0_CMPCR_CMPEN                 *((volatile unsigned int*)(0x424E049CUL))
#define bFM0P_ADC0_CMPD_CMAD0                  *((volatile unsigned int*)(0x424E04D8UL))
#define bFM0P_ADC0_CMPD_CMAD1                  *((volatile unsigned int*)(0x424E04DCUL))
#define bFM0P_ADC0_CMPD_CMAD2                  *((volatile unsigned int*)(0x424E04E0UL))
#define bFM0P_ADC0_CMPD_CMAD3                  *((volatile unsigned int*)(0x424E04E4UL))
#define bFM0P_ADC0_CMPD_CMAD4                  *((volatile unsigned int*)(0x424E04E8UL))
#define bFM0P_ADC0_CMPD_CMAD5                  *((volatile unsigned int*)(0x424E04ECUL))
#define bFM0P_ADC0_CMPD_CMAD6                  *((volatile unsigned int*)(0x424E04F0UL))
#define bFM0P_ADC0_CMPD_CMAD7                  *((volatile unsigned int*)(0x424E04F4UL))
#define bFM0P_ADC0_CMPD_CMAD8                  *((volatile unsigned int*)(0x424E04F8UL))
#define bFM0P_ADC0_CMPD_CMAD9                  *((volatile unsigned int*)(0x424E04FCUL))
#define bFM0P_ADC0_ADSS2_TS16                  *((volatile unsigned int*)(0x424E0500UL))
#define bFM0P_ADC0_ADSS2_TS17                  *((volatile unsigned int*)(0x424E0504UL))
#define bFM0P_ADC0_ADSS2_TS18                  *((volatile unsigned int*)(0x424E0508UL))
#define bFM0P_ADC0_ADSS2_TS19                  *((volatile unsigned int*)(0x424E050CUL))
#define bFM0P_ADC0_ADSS2_TS20                  *((volatile unsigned int*)(0x424E0510UL))
#define bFM0P_ADC0_ADSS2_TS21                  *((volatile unsigned int*)(0x424E0514UL))
#define bFM0P_ADC0_ADSS2_TS22                  *((volatile unsigned int*)(0x424E0518UL))
#define bFM0P_ADC0_ADSS2_TS23                  *((volatile unsigned int*)(0x424E051CUL))
#define bFM0P_ADC0_ADSS3_TS24                  *((volatile unsigned int*)(0x424E0520UL))
#define bFM0P_ADC0_ADSS3_TS25                  *((volatile unsigned int*)(0x424E0524UL))
#define bFM0P_ADC0_ADSS3_TS26                  *((volatile unsigned int*)(0x424E0528UL))
#define bFM0P_ADC0_ADSS3_TS27                  *((volatile unsigned int*)(0x424E052CUL))
#define bFM0P_ADC0_ADSS3_TS28                  *((volatile unsigned int*)(0x424E0530UL))
#define bFM0P_ADC0_ADSS3_TS29                  *((volatile unsigned int*)(0x424E0534UL))
#define bFM0P_ADC0_ADSS3_TS30                  *((volatile unsigned int*)(0x424E0538UL))
#define bFM0P_ADC0_ADSS3_TS31                  *((volatile unsigned int*)(0x424E053CUL))
#define bFM0P_ADC0_ADSS0_TS0                   *((volatile unsigned int*)(0x424E0580UL))
#define bFM0P_ADC0_ADSS0_TS1                   *((volatile unsigned int*)(0x424E0584UL))
#define bFM0P_ADC0_ADSS0_TS2                   *((volatile unsigned int*)(0x424E0588UL))
#define bFM0P_ADC0_ADSS0_TS3                   *((volatile unsigned int*)(0x424E058CUL))
#define bFM0P_ADC0_ADSS0_TS4                   *((volatile unsigned int*)(0x424E0590UL))
#define bFM0P_ADC0_ADSS0_TS5                   *((volatile unsigned int*)(0x424E0594UL))
#define bFM0P_ADC0_ADSS0_TS6                   *((volatile unsigned int*)(0x424E0598UL))
#define bFM0P_ADC0_ADSS0_TS7                   *((volatile unsigned int*)(0x424E059CUL))
#define bFM0P_ADC0_ADSS1_TS8                   *((volatile unsigned int*)(0x424E05A0UL))
#define bFM0P_ADC0_ADSS1_TS9                   *((volatile unsigned int*)(0x424E05A4UL))
#define bFM0P_ADC0_ADSS1_TS10                  *((volatile unsigned int*)(0x424E05A8UL))
#define bFM0P_ADC0_ADSS1_TS11                  *((volatile unsigned int*)(0x424E05ACUL))
#define bFM0P_ADC0_ADSS1_TS12                  *((volatile unsigned int*)(0x424E05B0UL))
#define bFM0P_ADC0_ADSS1_TS13                  *((volatile unsigned int*)(0x424E05B4UL))
#define bFM0P_ADC0_ADSS1_TS14                  *((volatile unsigned int*)(0x424E05B8UL))
#define bFM0P_ADC0_ADSS1_TS15                  *((volatile unsigned int*)(0x424E05BCUL))
#define bFM0P_ADC0_ADST1_ST10                  *((volatile unsigned int*)(0x424E0600UL))
#define bFM0P_ADC0_ADST1_ST11                  *((volatile unsigned int*)(0x424E0604UL))
#define bFM0P_ADC0_ADST1_ST12                  *((volatile unsigned int*)(0x424E0608UL))
#define bFM0P_ADC0_ADST1_ST13                  *((volatile unsigned int*)(0x424E060CUL))
#define bFM0P_ADC0_ADST1_ST14                  *((volatile unsigned int*)(0x424E0610UL))
#define bFM0P_ADC0_ADST1_STX10                 *((volatile unsigned int*)(0x424E0614UL))
#define bFM0P_ADC0_ADST1_STX11                 *((volatile unsigned int*)(0x424E0618UL))
#define bFM0P_ADC0_ADST1_STX12                 *((volatile unsigned int*)(0x424E061CUL))
#define bFM0P_ADC0_ADST0_ST00                  *((volatile unsigned int*)(0x424E0620UL))
#define bFM0P_ADC0_ADST0_ST01                  *((volatile unsigned int*)(0x424E0624UL))
#define bFM0P_ADC0_ADST0_ST02                  *((volatile unsigned int*)(0x424E0628UL))
#define bFM0P_ADC0_ADST0_ST03                  *((volatile unsigned int*)(0x424E062CUL))
#define bFM0P_ADC0_ADST0_ST04                  *((volatile unsigned int*)(0x424E0630UL))
#define bFM0P_ADC0_ADST0_STX00                 *((volatile unsigned int*)(0x424E0634UL))
#define bFM0P_ADC0_ADST0_STX01                 *((volatile unsigned int*)(0x424E0638UL))
#define bFM0P_ADC0_ADST0_STX02                 *((volatile unsigned int*)(0x424E063CUL))
#define bFM0P_ADC0_ADCT_CT0                    *((volatile unsigned int*)(0x424E0680UL))
#define bFM0P_ADC0_ADCT_CT1                    *((volatile unsigned int*)(0x424E0684UL))
#define bFM0P_ADC0_ADCT_CT2                    *((volatile unsigned int*)(0x424E0688UL))
#define bFM0P_ADC0_ADCT_CT3                    *((volatile unsigned int*)(0x424E068CUL))
#define bFM0P_ADC0_ADCT_CT4                    *((volatile unsigned int*)(0x424E0690UL))
#define bFM0P_ADC0_ADCT_CT5                    *((volatile unsigned int*)(0x424E0694UL))
#define bFM0P_ADC0_ADCT_CT6                    *((volatile unsigned int*)(0x424E0698UL))
#define bFM0P_ADC0_ADCT_CT7                    *((volatile unsigned int*)(0x424E069CUL))
#define bFM0P_ADC0_PRTSL_PRTSL0                *((volatile unsigned int*)(0x424E0700UL))
#define bFM0P_ADC0_PRTSL_PRTSL1                *((volatile unsigned int*)(0x424E0704UL))
#define bFM0P_ADC0_PRTSL_PRTSL2                *((volatile unsigned int*)(0x424E0708UL))
#define bFM0P_ADC0_PRTSL_PRTSL3                *((volatile unsigned int*)(0x424E070CUL))
#define bFM0P_ADC0_SCTSL_SCTSL0                *((volatile unsigned int*)(0x424E0720UL))
#define bFM0P_ADC0_SCTSL_SCTSL1                *((volatile unsigned int*)(0x424E0724UL))
#define bFM0P_ADC0_SCTSL_SCTSL2                *((volatile unsigned int*)(0x424E0728UL))
#define bFM0P_ADC0_SCTSL_SCTSL3                *((volatile unsigned int*)(0x424E072CUL))
#define bFM0P_ADC0_ADCEN_ENBL                  *((volatile unsigned int*)(0x424E0780UL))
#define bFM0P_ADC0_ADCEN_READY                 *((volatile unsigned int*)(0x424E0784UL))
#define bFM0P_ADC0_ADCEN_ENBLTIME0             *((volatile unsigned int*)(0x424E07A0UL))
#define bFM0P_ADC0_ADCEN_ENBLTIME1             *((volatile unsigned int*)(0x424E07A4UL))
#define bFM0P_ADC0_ADCEN_ENBLTIME2             *((volatile unsigned int*)(0x424E07A8UL))
