furjie/Single-BLDC-driver-and-app/s6e1a1.h
#define bFM0P_ADC0_ADCEN_ENBLTIME3             *((volatile unsigned int*)(0x424E07ACUL))
#define bFM0P_ADC0_ADCEN_ENBLTIME4             *((volatile unsigned int*)(0x424E07B0UL))
#define bFM0P_ADC0_ADCEN_ENBLTIME5             *((volatile unsigned int*)(0x424E07B4UL))
#define bFM0P_ADC0_ADCEN_ENBLTIME6             *((volatile unsigned int*)(0x424E07B8UL))
#define bFM0P_ADC0_ADCEN_ENBLTIME7             *((volatile unsigned int*)(0x424E07BCUL))
#define bFM0P_ADC0_WCMRCIF_RCINT               *((volatile unsigned int*)(0x424E0880UL))
#define bFM0P_ADC0_WCMRCOT_RCOOF               *((volatile unsigned int*)(0x424E0900UL))
#define bFM0P_ADC0_WCMPCR_RCOE                 *((volatile unsigned int*)(0x424E0988UL))
#define bFM0P_ADC0_WCMPCR_RCOIE                *((volatile unsigned int*)(0x424E098CUL))
#define bFM0P_ADC0_WCMPCR_RCOIRS               *((volatile unsigned int*)(0x424E0990UL))
#define bFM0P_ADC0_WCMPCR_RCODC0               *((volatile unsigned int*)(0x424E0994UL))
#define bFM0P_ADC0_WCMPCR_RCODC1               *((volatile unsigned int*)(0x424E0998UL))
#define bFM0P_ADC0_WCMPCR_RCODC2               *((volatile unsigned int*)(0x424E099CUL))
#define bFM0P_ADC0_WCMPSR_WCCH0                *((volatile unsigned int*)(0x424E09A0UL))
#define bFM0P_ADC0_WCMPSR_WCCH1                *((volatile unsigned int*)(0x424E09A4UL))
#define bFM0P_ADC0_WCMPSR_WCCH2                *((volatile unsigned int*)(0x424E09A8UL))
#define bFM0P_ADC0_WCMPSR_WCCH3                *((volatile unsigned int*)(0x424E09ACUL))
#define bFM0P_ADC0_WCMPSR_WCCH4                *((volatile unsigned int*)(0x424E09B0UL))
#define bFM0P_ADC0_WCMPSR_WCMD                 *((volatile unsigned int*)(0x424E09B4UL))
#define bFM0P_ADC0_WCMPDL_CMLD0                *((volatile unsigned int*)(0x424E0A18UL))
#define bFM0P_ADC0_WCMPDL_CMLD1                *((volatile unsigned int*)(0x424E0A1CUL))
#define bFM0P_ADC0_WCMPDL_CMLD2                *((volatile unsigned int*)(0x424E0A20UL))
#define bFM0P_ADC0_WCMPDL_CMLD3                *((volatile unsigned int*)(0x424E0A24UL))
#define bFM0P_ADC0_WCMPDL_CMLD4                *((volatile unsigned int*)(0x424E0A28UL))
#define bFM0P_ADC0_WCMPDL_CMLD5                *((volatile unsigned int*)(0x424E0A2CUL))
#define bFM0P_ADC0_WCMPDL_CMLD6                *((volatile unsigned int*)(0x424E0A30UL))
#define bFM0P_ADC0_WCMPDL_CMLD7                *((volatile unsigned int*)(0x424E0A34UL))
#define bFM0P_ADC0_WCMPDL_CMLD8                *((volatile unsigned int*)(0x424E0A38UL))
#define bFM0P_ADC0_WCMPDL_CMLD9                *((volatile unsigned int*)(0x424E0A3CUL))
#define bFM0P_ADC0_WCMPDH_CMHD0                *((volatile unsigned int*)(0x424E0A58UL))
#define bFM0P_ADC0_WCMPDH_CMHD1                *((volatile unsigned int*)(0x424E0A5CUL))
#define bFM0P_ADC0_WCMPDH_CMHD2                *((volatile unsigned int*)(0x424E0A60UL))
#define bFM0P_ADC0_WCMPDH_CMHD3                *((volatile unsigned int*)(0x424E0A64UL))
#define bFM0P_ADC0_WCMPDH_CMHD4                *((volatile unsigned int*)(0x424E0A68UL))
#define bFM0P_ADC0_WCMPDH_CMHD5                *((volatile unsigned int*)(0x424E0A6CUL))
#define bFM0P_ADC0_WCMPDH_CMHD6                *((volatile unsigned int*)(0x424E0A70UL))
#define bFM0P_ADC0_WCMPDH_CMHD7                *((volatile unsigned int*)(0x424E0A74UL))
#define bFM0P_ADC0_WCMPDH_CMHD8                *((volatile unsigned int*)(0x424E0A78UL))
#define bFM0P_ADC0_WCMPDH_CMHD9                *((volatile unsigned int*)(0x424E0A7CUL))

/* CR trimming registers */
#define bFM0P_CRTRIM_MCR_PSR_CSR0              *((volatile unsigned int*)(0x425C0000UL))
#define bFM0P_CRTRIM_MCR_PSR_CSR1              *((volatile unsigned int*)(0x425C0004UL))
#define bFM0P_CRTRIM_MCR_PSR_CSR2              *((volatile unsigned int*)(0x425C0008UL))
#define bFM0P_CRTRIM_MCR_FTRM_TRD0             *((volatile unsigned int*)(0x425C0080UL))
#define bFM0P_CRTRIM_MCR_FTRM_TRD1             *((volatile unsigned int*)(0x425C0084UL))
#define bFM0P_CRTRIM_MCR_FTRM_TRD2             *((volatile unsigned int*)(0x425C0088UL))
#define bFM0P_CRTRIM_MCR_FTRM_TRD3             *((volatile unsigned int*)(0x425C008CUL))
#define bFM0P_CRTRIM_MCR_FTRM_TRD4             *((volatile unsigned int*)(0x425C0090UL))
#define bFM0P_CRTRIM_MCR_FTRM_TRD5             *((volatile unsigned int*)(0x425C0094UL))
#define bFM0P_CRTRIM_MCR_FTRM_TRD6             *((volatile unsigned int*)(0x425C0098UL))
#define bFM0P_CRTRIM_MCR_FTRM_TRD7             *((volatile unsigned int*)(0x425C009CUL))
#define bFM0P_CRTRIM_MCR_FTRM_TRD8             *((volatile unsigned int*)(0x425C00A0UL))
#define bFM0P_CRTRIM_MCR_FTRM_TRD9             *((volatile unsigned int*)(0x425C00A4UL))
#define bFM0P_CRTRIM_MCR_TTRM_TRT0             *((volatile unsigned int*)(0x425C0100UL))
#define bFM0P_CRTRIM_MCR_TTRM_TRT1             *((volatile unsigned int*)(0x425C0104UL))
#define bFM0P_CRTRIM_MCR_TTRM_TRT2             *((volatile unsigned int*)(0x425C0108UL))
#define bFM0P_CRTRIM_MCR_TTRM_TRT3             *((volatile unsigned int*)(0x425C010CUL))
#define bFM0P_CRTRIM_MCR_TTRM_TRT4             *((volatile unsigned int*)(0x425C0110UL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK0           *((volatile unsigned int*)(0x425C0180UL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK1           *((volatile unsigned int*)(0x425C0184UL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK2           *((volatile unsigned int*)(0x425C0188UL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK3           *((volatile unsigned int*)(0x425C018CUL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK4           *((volatile unsigned int*)(0x425C0190UL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK5           *((volatile unsigned int*)(0x425C0194UL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK6           *((volatile unsigned int*)(0x425C0198UL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK7           *((volatile unsigned int*)(0x425C019CUL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK8           *((volatile unsigned int*)(0x425C01A0UL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK9           *((volatile unsigned int*)(0x425C01A4UL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK10          *((volatile unsigned int*)(0x425C01A8UL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK11          *((volatile unsigned int*)(0x425C01ACUL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK12          *((volatile unsigned int*)(0x425C01B0UL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK13          *((volatile unsigned int*)(0x425C01B4UL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK14          *((volatile unsigned int*)(0x425C01B8UL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK15          *((volatile unsigned int*)(0x425C01BCUL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK16          *((volatile unsigned int*)(0x425C01C0UL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK17          *((volatile unsigned int*)(0x425C01C4UL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK18          *((volatile unsigned int*)(0x425C01C8UL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK19          *((volatile unsigned int*)(0x425C01CCUL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK20          *((volatile unsigned int*)(0x425C01D0UL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK21          *((volatile unsigned int*)(0x425C01D4UL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK22          *((volatile unsigned int*)(0x425C01D8UL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK23          *((volatile unsigned int*)(0x425C01DCUL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK24          *((volatile unsigned int*)(0x425C01E0UL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK25          *((volatile unsigned int*)(0x425C01E4UL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK26          *((volatile unsigned int*)(0x425C01E8UL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK27          *((volatile unsigned int*)(0x425C01ECUL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK28          *((volatile unsigned int*)(0x425C01F0UL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK29          *((volatile unsigned int*)(0x425C01F4UL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK30          *((volatile unsigned int*)(0x425C01F8UL))
#define bFM0P_CRTRIM_MCR_RLR_TRMLCK31          *((volatile unsigned int*)(0x425C01FCUL))

/* External interrupt registers */
#define bFM0P_EXTI_ENIR_EN0                    *((volatile unsigned int*)(0x42600000UL))
#define bFM0P_EXTI_ENIR_EN1                    *((volatile unsigned int*)(0x42600004UL))
#define bFM0P_EXTI_ENIR_EN2                    *((volatile unsigned int*)(0x42600008UL))
#define bFM0P_EXTI_ENIR_EN3                    *((volatile unsigned int*)(0x4260000CUL))
#define bFM0P_EXTI_ENIR_EN4                    *((volatile unsigned int*)(0x42600010UL))
#define bFM0P_EXTI_ENIR_EN5                    *((volatile unsigned int*)(0x42600014UL))
#define bFM0P_EXTI_ENIR_EN6                    *((volatile unsigned int*)(0x42600018UL))
#define bFM0P_EXTI_ENIR_EN15                   *((volatile unsigned int*)(0x4260003CUL))
#define bFM0P_EXTI_EIRR_ER0                    *((volatile unsigned int*)(0x42600080UL))
#define bFM0P_EXTI_EIRR_ER1                    *((volatile unsigned int*)(0x42600084UL))
#define bFM0P_EXTI_EIRR_ER2                    *((volatile unsigned int*)(0x42600088UL))
#define bFM0P_EXTI_EIRR_ER3                    *((volatile unsigned int*)(0x4260008CUL))
#define bFM0P_EXTI_EIRR_ER4                    *((volatile unsigned int*)(0x42600090UL))
#define bFM0P_EXTI_EIRR_ER5                    *((volatile unsigned int*)(0x42600094UL))
#define bFM0P_EXTI_EIRR_ER6                    *((volatile unsigned int*)(0x42600098UL))
#define bFM0P_EXTI_EIRR_ER15                   *((volatile unsigned int*)(0x426000BCUL))
#define bFM0P_EXTI_EICL_ECL0                   *((volatile unsigned int*)(0x42600100UL))
#define bFM0P_EXTI_EICL_ECL1                   *((volatile unsigned int*)(0x42600104UL))
#define bFM0P_EXTI_EICL_ECL2                   *((volatile unsigned int*)(0x42600108UL))
#define bFM0P_EXTI_EICL_ECL3                   *((volatile unsigned int*)(0x4260010CUL))
#define bFM0P_EXTI_EICL_ECL4                   *((volatile unsigned int*)(0x42600110UL))
#define bFM0P_EXTI_EICL_ECL5                   *((volatile unsigned int*)(0x42600114UL))
#define bFM0P_EXTI_EICL_ECL6                   *((volatile unsigned int*)(0x42600118UL))
#define bFM0P_EXTI_EICL_ECL15                  *((volatile unsigned int*)(0x4260013CUL))
#define bFM0P_EXTI_ELVR_LA0                    *((volatile unsigned int*)(0x42600180UL))
#define bFM0P_EXTI_ELVR_LB0                    *((volatile unsigned int*)(0x42600184UL))
#define bFM0P_EXTI_ELVR_LA1                    *((volatile unsigned int*)(0x42600188UL))
#define bFM0P_EXTI_ELVR_LB1                    *((volatile unsigned int*)(0x4260018CUL))
#define bFM0P_EXTI_ELVR_LA2                    *((volatile unsigned int*)(0x42600190UL))
#define bFM0P_EXTI_ELVR_LB2                    *((volatile unsigned int*)(0x42600194UL))
#define bFM0P_EXTI_ELVR_LA3                    *((volatile unsigned int*)(0x42600198UL))
#define bFM0P_EXTI_ELVR_LB3                    *((volatile unsigned int*)(0x4260019CUL))
#define bFM0P_EXTI_ELVR_LA4                    *((volatile unsigned int*)(0x426001A0UL))
#define bFM0P_EXTI_ELVR_LB4                    *((volatile unsigned int*)(0x426001A4UL))
#define bFM0P_EXTI_ELVR_LA5                    *((volatile unsigned int*)(0x426001A8UL))
#define bFM0P_EXTI_ELVR_LB5                    *((volatile unsigned int*)(0x426001ACUL))
#define bFM0P_EXTI_ELVR_LA6                    *((volatile unsigned int*)(0x426001B0UL))
#define bFM0P_EXTI_ELVR_LB6                    *((volatile unsigned int*)(0x426001B4UL))
#define bFM0P_EXTI_ELVR_LA15                   *((volatile unsigned int*)(0x426001F8UL))
#define bFM0P_EXTI_ELVR_LB15                   *((volatile unsigned int*)(0x426001FCUL))
#define bFM0P_EXTI_NMIRR_NR                    *((volatile unsigned int*)(0x42600280UL))
#define bFM0P_EXTI_NMICL_NCL                   *((volatile unsigned int*)(0x42600300UL))

