furjie/Single-BLDC-driver-and-app/s6e1a1.h
/* INTREQ registers */
#define bFM0P_INTREQ_DRQSEL_ADCSCAN0           *((volatile unsigned int*)(0x42620014UL))
#define bFM0P_INTREQ_DRQSEL_ADCSCAN1           *((volatile unsigned int*)(0x42620018UL))
#define bFM0P_INTREQ_DRQSEL_ADCSCAN2           *((volatile unsigned int*)(0x4262001CUL))
#define bFM0P_INTREQ_DRQSEL_IRQ0BT0            *((volatile unsigned int*)(0x42620020UL))
#define bFM0P_INTREQ_DRQSEL_IRQ0BT2            *((volatile unsigned int*)(0x42620024UL))
#define bFM0P_INTREQ_DRQSEL_IRQ0BT4            *((volatile unsigned int*)(0x42620028UL))
#define bFM0P_INTREQ_DRQSEL_IRQ0BT6            *((volatile unsigned int*)(0x4262002CUL))
#define bFM0P_INTREQ_DRQSEL_MFS0RX             *((volatile unsigned int*)(0x42620030UL))
#define bFM0P_INTREQ_DRQSEL_MFS0TX             *((volatile unsigned int*)(0x42620034UL))
#define bFM0P_INTREQ_DRQSEL_MFS1RX             *((volatile unsigned int*)(0x42620038UL))
#define bFM0P_INTREQ_DRQSEL_MFS1TX             *((volatile unsigned int*)(0x4262003CUL))
#define bFM0P_INTREQ_DRQSEL_MFS2RX             *((volatile unsigned int*)(0x42620040UL))
#define bFM0P_INTREQ_DRQSEL_MFS2TX             *((volatile unsigned int*)(0x42620044UL))
#define bFM0P_INTREQ_DRQSEL_MFS3RX             *((volatile unsigned int*)(0x42620048UL))
#define bFM0P_INTREQ_DRQSEL_MFS3TX             *((volatile unsigned int*)(0x4262004CUL))
#define bFM0P_INTREQ_DRQSEL_MFS4RX             *((volatile unsigned int*)(0x42620050UL))
#define bFM0P_INTREQ_DRQSEL_MFS4TX             *((volatile unsigned int*)(0x42620054UL))
#define bFM0P_INTREQ_DRQSEL_MFS5RX             *((volatile unsigned int*)(0x42620058UL))
#define bFM0P_INTREQ_DRQSEL_MFS5TX             *((volatile unsigned int*)(0x4262005CUL))
#define bFM0P_INTREQ_DRQSEL_MFS6RX             *((volatile unsigned int*)(0x42620060UL))
#define bFM0P_INTREQ_DRQSEL_MFS6TX             *((volatile unsigned int*)(0x42620064UL))
#define bFM0P_INTREQ_DRQSEL_MFS7RX             *((volatile unsigned int*)(0x42620068UL))
#define bFM0P_INTREQ_DRQSEL_MFS7TX             *((volatile unsigned int*)(0x4262006CUL))
#define bFM0P_INTREQ_DRQSEL_EXINT0             *((volatile unsigned int*)(0x42620070UL))
#define bFM0P_INTREQ_DRQSEL_EXINT1             *((volatile unsigned int*)(0x42620074UL))
#define bFM0P_INTREQ_DRQSEL_EXINT2             *((volatile unsigned int*)(0x42620078UL))
#define bFM0P_INTREQ_DRQSEL_EXINT3             *((volatile unsigned int*)(0x4262007CUL))
#define bFM0P_INTREQ_IRQCMODE_IRQCMODE         *((volatile unsigned int*)(0x42620180UL))
#define bFM0P_INTREQ_EXC02MON_NMI              *((volatile unsigned int*)(0x42620200UL))
#define bFM0P_INTREQ_EXC02MON_HWINT            *((volatile unsigned int*)(0x42620204UL))
#define bFM0P_INTREQ_IRQ00MON_FCSINT           *((volatile unsigned int*)(0x42620280UL))
#define bFM0P_INTREQ_IRQ01MON_SWWDTINT         *((volatile unsigned int*)(0x42620300UL))
#define bFM0P_INTREQ_IRQ02MON_LVDINT           *((volatile unsigned int*)(0x42620380UL))
#define bFM0P_INTREQ_IRQ03MON_WAVE0INT0        *((volatile unsigned int*)(0x42620400UL))
#define bFM0P_INTREQ_IRQ03MON_WAVE0INT1        *((volatile unsigned int*)(0x42620404UL))
#define bFM0P_INTREQ_IRQ03MON_WAVE0INT2        *((volatile unsigned int*)(0x42620408UL))
#define bFM0P_INTREQ_IRQ03MON_WAVE0INT3        *((volatile unsigned int*)(0x4262040CUL))
#define bFM0P_INTREQ_IRQ03MON_WAVE1INT0        *((volatile unsigned int*)(0x42620410UL))
#define bFM0P_INTREQ_IRQ03MON_WAVE1INT1        *((volatile unsigned int*)(0x42620414UL))
#define bFM0P_INTREQ_IRQ03MON_WAVE1INT2        *((volatile unsigned int*)(0x42620418UL))
#define bFM0P_INTREQ_IRQ03MON_WAVE1INT3        *((volatile unsigned int*)(0x4262041CUL))
#define bFM0P_INTREQ_IRQ03MON_WAVE2INT0        *((volatile unsigned int*)(0x42620420UL))
#define bFM0P_INTREQ_IRQ03MON_WAVE2INT1        *((volatile unsigned int*)(0x42620424UL))
#define bFM0P_INTREQ_IRQ03MON_WAVE2INT2        *((volatile unsigned int*)(0x42620428UL))
#define bFM0P_INTREQ_IRQ03MON_WAVE2INT3        *((volatile unsigned int*)(0x4262042CUL))
#define bFM0P_INTREQ_IRQ04MON_EXTINT0          *((volatile unsigned int*)(0x42620480UL))
#define bFM0P_INTREQ_IRQ04MON_EXTINT1          *((volatile unsigned int*)(0x42620484UL))
#define bFM0P_INTREQ_IRQ04MON_EXTINT2          *((volatile unsigned int*)(0x42620488UL))
#define bFM0P_INTREQ_IRQ04MON_EXTINT3          *((volatile unsigned int*)(0x4262048CUL))
#define bFM0P_INTREQ_IRQ04MON_EXTINT4          *((volatile unsigned int*)(0x42620490UL))
#define bFM0P_INTREQ_IRQ04MON_EXTINT5          *((volatile unsigned int*)(0x42620494UL))
#define bFM0P_INTREQ_IRQ04MON_EXTINT6          *((volatile unsigned int*)(0x42620498UL))
#define bFM0P_INTREQ_IRQ04MON_EXTINT7          *((volatile unsigned int*)(0x4262049CUL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT8          *((volatile unsigned int*)(0x42620500UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT9          *((volatile unsigned int*)(0x42620504UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT10         *((volatile unsigned int*)(0x42620508UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT11         *((volatile unsigned int*)(0x4262050CUL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT12         *((volatile unsigned int*)(0x42620510UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT13         *((volatile unsigned int*)(0x42620514UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT14         *((volatile unsigned int*)(0x42620518UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT15         *((volatile unsigned int*)(0x4262051CUL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT16         *((volatile unsigned int*)(0x42620520UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT17         *((volatile unsigned int*)(0x42620524UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT18         *((volatile unsigned int*)(0x42620528UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT19         *((volatile unsigned int*)(0x4262052CUL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT20         *((volatile unsigned int*)(0x42620530UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT21         *((volatile unsigned int*)(0x42620534UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT22         *((volatile unsigned int*)(0x42620538UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT23         *((volatile unsigned int*)(0x4262053CUL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT24         *((volatile unsigned int*)(0x42620540UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT25         *((volatile unsigned int*)(0x42620544UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT26         *((volatile unsigned int*)(0x42620548UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT27         *((volatile unsigned int*)(0x4262054CUL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT28         *((volatile unsigned int*)(0x42620550UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT29         *((volatile unsigned int*)(0x42620554UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT30         *((volatile unsigned int*)(0x42620558UL))
#define bFM0P_INTREQ_IRQ05MON_EXTINT31         *((volatile unsigned int*)(0x4262055CUL))
#define bFM0P_INTREQ_IRQ06MON_TIMINT0          *((volatile unsigned int*)(0x42620580UL))
#define bFM0P_INTREQ_IRQ06MON_TIMINT1          *((volatile unsigned int*)(0x42620584UL))
#define bFM0P_INTREQ_IRQ06MON_QUD0INT0         *((volatile unsigned int*)(0x42620588UL))
#define bFM0P_INTREQ_IRQ06MON_QUD0INT1         *((volatile unsigned int*)(0x4262058CUL))
#define bFM0P_INTREQ_IRQ06MON_QUD0INT2         *((volatile unsigned int*)(0x42620590UL))
#define bFM0P_INTREQ_IRQ06MON_QUD0INT3         *((volatile unsigned int*)(0x42620594UL))
#define bFM0P_INTREQ_IRQ06MON_QUD0INT4         *((volatile unsigned int*)(0x42620598UL))
#define bFM0P_INTREQ_IRQ06MON_QUD0INT5         *((volatile unsigned int*)(0x4262059CUL))
#define bFM0P_INTREQ_IRQ06MON_QUD1INT0         *((volatile unsigned int*)(0x426205A0UL))
#define bFM0P_INTREQ_IRQ06MON_QUD1INT1         *((volatile unsigned int*)(0x426205A4UL))
#define bFM0P_INTREQ_IRQ06MON_QUD1INT2         *((volatile unsigned int*)(0x426205A8UL))
#define bFM0P_INTREQ_IRQ06MON_QUD1INT3         *((volatile unsigned int*)(0x426205ACUL))
#define bFM0P_INTREQ_IRQ06MON_QUD1INT4         *((volatile unsigned int*)(0x426205B0UL))
#define bFM0P_INTREQ_IRQ06MON_QUD1INT5         *((volatile unsigned int*)(0x426205B4UL))
#define bFM0P_INTREQ_IRQ06MON_QUD2INT0         *((volatile unsigned int*)(0x426205B8UL))
#define bFM0P_INTREQ_IRQ06MON_QUD2INT1         *((volatile unsigned int*)(0x426205BCUL))
#define bFM0P_INTREQ_IRQ06MON_QUD2INT2         *((volatile unsigned int*)(0x426205C0UL))
#define bFM0P_INTREQ_IRQ06MON_QUD2INT3         *((volatile unsigned int*)(0x426205C4UL))
#define bFM0P_INTREQ_IRQ06MON_QUD2INT4         *((volatile unsigned int*)(0x426205C8UL))
#define bFM0P_INTREQ_IRQ06MON_QUD2INT5         *((volatile unsigned int*)(0x426205CCUL))
#define bFM0P_INTREQ_IRQ07MON_MFSINT0          *((volatile unsigned int*)(0x42620600UL))
#define bFM0P_INTREQ_IRQ07MON_MFSINT1          *((volatile unsigned int*)(0x42620604UL))
#define bFM0P_INTREQ_IRQ08MON_MFSINT0          *((volatile unsigned int*)(0x42620680UL))
#define bFM0P_INTREQ_IRQ08MON_MFSINT1          *((volatile unsigned int*)(0x42620684UL))
#define bFM0P_INTREQ_IRQ08MON_MFSINT2          *((volatile unsigned int*)(0x42620688UL))
#define bFM0P_INTREQ_IRQ08MON_MFSINT3          *((volatile unsigned int*)(0x4262068CUL))
#define bFM0P_INTREQ_IRQ09MON_MFSINT0          *((volatile unsigned int*)(0x42620700UL))
#define bFM0P_INTREQ_IRQ09MON_MFSINT1          *((volatile unsigned int*)(0x42620704UL))
#define bFM0P_INTREQ_IRQ10MON_MFSINT0          *((volatile unsigned int*)(0x42620780UL))
#define bFM0P_INTREQ_IRQ10MON_MFSINT1          *((volatile unsigned int*)(0x42620784UL))
#define bFM0P_INTREQ_IRQ10MON_MFSINT2          *((volatile unsigned int*)(0x42620788UL))
#define bFM0P_INTREQ_IRQ10MON_MFSINT3          *((volatile unsigned int*)(0x4262078CUL))
#define bFM0P_INTREQ_IRQ11MON_MFSINT0          *((volatile unsigned int*)(0x42620800UL))
#define bFM0P_INTREQ_IRQ11MON_MFSINT1          *((volatile unsigned int*)(0x42620804UL))
#define bFM0P_INTREQ_IRQ12MON_MFSINT0          *((volatile unsigned int*)(0x42620880UL))
#define bFM0P_INTREQ_IRQ12MON_MFSINT1          *((volatile unsigned int*)(0x42620884UL))
#define bFM0P_INTREQ_IRQ12MON_MFSINT2          *((volatile unsigned int*)(0x42620888UL))
#define bFM0P_INTREQ_IRQ12MON_MFSINT3          *((volatile unsigned int*)(0x4262088CUL))
#define bFM0P_INTREQ_IRQ13MON_MFSINT0          *((volatile unsigned int*)(0x42620900UL))
#define bFM0P_INTREQ_IRQ13MON_MFSINT1          *((volatile unsigned int*)(0x42620904UL))
#define bFM0P_INTREQ_IRQ14MON_MFSINT0          *((volatile unsigned int*)(0x42620980UL))
#define bFM0P_INTREQ_IRQ14MON_MFSINT1          *((volatile unsigned int*)(0x42620984UL))
#define bFM0P_INTREQ_IRQ14MON_MFSINT2          *((volatile unsigned int*)(0x42620988UL))
#define bFM0P_INTREQ_IRQ14MON_MFSINT3          *((volatile unsigned int*)(0x4262098CUL))
#define bFM0P_INTREQ_IRQ15MON_MFSINT0          *((volatile unsigned int*)(0x42620A00UL))
#define bFM0P_INTREQ_IRQ15MON_MFSINT1          *((volatile unsigned int*)(0x42620A04UL))
#define bFM0P_INTREQ_IRQ16MON_MFSINT0          *((volatile unsigned int*)(0x42620A80UL))
#define bFM0P_INTREQ_IRQ16MON_MFSINT1          *((volatile unsigned int*)(0x42620A84UL))
#define bFM0P_INTREQ_IRQ16MON_MFSINT2          *((volatile unsigned int*)(0x42620A88UL))
#define bFM0P_INTREQ_IRQ16MON_MFSINT3          *((volatile unsigned int*)(0x42620A8CUL))
#define bFM0P_INTREQ_IRQ17MON_MFSINT0          *((volatile unsigned int*)(0x42620B00UL))
#define bFM0P_INTREQ_IRQ17MON_MFSINT1          *((volatile unsigned int*)(0x42620B04UL))
#define bFM0P_INTREQ_IRQ18MON_MFSINT0          *((volatile unsigned int*)(0x42620B80UL))
#define bFM0P_INTREQ_IRQ18MON_MFSINT1          *((volatile unsigned int*)(0x42620B84UL))
#define bFM0P_INTREQ_IRQ18MON_MFSINT2          *((volatile unsigned int*)(0x42620B88UL))
#define bFM0P_INTREQ_IRQ18MON_MFSINT3          *((volatile unsigned int*)(0x42620B8CUL))
#define bFM0P_INTREQ_IRQ19MON_MFSINT0          *((volatile unsigned int*)(0x42620C00UL))
#define bFM0P_INTREQ_IRQ19MON_MFSINT1          *((volatile unsigned int*)(0x42620C04UL))
#define bFM0P_INTREQ_IRQ19MON_DMAINT0          *((volatile unsigned int*)(0x42620C10UL))
#define bFM0P_INTREQ_IRQ20MON_MFSINT0          *((volatile unsigned int*)(0x42620C80UL))
#define bFM0P_INTREQ_IRQ20MON_MFSINT1          *((volatile unsigned int*)(0x42620C84UL))
#define bFM0P_INTREQ_IRQ20MON_MFSINT2          *((volatile unsigned int*)(0x42620C88UL))
#define bFM0P_INTREQ_IRQ20MON_MFSINT3          *((volatile unsigned int*)(0x42620C8CUL))
#define bFM0P_INTREQ_IRQ20MON_DMAINT1          *((volatile unsigned int*)(0x42620C90UL))
#define bFM0P_INTREQ_IRQ21MON_MFSINT0          *((volatile unsigned int*)(0x42620D00UL))
#define bFM0P_INTREQ_IRQ21MON_MFSINT1          *((volatile unsigned int*)(0x42620D04UL))
#define bFM0P_INTREQ_IRQ21MON_DMAINT2          *((volatile unsigned int*)(0x42620D10UL))
#define bFM0P_INTREQ_IRQ22MON_MFSINT0          *((volatile unsigned int*)(0x42620D80UL))
#define bFM0P_INTREQ_IRQ22MON_MFSINT1          *((volatile unsigned int*)(0x42620D84UL))
#define bFM0P_INTREQ_IRQ22MON_MFSINT2          *((volatile unsigned int*)(0x42620D88UL))
#define bFM0P_INTREQ_IRQ22MON_MFSINT3          *((volatile unsigned int*)(0x42620D8CUL))
#define bFM0P_INTREQ_IRQ22MON_DMAINT3          *((volatile unsigned int*)(0x42620D90UL))
#define bFM0P_INTREQ_IRQ23MON_PPGINT0          *((volatile unsigned int*)(0x42620E00UL))
#define bFM0P_INTREQ_IRQ23MON_PPGINT1          *((volatile unsigned int*)(0x42620E04UL))
#define bFM0P_INTREQ_IRQ23MON_PPGINT2          *((volatile unsigned int*)(0x42620E08UL))
#define bFM0P_INTREQ_IRQ23MON_PPGINT3          *((volatile unsigned int*)(0x42620E0CUL))
#define bFM0P_INTREQ_IRQ23MON_PPGINT4          *((volatile unsigned int*)(0x42620E10UL))
#define bFM0P_INTREQ_IRQ23MON_PPGINT5          *((volatile unsigned int*)(0x42620E14UL))
#define bFM0P_INTREQ_IRQ23MON_PPGINT6          *((volatile unsigned int*)(0x42620E18UL))
#define bFM0P_INTREQ_IRQ23MON_PPGINT7          *((volatile unsigned int*)(0x42620E1CUL))
#define bFM0P_INTREQ_IRQ23MON_PPGINT8          *((volatile unsigned int*)(0x42620E20UL))
#define bFM0P_INTREQ_IRQ24MON_MOSCINT          *((volatile unsigned int*)(0x42620E80UL))
#define bFM0P_INTREQ_IRQ24MON_SOSCINT          *((volatile unsigned int*)(0x42620E84UL))
#define bFM0P_INTREQ_IRQ24MON_MPLLINT          *((volatile unsigned int*)(0x42620E88UL))
#define bFM0P_INTREQ_IRQ24MON_WCINT            *((volatile unsigned int*)(0x42620E90UL))
#define bFM0P_INTREQ_IRQ24MON_RTCINT           *((volatile unsigned int*)(0x42620E94UL))
#define bFM0P_INTREQ_IRQ25MON_ADCINT0PC        *((volatile unsigned int*)(0x42620F00UL))
#define bFM0P_INTREQ_IRQ25MON_ADCINT0SC        *((volatile unsigned int*)(0x42620F04UL))
#define bFM0P_INTREQ_IRQ25MON_ADCINT0FIFO      *((volatile unsigned int*)(0x42620F08UL))
#define bFM0P_INTREQ_IRQ25MON_ADCINT0CV        *((volatile unsigned int*)(0x42620F0CUL))
#define bFM0P_INTREQ_IRQ25MON_ADCINT0RC        *((volatile unsigned int*)(0x42620F10UL))
#define bFM0P_INTREQ_IRQ26MON_ADCINT0          *((volatile unsigned int*)(0x42620F80UL))
#define bFM0P_INTREQ_IRQ26MON_ADCINT1          *((volatile unsigned int*)(0x42620F84UL))
#define bFM0P_INTREQ_IRQ26MON_ADCINT2          *((volatile unsigned int*)(0x42620F88UL))
#define bFM0P_INTREQ_IRQ26MON_ADCINT3          *((volatile unsigned int*)(0x42620F8CUL))
#define bFM0P_INTREQ_IRQ26MON_ADCINT4          *((volatile unsigned int*)(0x42620F90UL))
#define bFM0P_INTREQ_IRQ27MON_ADCINT0          *((volatile unsigned int*)(0x42621000UL))
#define bFM0P_INTREQ_IRQ27MON_ADCINT1          *((volatile unsigned int*)(0x42621004UL))
#define bFM0P_INTREQ_IRQ27MON_ADCINT2          *((volatile unsigned int*)(0x42621008UL))
#define bFM0P_INTREQ_IRQ27MON_ADCINT3          *((volatile unsigned int*)(0x4262100CUL))
#define bFM0P_INTREQ_IRQ27MON_ADCINT4          *((volatile unsigned int*)(0x42621010UL))
#define bFM0P_INTREQ_IRQ27MON_LCDCINT          *((volatile unsigned int*)(0x42621014UL))
#define bFM0P_INTREQ_IRQ28MON_FRT0INT0         *((volatile unsigned int*)(0x42621080UL))
#define bFM0P_INTREQ_IRQ28MON_FRT0INT1         *((volatile unsigned int*)(0x42621084UL))
#define bFM0P_INTREQ_IRQ28MON_FRT0INT2         *((volatile unsigned int*)(0x42621088UL))
#define bFM0P_INTREQ_IRQ28MON_FRT0INT3         *((volatile unsigned int*)(0x4262108CUL))
#define bFM0P_INTREQ_IRQ28MON_FRT0INT4         *((volatile unsigned int*)(0x42621090UL))
#define bFM0P_INTREQ_IRQ28MON_FRT0INT5         *((volatile unsigned int*)(0x42621094UL))
#define bFM0P_INTREQ_IRQ28MON_FRT1INT0         *((volatile unsigned int*)(0x42621098UL))
#define bFM0P_INTREQ_IRQ28MON_FRT1INT1         *((volatile unsigned int*)(0x4262109CUL))
#define bFM0P_INTREQ_IRQ28MON_FRT1INT2         *((volatile unsigned int*)(0x426210A0UL))
#define bFM0P_INTREQ_IRQ28MON_FRT1INT3         *((volatile unsigned int*)(0x426210A4UL))
#define bFM0P_INTREQ_IRQ28MON_FRT1INT4         *((volatile unsigned int*)(0x426210A8UL))
#define bFM0P_INTREQ_IRQ28MON_FRT1INT5         *((volatile unsigned int*)(0x426210ACUL))
#define bFM0P_INTREQ_IRQ28MON_FRT2INT0         *((volatile unsigned int*)(0x426210B0UL))
#define bFM0P_INTREQ_IRQ28MON_FRT2INT1         *((volatile unsigned int*)(0x426210B4UL))
#define bFM0P_INTREQ_IRQ28MON_FRT2INT2         *((volatile unsigned int*)(0x426210B8UL))
#define bFM0P_INTREQ_IRQ28MON_FRT2INT3         *((volatile unsigned int*)(0x426210BCUL))
#define bFM0P_INTREQ_IRQ28MON_FRT2INT4         *((volatile unsigned int*)(0x426210C0UL))
#define bFM0P_INTREQ_IRQ28MON_FRT2INT5         *((volatile unsigned int*)(0x426210C4UL))
#define bFM0P_INTREQ_IRQ29MON_ICU0INT0         *((volatile unsigned int*)(0x42621100UL))
#define bFM0P_INTREQ_IRQ29MON_ICU0INT1         *((volatile unsigned int*)(0x42621104UL))
#define bFM0P_INTREQ_IRQ29MON_ICU0INT2         *((volatile unsigned int*)(0x42621108UL))
#define bFM0P_INTREQ_IRQ29MON_ICU0INT3         *((volatile unsigned int*)(0x4262110CUL))
#define bFM0P_INTREQ_IRQ29MON_ICU1INT0         *((volatile unsigned int*)(0x42621110UL))
#define bFM0P_INTREQ_IRQ29MON_ICU1INT1         *((volatile unsigned int*)(0x42621114UL))
#define bFM0P_INTREQ_IRQ29MON_ICU1INT2         *((volatile unsigned int*)(0x42621118UL))
#define bFM0P_INTREQ_IRQ29MON_ICU1INT3         *((volatile unsigned int*)(0x4262111CUL))
#define bFM0P_INTREQ_IRQ29MON_ICU2INT0         *((volatile unsigned int*)(0x42621120UL))
#define bFM0P_INTREQ_IRQ29MON_ICU2INT1         *((volatile unsigned int*)(0x42621124UL))
#define bFM0P_INTREQ_IRQ29MON_ICU2INT2         *((volatile unsigned int*)(0x42621128UL))
#define bFM0P_INTREQ_IRQ29MON_ICU2INT3         *((volatile unsigned int*)(0x4262112CUL))
#define bFM0P_INTREQ_IRQ30MON_OCU0INT0         *((volatile unsigned int*)(0x42621180UL))
#define bFM0P_INTREQ_IRQ30MON_OCU0INT1         *((volatile unsigned int*)(0x42621184UL))
#define bFM0P_INTREQ_IRQ30MON_OCU0INT2         *((volatile unsigned int*)(0x42621188UL))
#define bFM0P_INTREQ_IRQ30MON_OCU0INT3         *((volatile unsigned int*)(0x4262118CUL))
#define bFM0P_INTREQ_IRQ30MON_OCU0INT4         *((volatile unsigned int*)(0x42621190UL))
#define bFM0P_INTREQ_IRQ30MON_OCU0INT5         *((volatile unsigned int*)(0x42621194UL))
#define bFM0P_INTREQ_IRQ30MON_OCU1INT0         *((volatile unsigned int*)(0x42621198UL))
#define bFM0P_INTREQ_IRQ30MON_OCU1INT1         *((volatile unsigned int*)(0x4262119CUL))
#define bFM0P_INTREQ_IRQ30MON_OCU1INT2         *((volatile unsigned int*)(0x426211A0UL))
#define bFM0P_INTREQ_IRQ30MON_OCU1INT3         *((volatile unsigned int*)(0x426211A4UL))
#define bFM0P_INTREQ_IRQ30MON_OCU1INT4         *((volatile unsigned int*)(0x426211A8UL))
#define bFM0P_INTREQ_IRQ30MON_OCU1INT5         *((volatile unsigned int*)(0x426211ACUL))
#define bFM0P_INTREQ_IRQ30MON_OCU2INT0         *((volatile unsigned int*)(0x426211B0UL))
#define bFM0P_INTREQ_IRQ30MON_OCU2INT1         *((volatile unsigned int*)(0x426211B4UL))
#define bFM0P_INTREQ_IRQ30MON_OCU2INT2         *((volatile unsigned int*)(0x426211B8UL))
#define bFM0P_INTREQ_IRQ30MON_OCU2INT3         *((volatile unsigned int*)(0x426211BCUL))
#define bFM0P_INTREQ_IRQ30MON_OCU2INT4         *((volatile unsigned int*)(0x426211C0UL))
#define bFM0P_INTREQ_IRQ30MON_OCU2INT5         *((volatile unsigned int*)(0x426211C4UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT0           *((volatile unsigned int*)(0x42621200UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT1           *((volatile unsigned int*)(0x42621204UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT2           *((volatile unsigned int*)(0x42621208UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT3           *((volatile unsigned int*)(0x4262120CUL))
#define bFM0P_INTREQ_IRQ31MON_BTINT4           *((volatile unsigned int*)(0x42621210UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT5           *((volatile unsigned int*)(0x42621214UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT6           *((volatile unsigned int*)(0x42621218UL))
#define bFM0P_INTREQ_IRQ31MON_BTINT7           *((volatile unsigned int*)(0x4262121CUL))
#define bFM3_INTREQ_IRQ31MON_BTINT8            *((volatile unsigned int*)(0x42621220UL))
#define bFM3_INTREQ_IRQ31MON_BTINT9            *((volatile unsigned int*)(0x42621224UL))
#define bFM3_INTREQ_IRQ31MON_BTINT10           *((volatile unsigned int*)(0x42621228UL))
#define bFM3_INTREQ_IRQ31MON_BTINT11           *((volatile unsigned int*)(0x4262122CUL))
#define bFM3_INTREQ_IRQ31MON_BTINT12           *((volatile unsigned int*)(0x42621230UL))
#define bFM3_INTREQ_IRQ31MON_BTINT13           *((volatile unsigned int*)(0x42621234UL))
#define bFM3_INTREQ_IRQ31MON_BTINT14           *((volatile unsigned int*)(0x42621238UL))
#define bFM3_INTREQ_IRQ31MON_BTINT15           *((volatile unsigned int*)(0x4262123CUL))
#define bFM0P_INTREQ_IRQ31MON_FLASHINT         *((volatile unsigned int*)(0x4262126CUL))

