furjie/Single-BLDC-driver-and-app/s6e1a1.h
/* GPIO registers */
#define bFM0P_GPIO_PFR0_P00                     *((volatile unsigned int*)(0x42660000UL))
#define bFM0P_GPIO_PFR0_P01                     *((volatile unsigned int*)(0x42660004UL))
#define bFM0P_GPIO_PFR0_P02                     *((volatile unsigned int*)(0x42660008UL))
#define bFM0P_GPIO_PFR0_P03                     *((volatile unsigned int*)(0x4266000CUL))
#define bFM0P_GPIO_PFR0_P04                     *((volatile unsigned int*)(0x42660010UL))
#define bFM0P_GPIO_PFR0_P0F                     *((volatile unsigned int*)(0x4266003CUL))
#define bFM0P_GPIO_PFR1_P10                     *((volatile unsigned int*)(0x42660080UL))
#define bFM0P_GPIO_PFR1_P11                     *((volatile unsigned int*)(0x42660084UL))
#define bFM0P_GPIO_PFR1_P12                     *((volatile unsigned int*)(0x42660088UL))
#define bFM0P_GPIO_PFR1_P13                     *((volatile unsigned int*)(0x4266008CUL))
#define bFM0P_GPIO_PFR1_P14                     *((volatile unsigned int*)(0x42660090UL))
#define bFM0P_GPIO_PFR1_P15                     *((volatile unsigned int*)(0x42660094UL))
#define bFM0P_GPIO_PFR2_P21                     *((volatile unsigned int*)(0x42660104UL))
#define bFM0P_GPIO_PFR2_P22                     *((volatile unsigned int*)(0x42660108UL))
#define bFM0P_GPIO_PFR2_P23                     *((volatile unsigned int*)(0x4266010CUL))
#define bFM0P_GPIO_PFR3_P39                     *((volatile unsigned int*)(0x426601A4UL))
#define bFM0P_GPIO_PFR3_P3A                     *((volatile unsigned int*)(0x426601A8UL))
#define bFM0P_GPIO_PFR3_P3B                     *((volatile unsigned int*)(0x426601ACUL))
#define bFM0P_GPIO_PFR3_P3C                     *((volatile unsigned int*)(0x426601B0UL))
#define bFM0P_GPIO_PFR3_P3D                     *((volatile unsigned int*)(0x426601B4UL))
#define bFM0P_GPIO_PFR3_P3E                     *((volatile unsigned int*)(0x426601B8UL))
#define bFM0P_GPIO_PFR3_P3F                     *((volatile unsigned int*)(0x426601BCUL))
#define bFM0P_GPIO_PFR4_P46                     *((volatile unsigned int*)(0x42660218UL))
#define bFM0P_GPIO_PFR4_P47                     *((volatile unsigned int*)(0x4266021CUL))
#define bFM0P_GPIO_PFR4_P49                     *((volatile unsigned int*)(0x42660224UL))
#define bFM0P_GPIO_PFR4_P4A                     *((volatile unsigned int*)(0x42660228UL))
#define bFM0P_GPIO_PFR5_P50                     *((volatile unsigned int*)(0x42660280UL))
#define bFM0P_GPIO_PFR5_P51                     *((volatile unsigned int*)(0x42660284UL))
#define bFM0P_GPIO_PFR5_P52                     *((volatile unsigned int*)(0x42660288UL))
#define bFM0P_GPIO_PFR6_P60                     *((volatile unsigned int*)(0x42660300UL))
#define bFM0P_GPIO_PFR6_P61                     *((volatile unsigned int*)(0x42660304UL))
#define bFM0P_GPIO_PFR8_P80                     *((volatile unsigned int*)(0x42660400UL))
#define bFM0P_GPIO_PFR8_P81                     *((volatile unsigned int*)(0x42660404UL))
#define bFM0P_GPIO_PFR8_P82                     *((volatile unsigned int*)(0x42660408UL))
#define bFM0P_GPIO_PFRE_PE0                     *((volatile unsigned int*)(0x42660700UL))
#define bFM0P_GPIO_PFRE_PE2                     *((volatile unsigned int*)(0x42660708UL))
#define bFM0P_GPIO_PFRE_PE3                     *((volatile unsigned int*)(0x4266070CUL))
#define bFM0P_GPIO_PCR0_P00                     *((volatile unsigned int*)(0x42662000UL))
#define bFM0P_GPIO_PCR0_P01                     *((volatile unsigned int*)(0x42662004UL))
#define bFM0P_GPIO_PCR0_P02                     *((volatile unsigned int*)(0x42662008UL))
#define bFM0P_GPIO_PCR0_P03                     *((volatile unsigned int*)(0x4266200CUL))
#define bFM0P_GPIO_PCR0_P04                     *((volatile unsigned int*)(0x42662010UL))
#define bFM0P_GPIO_PCR0_P0F                     *((volatile unsigned int*)(0x4266203CUL))
#define bFM0P_GPIO_PCR1_P10                     *((volatile unsigned int*)(0x42662080UL))
#define bFM0P_GPIO_PCR1_P11                     *((volatile unsigned int*)(0x42662084UL))
#define bFM0P_GPIO_PCR1_P12                     *((volatile unsigned int*)(0x42662088UL))
#define bFM0P_GPIO_PCR1_P13                     *((volatile unsigned int*)(0x4266208CUL))
#define bFM0P_GPIO_PCR1_P14                     *((volatile unsigned int*)(0x42662090UL))
#define bFM0P_GPIO_PCR1_P15                     *((volatile unsigned int*)(0x42662094UL))
#define bFM0P_GPIO_PCR2_P21                     *((volatile unsigned int*)(0x42662104UL))
#define bFM0P_GPIO_PCR2_P22                     *((volatile unsigned int*)(0x42662108UL))
#define bFM0P_GPIO_PCR2_P23                     *((volatile unsigned int*)(0x4266210CUL))
#define bFM0P_GPIO_PCR3_P39                     *((volatile unsigned int*)(0x426621A4UL))
#define bFM0P_GPIO_PCR3_P3A                     *((volatile unsigned int*)(0x426621A8UL))
#define bFM0P_GPIO_PCR3_P3B                     *((volatile unsigned int*)(0x426621ACUL))
#define bFM0P_GPIO_PCR3_P3C                     *((volatile unsigned int*)(0x426621B0UL))
#define bFM0P_GPIO_PCR3_P3D                     *((volatile unsigned int*)(0x426621B4UL))
#define bFM0P_GPIO_PCR3_P3E                     *((volatile unsigned int*)(0x426621B8UL))
#define bFM0P_GPIO_PCR3_P3F                     *((volatile unsigned int*)(0x426621BCUL))
#define bFM0P_GPIO_PCR4_P46                     *((volatile unsigned int*)(0x42662218UL))
#define bFM0P_GPIO_PCR4_P47                     *((volatile unsigned int*)(0x4266221CUL))
#define bFM0P_GPIO_PCR4_P49                     *((volatile unsigned int*)(0x42662224UL))
#define bFM0P_GPIO_PCR4_P4A                     *((volatile unsigned int*)(0x42662228UL))
#define bFM0P_GPIO_PCR5_P50                     *((volatile unsigned int*)(0x42662280UL))
#define bFM0P_GPIO_PCR5_P51                     *((volatile unsigned int*)(0x42662284UL))
#define bFM0P_GPIO_PCR5_P52                     *((volatile unsigned int*)(0x42662288UL))
#define bFM0P_GPIO_PCR6_P60                     *((volatile unsigned int*)(0x42662300UL))
#define bFM0P_GPIO_PCR6_P61                     *((volatile unsigned int*)(0x42662304UL))
#define bFM0P_GPIO_PCR8_P80                     *((volatile unsigned int*)(0x42662400UL))
#define bFM0P_GPIO_PCR8_P81                     *((volatile unsigned int*)(0x42662404UL))
#define bFM0P_GPIO_PCR8_P82                     *((volatile unsigned int*)(0x42662408UL))
#define bFM0P_GPIO_PCRE_PE0                     *((volatile unsigned int*)(0x42662700UL))
#define bFM0P_GPIO_PCRE_PE2                     *((volatile unsigned int*)(0x42662708UL))
#define bFM0P_GPIO_PCRE_PE3                     *((volatile unsigned int*)(0x4266270CUL))
#define bFM0P_GPIO_DDR0_P00                     *((volatile unsigned int*)(0x42664000UL))
#define bFM0P_GPIO_DDR0_P01                     *((volatile unsigned int*)(0x42664004UL))
#define bFM0P_GPIO_DDR0_P02                     *((volatile unsigned int*)(0x42664008UL))
#define bFM0P_GPIO_DDR0_P03                     *((volatile unsigned int*)(0x4266400CUL))
#define bFM0P_GPIO_DDR0_P04                     *((volatile unsigned int*)(0x42664010UL))
#define bFM0P_GPIO_DDR0_P0F                     *((volatile unsigned int*)(0x4266403CUL))
#define bFM0P_GPIO_DDR1_P10                     *((volatile unsigned int*)(0x42664080UL))
#define bFM0P_GPIO_DDR1_P11                     *((volatile unsigned int*)(0x42664084UL))
#define bFM0P_GPIO_DDR1_P12                     *((volatile unsigned int*)(0x42664088UL))
#define bFM0P_GPIO_DDR1_P13                     *((volatile unsigned int*)(0x4266408CUL))
#define bFM0P_GPIO_DDR1_P14                     *((volatile unsigned int*)(0x42664090UL))
#define bFM0P_GPIO_DDR1_P15                     *((volatile unsigned int*)(0x42664094UL))
#define bFM0P_GPIO_DDR2_P21                     *((volatile unsigned int*)(0x42664104UL))
#define bFM0P_GPIO_DDR2_P22                     *((volatile unsigned int*)(0x42664108UL))
#define bFM0P_GPIO_DDR2_P23                     *((volatile unsigned int*)(0x4266410CUL))
#define bFM0P_GPIO_DDR3_P39                     *((volatile unsigned int*)(0x426641A4UL))
#define bFM0P_GPIO_DDR3_P3A                     *((volatile unsigned int*)(0x426641A8UL))
#define bFM0P_GPIO_DDR3_P3B                     *((volatile unsigned int*)(0x426641ACUL))
#define bFM0P_GPIO_DDR3_P3C                     *((volatile unsigned int*)(0x426641B0UL))
#define bFM0P_GPIO_DDR3_P3D                     *((volatile unsigned int*)(0x426641B4UL))
#define bFM0P_GPIO_DDR3_P3E                     *((volatile unsigned int*)(0x426641B8UL))
#define bFM0P_GPIO_DDR3_P3F                     *((volatile unsigned int*)(0x426641BCUL))
#define bFM0P_GPIO_DDR4_P46                     *((volatile unsigned int*)(0x42664218UL))
#define bFM0P_GPIO_DDR4_P47                     *((volatile unsigned int*)(0x4266421CUL))
#define bFM0P_GPIO_DDR4_P49                     *((volatile unsigned int*)(0x42664224UL))
#define bFM0P_GPIO_DDR4_P4A                     *((volatile unsigned int*)(0x42664228UL))
#define bFM0P_GPIO_DDR5_P50                     *((volatile unsigned int*)(0x42664280UL))
#define bFM0P_GPIO_DDR5_P51                     *((volatile unsigned int*)(0x42664284UL))
#define bFM0P_GPIO_DDR5_P52                     *((volatile unsigned int*)(0x42664288UL))
#define bFM0P_GPIO_DDR6_P60                     *((volatile unsigned int*)(0x42664300UL))
#define bFM0P_GPIO_DDR6_P61                     *((volatile unsigned int*)(0x42664304UL))
#define bFM0P_GPIO_DDR8_P80                     *((volatile unsigned int*)(0x42664400UL))
#define bFM0P_GPIO_DDR8_P81                     *((volatile unsigned int*)(0x42664404UL))
#define bFM0P_GPIO_DDR8_P82                     *((volatile unsigned int*)(0x42664408UL))
#define bFM0P_GPIO_DDRE_PE0                     *((volatile unsigned int*)(0x42664700UL))
#define bFM0P_GPIO_DDRE_PE2                     *((volatile unsigned int*)(0x42664708UL))
#define bFM0P_GPIO_DDRE_PE3                     *((volatile unsigned int*)(0x4266470CUL))
#define bFM0P_GPIO_PDIR0_P00                    *((volatile unsigned int*)(0x42666000UL))
#define bFM0P_GPIO_PDIR0_P01                    *((volatile unsigned int*)(0x42666004UL))
#define bFM0P_GPIO_PDIR0_P02                    *((volatile unsigned int*)(0x42666008UL))
#define bFM0P_GPIO_PDIR0_P03                    *((volatile unsigned int*)(0x4266600CUL))
#define bFM0P_GPIO_PDIR0_P04                    *((volatile unsigned int*)(0x42666010UL))
#define bFM0P_GPIO_PDIR0_P0F                    *((volatile unsigned int*)(0x4266603CUL))
#define bFM0P_GPIO_PDIR1_P10                    *((volatile unsigned int*)(0x42666080UL))
#define bFM0P_GPIO_PDIR1_P11                    *((volatile unsigned int*)(0x42666084UL))
#define bFM0P_GPIO_PDIR1_P12                    *((volatile unsigned int*)(0x42666088UL))
#define bFM0P_GPIO_PDIR1_P13                    *((volatile unsigned int*)(0x4266608CUL))
#define bFM0P_GPIO_PDIR1_P14                    *((volatile unsigned int*)(0x42666090UL))
#define bFM0P_GPIO_PDIR1_P15                    *((volatile unsigned int*)(0x42666094UL))
#define bFM0P_GPIO_PDIR2_P21                    *((volatile unsigned int*)(0x42666104UL))
#define bFM0P_GPIO_PDIR2_P22                    *((volatile unsigned int*)(0x42666108UL))
#define bFM0P_GPIO_PDIR2_P23                    *((volatile unsigned int*)(0x4266610CUL))
#define bFM0P_GPIO_PDIR3_P39                    *((volatile unsigned int*)(0x426661A4UL))
#define bFM0P_GPIO_PDIR3_P3A                    *((volatile unsigned int*)(0x426661A8UL))
#define bFM0P_GPIO_PDIR3_P3B                    *((volatile unsigned int*)(0x426661ACUL))
#define bFM0P_GPIO_PDIR3_P3C                    *((volatile unsigned int*)(0x426661B0UL))
#define bFM0P_GPIO_PDIR3_P3D                    *((volatile unsigned int*)(0x426661B4UL))
#define bFM0P_GPIO_PDIR3_P3E                    *((volatile unsigned int*)(0x426661B8UL))
#define bFM0P_GPIO_PDIR3_P3F                    *((volatile unsigned int*)(0x426661BCUL))
#define bFM0P_GPIO_PDIR4_P46                    *((volatile unsigned int*)(0x42666218UL))
#define bFM0P_GPIO_PDIR4_P47                    *((volatile unsigned int*)(0x4266621CUL))
#define bFM0P_GPIO_PDIR4_P49                    *((volatile unsigned int*)(0x42666224UL))
#define bFM0P_GPIO_PDIR4_P4A                    *((volatile unsigned int*)(0x42666228UL))
#define bFM0P_GPIO_PDIR5_P50                    *((volatile unsigned int*)(0x42666280UL))
#define bFM0P_GPIO_PDIR5_P51                    *((volatile unsigned int*)(0x42666284UL))
#define bFM0P_GPIO_PDIR5_P52                    *((volatile unsigned int*)(0x42666288UL))
#define bFM0P_GPIO_PDIR6_P60                    *((volatile unsigned int*)(0x42666300UL))
#define bFM0P_GPIO_PDIR6_P61                    *((volatile unsigned int*)(0x42666304UL))
#define bFM0P_GPIO_PDIR8_P80                    *((volatile unsigned int*)(0x42666400UL))
#define bFM0P_GPIO_PDIR8_P81                    *((volatile unsigned int*)(0x42666404UL))
#define bFM0P_GPIO_PDIR8_P82                    *((volatile unsigned int*)(0x42666408UL))
#define bFM0P_GPIO_PDIRE_PE0                    *((volatile unsigned int*)(0x42666700UL))
#define bFM0P_GPIO_PDIRE_PE2                    *((volatile unsigned int*)(0x42666708UL))
#define bFM0P_GPIO_PDIRE_PE3                    *((volatile unsigned int*)(0x4266670CUL))
#define bFM0P_GPIO_PDOR0_P00                    *((volatile unsigned int*)(0x42668000UL))
#define bFM0P_GPIO_PDOR0_P01                    *((volatile unsigned int*)(0x42668004UL))
#define bFM0P_GPIO_PDOR0_P02                    *((volatile unsigned int*)(0x42668008UL))
#define bFM0P_GPIO_PDOR0_P03                    *((volatile unsigned int*)(0x4266800CUL))
#define bFM0P_GPIO_PDOR0_P04                    *((volatile unsigned int*)(0x42668010UL))
#define bFM0P_GPIO_PDOR0_P0F                    *((volatile unsigned int*)(0x4266803CUL))
#define bFM0P_GPIO_PDOR1_P10                    *((volatile unsigned int*)(0x42668080UL))
#define bFM0P_GPIO_PDOR1_P11                    *((volatile unsigned int*)(0x42668084UL))
#define bFM0P_GPIO_PDOR1_P12                    *((volatile unsigned int*)(0x42668088UL))
#define bFM0P_GPIO_PDOR1_P13                    *((volatile unsigned int*)(0x4266808CUL))
#define bFM0P_GPIO_PDOR1_P14                    *((volatile unsigned int*)(0x42668090UL))
#define bFM0P_GPIO_PDOR1_P15                    *((volatile unsigned int*)(0x42668094UL))
#define bFM0P_GPIO_PDOR2_P21                    *((volatile unsigned int*)(0x42668104UL))
#define bFM0P_GPIO_PDOR2_P22                    *((volatile unsigned int*)(0x42668108UL))
#define bFM0P_GPIO_PDOR2_P23                    *((volatile unsigned int*)(0x4266810CUL))
#define bFM0P_GPIO_PDOR3_P39                    *((volatile unsigned int*)(0x426681A4UL))
#define bFM0P_GPIO_PDOR3_P3A                    *((volatile unsigned int*)(0x426681A8UL))
#define bFM0P_GPIO_PDOR3_P3B                    *((volatile unsigned int*)(0x426681ACUL))
#define bFM0P_GPIO_PDOR3_P3C                    *((volatile unsigned int*)(0x426681B0UL))
#define bFM0P_GPIO_PDOR3_P3D                    *((volatile unsigned int*)(0x426681B4UL))
#define bFM0P_GPIO_PDOR3_P3E                    *((volatile unsigned int*)(0x426681B8UL))
#define bFM0P_GPIO_PDOR3_P3F                    *((volatile unsigned int*)(0x426681BCUL))
#define bFM0P_GPIO_PDOR4_P46                    *((volatile unsigned int*)(0x42668218UL))
#define bFM0P_GPIO_PDOR4_P47                    *((volatile unsigned int*)(0x4266821CUL))
#define bFM0P_GPIO_PDOR4_P49                    *((volatile unsigned int*)(0x42668224UL))
#define bFM0P_GPIO_PDOR4_P4A                    *((volatile unsigned int*)(0x42668228UL))
#define bFM0P_GPIO_PDOR5_P50                    *((volatile unsigned int*)(0x42668280UL))
#define bFM0P_GPIO_PDOR5_P51                    *((volatile unsigned int*)(0x42668284UL))
#define bFM0P_GPIO_PDOR5_P52                    *((volatile unsigned int*)(0x42668288UL))
#define bFM0P_GPIO_PDOR6_P60                    *((volatile unsigned int*)(0x42668300UL))
#define bFM0P_GPIO_PDOR6_P61                    *((volatile unsigned int*)(0x42668304UL))
#define bFM0P_GPIO_PDOR8_P80                    *((volatile unsigned int*)(0x42668400UL))
#define bFM0P_GPIO_PDOR8_P81                    *((volatile unsigned int*)(0x42668404UL))
#define bFM0P_GPIO_PDOR8_P82                    *((volatile unsigned int*)(0x42668408UL))
#define bFM0P_GPIO_PDORE_PE0                    *((volatile unsigned int*)(0x42668700UL))
#define bFM0P_GPIO_PDORE_PE2                    *((volatile unsigned int*)(0x42668708UL))
#define bFM0P_GPIO_PDORE_PE3                    *((volatile unsigned int*)(0x4266870CUL))
#define bFM0P_GPIO_ADE_AN00                     *((volatile unsigned int*)(0x4266A000UL))
#define bFM0P_GPIO_ADE_AN01                     *((volatile unsigned int*)(0x4266A004UL))
#define bFM0P_GPIO_ADE_AN02                     *((volatile unsigned int*)(0x4266A008UL))
#define bFM0P_GPIO_ADE_AN03                     *((volatile unsigned int*)(0x4266A00CUL))
#define bFM0P_GPIO_ADE_AN04                     *((volatile unsigned int*)(0x4266A010UL))
#define bFM0P_GPIO_ADE_AN05                     *((volatile unsigned int*)(0x4266A014UL))
#define bFM0P_GPIO_ADE_AN06                     *((volatile unsigned int*)(0x4266A018UL))
#define bFM0P_GPIO_ADE_AN07                     *((volatile unsigned int*)(0x4266A01CUL))
#define bFM0P_GPIO_SPSR_SUBXC0                  *((volatile unsigned int*)(0x4266B000UL))
#define bFM0P_GPIO_SPSR_SUBXC1                  *((volatile unsigned int*)(0x4266B004UL))
#define bFM0P_GPIO_SPSR_MAINXC0                 *((volatile unsigned int*)(0x4266B008UL))
#define bFM0P_GPIO_SPSR_MAINXC1                 *((volatile unsigned int*)(0x4266B00CUL))
#define bFM0P_GPIO_EPFR00_NMIS                  *((volatile unsigned int*)(0x4266C000UL))
#define bFM0P_GPIO_EPFR00_CROUTE0               *((volatile unsigned int*)(0x4266C004UL))
#define bFM0P_GPIO_EPFR00_CROUTE1               *((volatile unsigned int*)(0x4266C008UL))
#define bFM0P_GPIO_EPFR00_RTCCOE0               *((volatile unsigned int*)(0x4266C010UL))
#define bFM0P_GPIO_EPFR00_RTCCOE1               *((volatile unsigned int*)(0x4266C014UL))
#define bFM0P_GPIO_EPFR00_SUBOUTE0              *((volatile unsigned int*)(0x4266C018UL))
#define bFM0P_GPIO_EPFR00_SUBOUTE1              *((volatile unsigned int*)(0x4266C01CUL))
#define bFM0P_GPIO_EPFR00_SWDEN                 *((volatile unsigned int*)(0x4266C040UL))
#define bFM0P_GPIO_EPFR01_RTO00E0               *((volatile unsigned int*)(0x4266C080UL))
#define bFM0P_GPIO_EPFR01_RTO00E1               *((volatile unsigned int*)(0x4266C084UL))
#define bFM0P_GPIO_EPFR01_RTO01E0               *((volatile unsigned int*)(0x4266C088UL))
#define bFM0P_GPIO_EPFR01_RTO01E1               *((volatile unsigned int*)(0x4266C08CUL))
#define bFM0P_GPIO_EPFR01_RTO02E0               *((volatile unsigned int*)(0x4266C090UL))
#define bFM0P_GPIO_EPFR01_RTO02E1               *((volatile unsigned int*)(0x4266C094UL))
#define bFM0P_GPIO_EPFR01_RTO03E0               *((volatile unsigned int*)(0x4266C098UL))
#define bFM0P_GPIO_EPFR01_RTO03E1               *((volatile unsigned int*)(0x4266C09CUL))
#define bFM0P_GPIO_EPFR01_RTO04E0               *((volatile unsigned int*)(0x4266C0A0UL))
#define bFM0P_GPIO_EPFR01_RTO04E1               *((volatile unsigned int*)(0x4266C0A4UL))
#define bFM0P_GPIO_EPFR01_RTO05E0               *((volatile unsigned int*)(0x4266C0A8UL))
#define bFM0P_GPIO_EPFR01_RTO05E1               *((volatile unsigned int*)(0x4266C0ACUL))
#define bFM0P_GPIO_EPFR01_DTTI0C                *((volatile unsigned int*)(0x4266C0B0UL))
#define bFM0P_GPIO_EPFR01_IGTRG0                *((volatile unsigned int*)(0x4266C0B4UL))
#define bFM0P_GPIO_EPFR01_DTTI0S0               *((volatile unsigned int*)(0x4266C0C0UL))
#define bFM0P_GPIO_EPFR01_DTTI0S1               *((volatile unsigned int*)(0x4266C0C4UL))
#define bFM0P_GPIO_EPFR01_FRCK0S0               *((volatile unsigned int*)(0x4266C0C8UL))
#define bFM0P_GPIO_EPFR01_FRCK0S1               *((volatile unsigned int*)(0x4266C0CCUL))
#define bFM0P_GPIO_EPFR01_IC00S0                *((volatile unsigned int*)(0x4266C0D0UL))
#define bFM0P_GPIO_EPFR01_IC00S1                *((volatile unsigned int*)(0x4266C0D4UL))
#define bFM0P_GPIO_EPFR01_IC00S2                *((volatile unsigned int*)(0x4266C0D8UL))
#define bFM0P_GPIO_EPFR01_IC01S0                *((volatile unsigned int*)(0x4266C0DCUL))
#define bFM0P_GPIO_EPFR01_IC01S1                *((volatile unsigned int*)(0x4266C0E0UL))
#define bFM0P_GPIO_EPFR01_IC01S2                *((volatile unsigned int*)(0x4266C0E4UL))
#define bFM0P_GPIO_EPFR01_IC02S0                *((volatile unsigned int*)(0x4266C0E8UL))
#define bFM0P_GPIO_EPFR01_IC02S1                *((volatile unsigned int*)(0x4266C0ECUL))
#define bFM0P_GPIO_EPFR01_IC02S2                *((volatile unsigned int*)(0x4266C0F0UL))
#define bFM0P_GPIO_EPFR01_IC03S0                *((volatile unsigned int*)(0x4266C0F4UL))
#define bFM0P_GPIO_EPFR01_IC03S1                *((volatile unsigned int*)(0x4266C0F8UL))
#define bFM0P_GPIO_EPFR01_IC03S2                *((volatile unsigned int*)(0x4266C0FCUL))
#define bFM0P_GPIO_EPFR02_RTO10E0               *((volatile unsigned int*)(0x4266C100UL))
#define bFM0P_GPIO_EPFR02_RTO10E1               *((volatile unsigned int*)(0x4266C104UL))
#define bFM0P_GPIO_EPFR02_RTO11E0               *((volatile unsigned int*)(0x4266C108UL))
#define bFM0P_GPIO_EPFR02_RTO11E1               *((volatile unsigned int*)(0x4266C10CUL))
#define bFM0P_GPIO_EPFR02_RTO12E0               *((volatile unsigned int*)(0x4266C110UL))
#define bFM0P_GPIO_EPFR02_RTO12E1               *((volatile unsigned int*)(0x4266C114UL))
#define bFM0P_GPIO_EPFR02_RTO13E0               *((volatile unsigned int*)(0x4266C118UL))
#define bFM0P_GPIO_EPFR02_RTO13E1               *((volatile unsigned int*)(0x4266C11CUL))
#define bFM0P_GPIO_EPFR02_RTO14E0               *((volatile unsigned int*)(0x4266C120UL))
#define bFM0P_GPIO_EPFR02_RTO14E1               *((volatile unsigned int*)(0x4266C124UL))
#define bFM0P_GPIO_EPFR02_RTO15E0               *((volatile unsigned int*)(0x4266C128UL))
#define bFM0P_GPIO_EPFR02_RTO15E1               *((volatile unsigned int*)(0x4266C12CUL))
#define bFM0P_GPIO_EPFR02_DTTI1C                *((volatile unsigned int*)(0x4266C130UL))
#define bFM0P_GPIO_EPFR02_DTTI1S0               *((volatile unsigned int*)(0x4266C140UL))
#define bFM0P_GPIO_EPFR02_DTTI1S1               *((volatile unsigned int*)(0x4266C144UL))
#define bFM0P_GPIO_EPFR02_FRCK1S0               *((volatile unsigned int*)(0x4266C148UL))
#define bFM0P_GPIO_EPFR02_FRCK1S1               *((volatile unsigned int*)(0x4266C14CUL))
#define bFM0P_GPIO_EPFR02_IC10S0                *((volatile unsigned int*)(0x4266C150UL))
#define bFM0P_GPIO_EPFR02_IC10S1                *((volatile unsigned int*)(0x4266C154UL))
#define bFM0P_GPIO_EPFR02_IC10S2                *((volatile unsigned int*)(0x4266C158UL))
#define bFM0P_GPIO_EPFR02_IC11S0                *((volatile unsigned int*)(0x4266C15CUL))
#define bFM0P_GPIO_EPFR02_IC11S1                *((volatile unsigned int*)(0x4266C160UL))
#define bFM0P_GPIO_EPFR02_IC11S2                *((volatile unsigned int*)(0x4266C164UL))
#define bFM0P_GPIO_EPFR02_IC12S0                *((volatile unsigned int*)(0x4266C168UL))
#define bFM0P_GPIO_EPFR02_IC12S1                *((volatile unsigned int*)(0x4266C16CUL))
#define bFM0P_GPIO_EPFR02_IC12S2                *((volatile unsigned int*)(0x4266C170UL))
#define bFM0P_GPIO_EPFR02_IC13S0                *((volatile unsigned int*)(0x4266C174UL))
#define bFM0P_GPIO_EPFR02_IC13S1                *((volatile unsigned int*)(0x4266C178UL))
