furjie/Single-BLDC-driver-and-app/s6e1a1.h
#define bFM0P_GPIO_EPFR15_EINT30S1              *((volatile unsigned int*)(0x4266C7F4UL))
#define bFM0P_GPIO_EPFR15_EINT31S0              *((volatile unsigned int*)(0x4266C7F8UL))
#define bFM0P_GPIO_EPFR15_EINT31S1              *((volatile unsigned int*)(0x4266C7FCUL))
#define bFM0P_GPIO_EPFR16_SIN8S0                *((volatile unsigned int*)(0x4266C810UL))
#define bFM0P_GPIO_EPFR16_SIN8S1                *((volatile unsigned int*)(0x4266C814UL))
#define bFM0P_GPIO_EPFR16_SOT8B0                *((volatile unsigned int*)(0x4266C818UL))
#define bFM0P_GPIO_EPFR16_SOT8B1                *((volatile unsigned int*)(0x4266C81CUL))
#define bFM0P_GPIO_EPFR16_SCK8B0                *((volatile unsigned int*)(0x4266C820UL))
#define bFM0P_GPIO_EPFR16_SCK8B1                *((volatile unsigned int*)(0x4266C824UL))
#define bFM0P_GPIO_EPFR16_SIN9S0                *((volatile unsigned int*)(0x4266C828UL))
#define bFM0P_GPIO_EPFR16_SIN9S1                *((volatile unsigned int*)(0x4266C82CUL))
#define bFM0P_GPIO_EPFR16_SOT9B0                *((volatile unsigned int*)(0x4266C830UL))
#define bFM0P_GPIO_EPFR16_SOT9B1                *((volatile unsigned int*)(0x4266C834UL))
#define bFM0P_GPIO_EPFR16_SCK9B0                *((volatile unsigned int*)(0x4266C838UL))
#define bFM0P_GPIO_EPFR16_SCK9B1                *((volatile unsigned int*)(0x4266C83CUL))
#define bFM0P_GPIO_EPFR16_SIN10S0               *((volatile unsigned int*)(0x4266C840UL))
#define bFM0P_GPIO_EPFR16_SIN10S1               *((volatile unsigned int*)(0x4266C844UL))
#define bFM0P_GPIO_EPFR16_SOT10B0               *((volatile unsigned int*)(0x4266C848UL))
#define bFM0P_GPIO_EPFR16_SOT10B1               *((volatile unsigned int*)(0x4266C84CUL))
#define bFM0P_GPIO_EPFR16_SCK10B0               *((volatile unsigned int*)(0x4266C850UL))
#define bFM0P_GPIO_EPFR16_SCK10B1               *((volatile unsigned int*)(0x4266C854UL))
#define bFM0P_GPIO_EPFR16_SIN11S0               *((volatile unsigned int*)(0x4266C858UL))
#define bFM0P_GPIO_EPFR16_SIN11S1               *((volatile unsigned int*)(0x4266C85CUL))
#define bFM0P_GPIO_EPFR16_SOT11B0               *((volatile unsigned int*)(0x4266C860UL))
#define bFM0P_GPIO_EPFR16_SOT11B1               *((volatile unsigned int*)(0x4266C864UL))
#define bFM0P_GPIO_EPFR16_SCK11B0               *((volatile unsigned int*)(0x4266C868UL))
#define bFM0P_GPIO_EPFR16_SCK11B1               *((volatile unsigned int*)(0x4266C86CUL))
#define bFM0P_GPIO_EPFR17_SIN12S0               *((volatile unsigned int*)(0x4266C890UL))
#define bFM0P_GPIO_EPFR17_SIN12S1               *((volatile unsigned int*)(0x4266C894UL))
#define bFM0P_GPIO_EPFR17_SOT12B0               *((volatile unsigned int*)(0x4266C898UL))
#define bFM0P_GPIO_EPFR17_SOT12B1               *((volatile unsigned int*)(0x4266C89CUL))
#define bFM0P_GPIO_EPFR17_SCK12B0               *((volatile unsigned int*)(0x4266C8A0UL))
#define bFM0P_GPIO_EPFR17_SCK12B1               *((volatile unsigned int*)(0x4266C8A4UL))
#define bFM0P_GPIO_EPFR17_SIN13S0               *((volatile unsigned int*)(0x4266C8A8UL))
#define bFM0P_GPIO_EPFR17_SIN13S1               *((volatile unsigned int*)(0x4266C8ACUL))
#define bFM0P_GPIO_EPFR17_SOT13B0               *((volatile unsigned int*)(0x4266C8B0UL))
#define bFM0P_GPIO_EPFR17_SOT13B1               *((volatile unsigned int*)(0x4266C8B4UL))
#define bFM0P_GPIO_EPFR17_SCK13B0               *((volatile unsigned int*)(0x4266C8B8UL))
#define bFM0P_GPIO_EPFR17_SCK13B1               *((volatile unsigned int*)(0x4266C8BCUL))
#define bFM0P_GPIO_EPFR17_SIN14S0               *((volatile unsigned int*)(0x4266C8C0UL))
#define bFM0P_GPIO_EPFR17_SIN14S1               *((volatile unsigned int*)(0x4266C8C4UL))
#define bFM0P_GPIO_EPFR17_SOT14B0               *((volatile unsigned int*)(0x4266C8C8UL))
#define bFM0P_GPIO_EPFR17_SOT14B1               *((volatile unsigned int*)(0x4266C8CCUL))
#define bFM0P_GPIO_EPFR17_SCK14B0               *((volatile unsigned int*)(0x4266C8D0UL))
#define bFM0P_GPIO_EPFR17_SCK14B1               *((volatile unsigned int*)(0x4266C8D4UL))
#define bFM0P_GPIO_EPFR17_SIN15S0               *((volatile unsigned int*)(0x4266C8D8UL))
#define bFM0P_GPIO_EPFR17_SIN15S1               *((volatile unsigned int*)(0x4266C8DCUL))
#define bFM0P_GPIO_EPFR17_SOT15B0               *((volatile unsigned int*)(0x4266C8E0UL))
#define bFM0P_GPIO_EPFR17_SOT15B1               *((volatile unsigned int*)(0x4266C8E4UL))
#define bFM0P_GPIO_EPFR17_SCK15B0               *((volatile unsigned int*)(0x4266C8E8UL))
#define bFM0P_GPIO_EPFR17_SCK15B1               *((volatile unsigned int*)(0x4266C8ECUL))
#define bFM0P_GPIO_EPFR18_CECR0B0               *((volatile unsigned int*)(0x4266C900UL))
#define bFM0P_GPIO_EPFR18_CECR0B1               *((volatile unsigned int*)(0x4266C904UL))
#define bFM0P_GPIO_EPFR18_CECR1B0               *((volatile unsigned int*)(0x4266C908UL))
#define bFM0P_GPIO_EPFR18_CECR1B1               *((volatile unsigned int*)(0x4266C90CUL))
#define bFM0P_GPIO_EPFR21_QAIN0S                *((volatile unsigned int*)(0x4266CA80UL))
#define bFM0P_GPIO_EPFR21_QBIN0S                *((volatile unsigned int*)(0x4266CA84UL))
#define bFM0P_GPIO_EPFR21_QZIN0S                *((volatile unsigned int*)(0x4266CA88UL))
#define bFM0P_GPIO_EPFR22_SCS00B0               *((volatile unsigned int*)(0x4266CB00UL))
#define bFM0P_GPIO_EPFR22_SCS00B1               *((volatile unsigned int*)(0x4266CB04UL))
#define bFM0P_GPIO_EPFR22_SCS01E0               *((volatile unsigned int*)(0x4266CB08UL))
#define bFM0P_GPIO_EPFR22_SCS01E1               *((volatile unsigned int*)(0x4266CB0CUL))
#define bFM0P_GPIO_EPFR22_SCS10B0               *((volatile unsigned int*)(0x4266CB10UL))
#define bFM0P_GPIO_EPFR22_SCS10B1               *((volatile unsigned int*)(0x4266CB14UL))
#define bFM0P_GPIO_EPFR22_SCS11E0               *((volatile unsigned int*)(0x4266CB18UL))
#define bFM0P_GPIO_EPFR22_SCS11E1               *((volatile unsigned int*)(0x4266CB1CUL))
#define bFM0P_GPIO_EPFR22_SCS20B0               *((volatile unsigned int*)(0x4266CB20UL))
#define bFM0P_GPIO_EPFR22_SCS20B1               *((volatile unsigned int*)(0x4266CB24UL))
#define bFM0P_GPIO_EPFR22_SCS21E0               *((volatile unsigned int*)(0x4266CB28UL))
#define bFM0P_GPIO_EPFR22_SCS21E1               *((volatile unsigned int*)(0x4266CB2CUL))
#define bFM0P_GPIO_EPFR22_SCS30B0               *((volatile unsigned int*)(0x4266CB30UL))
#define bFM0P_GPIO_EPFR22_SCS30B1               *((volatile unsigned int*)(0x4266CB34UL))
#define bFM0P_GPIO_EPFR22_SCS31E0               *((volatile unsigned int*)(0x4266CB38UL))
#define bFM0P_GPIO_EPFR22_SCS31E1               *((volatile unsigned int*)(0x4266CB3CUL))
#define bFM0P_GPIO_PZR0_P00                     *((volatile unsigned int*)(0x4266E000UL))
#define bFM0P_GPIO_PZR0_P01                     *((volatile unsigned int*)(0x4266E004UL))
#define bFM0P_GPIO_PZR0_P02                     *((volatile unsigned int*)(0x4266E008UL))
#define bFM0P_GPIO_PZR0_P03                     *((volatile unsigned int*)(0x4266E00CUL))
#define bFM0P_GPIO_PZR0_P04                     *((volatile unsigned int*)(0x4266E010UL))
#define bFM0P_GPIO_PZR0_P0F                     *((volatile unsigned int*)(0x4266E03CUL))
#define bFM0P_GPIO_PZR1_P10                     *((volatile unsigned int*)(0x4266E080UL))
#define bFM0P_GPIO_PZR1_P11                     *((volatile unsigned int*)(0x4266E084UL))
#define bFM0P_GPIO_PZR1_P12                     *((volatile unsigned int*)(0x4266E088UL))
#define bFM0P_GPIO_PZR1_P13                     *((volatile unsigned int*)(0x4266E08CUL))
#define bFM0P_GPIO_PZR1_P14                     *((volatile unsigned int*)(0x4266E090UL))
#define bFM0P_GPIO_PZR1_P15                     *((volatile unsigned int*)(0x4266E094UL))
#define bFM0P_GPIO_PZR2_P21                     *((volatile unsigned int*)(0x4266E104UL))
#define bFM0P_GPIO_PZR2_P22                     *((volatile unsigned int*)(0x4266E108UL))
#define bFM0P_GPIO_PZR2_P23                     *((volatile unsigned int*)(0x4266E10CUL))
#define bFM0P_GPIO_PZR3_P39                     *((volatile unsigned int*)(0x4266E1A4UL))
#define bFM0P_GPIO_PZR3_P3A                     *((volatile unsigned int*)(0x4266E1A8UL))
#define bFM0P_GPIO_PZR3_P3B                     *((volatile unsigned int*)(0x4266E1ACUL))
#define bFM0P_GPIO_PZR3_P3C                     *((volatile unsigned int*)(0x4266E1B0UL))
#define bFM0P_GPIO_PZR3_P3D                     *((volatile unsigned int*)(0x4266E1B4UL))
#define bFM0P_GPIO_PZR3_P3E                     *((volatile unsigned int*)(0x4266E1B8UL))
#define bFM0P_GPIO_PZR3_P3F                     *((volatile unsigned int*)(0x4266E1BCUL))
#define bFM0P_GPIO_PZR4_P46                     *((volatile unsigned int*)(0x4266E218UL))
#define bFM0P_GPIO_PZR4_P47                     *((volatile unsigned int*)(0x4266E21CUL))
#define bFM0P_GPIO_PZR4_P49                     *((volatile unsigned int*)(0x4266E224UL))
#define bFM0P_GPIO_PZR4_P4A                     *((volatile unsigned int*)(0x4266E228UL))
#define bFM0P_GPIO_PZR5_P50                     *((volatile unsigned int*)(0x4266E280UL))
#define bFM0P_GPIO_PZR5_P51                     *((volatile unsigned int*)(0x4266E284UL))
#define bFM0P_GPIO_PZR5_P52                     *((volatile unsigned int*)(0x4266E288UL))
#define bFM0P_GPIO_PZR6_P60                     *((volatile unsigned int*)(0x4266E300UL))
#define bFM0P_GPIO_PZR6_P61                     *((volatile unsigned int*)(0x4266E304UL))
#define bFM0P_GPIO_PZR8_P80                     *((volatile unsigned int*)(0x4266E400UL))
#define bFM0P_GPIO_PZR8_P81                     *((volatile unsigned int*)(0x4266E404UL))
#define bFM0P_GPIO_PZR8_P82                     *((volatile unsigned int*)(0x4266E408UL))
#define bFM0P_GPIO_PZRE_PE0                     *((volatile unsigned int*)(0x4266E700UL))
#define bFM0P_GPIO_PZRE_PE2                     *((volatile unsigned int*)(0x4266E708UL))
#define bFM0P_GPIO_PZRE_PE3                     *((volatile unsigned int*)(0x4266E70CUL))

/* Fast GPIO registers */
#define bFM0P_GPIO_FPDIR0_P00                    *((volatile unsigned char*)(0xF8010004UL))
#define bFM0P_GPIO_FPDIR0_P01                    *((volatile unsigned char*)(0xF8010008UL))
#define bFM0P_GPIO_FPDIR0_P02                    *((volatile unsigned char*)(0xF8010010UL))
#define bFM0P_GPIO_FPDIR0_P03                    *((volatile unsigned char*)(0xF8010020UL))
#define bFM0P_GPIO_FPDIR0_P04                    *((volatile unsigned char*)(0xF8010040UL))
#define bFM0P_GPIO_FPDIR0_P0F                    *((volatile unsigned char*)(0xF8010201UL))
#define bFM0P_GPIO_FPDIR1_P10                    *((volatile unsigned char*)(0xF8010404UL))
#define bFM0P_GPIO_FPDIR1_P11                    *((volatile unsigned char*)(0xF8010408UL))
#define bFM0P_GPIO_FPDIR1_P12                    *((volatile unsigned char*)(0xF8010410UL))
#define bFM0P_GPIO_FPDIR1_P13                    *((volatile unsigned char*)(0xF8010420UL))
#define bFM0P_GPIO_FPDIR1_P14                    *((volatile unsigned char*)(0xF8010440UL))
#define bFM0P_GPIO_FPDIR1_P15                    *((volatile unsigned char*)(0xF8010480UL))
#define bFM0P_GPIO_FPDIR2_P21                    *((volatile unsigned char*)(0xF8010804UL))
#define bFM0P_GPIO_FPDIR2_P22                    *((volatile unsigned char*)(0xF8010808UL))
#define bFM0P_GPIO_FPDIR2_P23                    *((volatile unsigned char*)(0xF8010810UL))
#define bFM0P_GPIO_FPDIR3_P39                    *((volatile unsigned char*)(0xF8010C09UL))
#define bFM0P_GPIO_FPDIR3_P3A                    *((volatile unsigned char*)(0xF8010C11UL))
#define bFM0P_GPIO_FPDIR3_P3B                    *((volatile unsigned char*)(0xF8010C21UL))
#define bFM0P_GPIO_FPDIR3_P3C                    *((volatile unsigned char*)(0xF8010C41UL))
#define bFM0P_GPIO_FPDIR3_P3D                    *((volatile unsigned char*)(0xF8010C81UL))
#define bFM0P_GPIO_FPDIR3_P3E                    *((volatile unsigned char*)(0xF8010D01UL))
#define bFM0P_GPIO_FPDIR3_P3F                    *((volatile unsigned char*)(0xF8010E01UL))
#define bFM0P_GPIO_FPDIR4_P46                    *((volatile unsigned char*)(0xF8011100UL))
#define bFM0P_GPIO_FPDIR4_P47                    *((volatile unsigned char*)(0xF8011200UL))
#define bFM0P_GPIO_FPDIR4_P49                    *((volatile unsigned char*)(0xF8011009UL))
#define bFM0P_GPIO_FPDIR4_P4A                    *((volatile unsigned char*)(0xF8011011UL))
#define bFM0P_GPIO_FPDIR5_P50                    *((volatile unsigned char*)(0xF8011404UL))
#define bFM0P_GPIO_FPDIR5_P51                    *((volatile unsigned char*)(0xF8011408UL))
#define bFM0P_GPIO_FPDIR5_P52                    *((volatile unsigned char*)(0xF8011410UL))
#define bFM0P_GPIO_FPDIR6_P60                    *((volatile unsigned char*)(0xF8011804UL))
#define bFM0P_GPIO_FPDIR6_P61                    *((volatile unsigned char*)(0xF8011808UL))
#define bFM0P_GPIO_FPDIR8_P80                    *((volatile unsigned char*)(0xF8012004UL))
#define bFM0P_GPIO_FPDIR8_P81                    *((volatile unsigned char*)(0xF8012008UL))
#define bFM0P_GPIO_FPDIR8_P82                    *((volatile unsigned char*)(0xF8012010UL))
#define bFM0P_GPIO_FPDIRE_PE0                    *((volatile unsigned char*)(0xF8013804UL))
#define bFM0P_GPIO_FPDIRE_PE2                    *((volatile unsigned char*)(0xF8013810UL))
#define bFM0P_GPIO_FPDIRE_PE3                    *((volatile unsigned char*)(0xF8013820UL))
#define bFM0P_GPIO_FPDOR0_P00                    *((volatile unsigned char*)(0xF8014004UL))
#define bFM0P_GPIO_FPDOR0_P01                    *((volatile unsigned char*)(0xF8014008UL))
#define bFM0P_GPIO_FPDOR0_P02                    *((volatile unsigned char*)(0xF8014010UL))
#define bFM0P_GPIO_FPDOR0_P03                    *((volatile unsigned char*)(0xF8014020UL))
#define bFM0P_GPIO_FPDOR0_P04                    *((volatile unsigned char*)(0xF8014040UL))
#define bFM0P_GPIO_FPDOR0_P0F                    *((volatile unsigned char*)(0xF8014201UL))
#define bFM0P_GPIO_FPDOR1_P10                    *((volatile unsigned char*)(0xF8014404UL))
#define bFM0P_GPIO_FPDOR1_P11                    *((volatile unsigned char*)(0xF8014408UL))
#define bFM0P_GPIO_FPDOR1_P12                    *((volatile unsigned char*)(0xF8014410UL))
#define bFM0P_GPIO_FPDOR1_P13                    *((volatile unsigned char*)(0xF8014420UL))
#define bFM0P_GPIO_FPDOR1_P14                    *((volatile unsigned char*)(0xF8014440UL))
#define bFM0P_GPIO_FPDOR1_P15                    *((volatile unsigned char*)(0xF8014480UL))
#define bFM0P_GPIO_FPDOR2_P21                    *((volatile unsigned char*)(0xF8014808UL))
#define bFM0P_GPIO_FPDOR2_P22                    *((volatile unsigned char*)(0xF8014810UL))
#define bFM0P_GPIO_FPDOR2_P23                    *((volatile unsigned char*)(0xF8014820UL))
#define bFM0P_GPIO_FPDOR3_P39                    *((volatile unsigned char*)(0xF8014C09UL))
#define bFM0P_GPIO_FPDOR3_P3A                    *((volatile unsigned char*)(0xF8014C11UL))
#define bFM0P_GPIO_FPDOR3_P3B                    *((volatile unsigned char*)(0xF8014C21UL))
#define bFM0P_GPIO_FPDOR3_P3C                    *((volatile unsigned char*)(0xF8014C41UL))
#define bFM0P_GPIO_FPDOR3_P3D                    *((volatile unsigned char*)(0xF8014C81UL))
#define bFM0P_GPIO_FPDOR3_P3E                    *((volatile unsigned char*)(0xF8014D01UL))
#define bFM0P_GPIO_FPDOR3_P3F                    *((volatile unsigned char*)(0xF8014E01UL))
#define bFM0P_GPIO_FPDOR4_P46                    *((volatile unsigned char*)(0xF8015100UL))
#define bFM0P_GPIO_FPDOR4_P47                    *((volatile unsigned char*)(0xF8015200UL))
#define bFM0P_GPIO_FPDOR4_P49                    *((volatile unsigned char*)(0xF8015009UL))
#define bFM0P_GPIO_FPDOR4_P4A                    *((volatile unsigned char*)(0xF8015011UL))
#define bFM0P_GPIO_FPDOR5_P50                    *((volatile unsigned char*)(0xF8015404UL))
#define bFM0P_GPIO_FPDOR5_P51                    *((volatile unsigned char*)(0xF8015408UL))
#define bFM0P_GPIO_FPDOR5_P52                    *((volatile unsigned char*)(0xF8015410UL))
#define bFM0P_GPIO_FPDOR6_P60                    *((volatile unsigned char*)(0xF8015804UL))
#define bFM0P_GPIO_FPDOR6_P61                    *((volatile unsigned char*)(0xF8015808UL))
#define bFM0P_GPIO_FPDOR8_P80                    *((volatile unsigned char*)(0xF8016004UL))
#define bFM0P_GPIO_FPDOR8_P81                    *((volatile unsigned char*)(0xF8016008UL))
#define bFM0P_GPIO_FPDOR8_P82                    *((volatile unsigned char*)(0xF8016010UL))
#define bFM0P_GPIO_FPDORE_PE0                    *((volatile unsigned char*)(0xF8017804UL))
#define bFM0P_GPIO_FPDORE_PE2                    *((volatile unsigned char*)(0xF8017810UL))
#define bFM0P_GPIO_FPDORE_PE3                    *((volatile unsigned char*)(0xF8017820UL))
#define bFM0P_GPIO_M_FPDIR0_P00                  *((volatile unsigned char*)(0xF8018004UL))
#define bFM0P_GPIO_M_FPDIR0_P01                  *((volatile unsigned char*)(0xF8018008UL))
#define bFM0P_GPIO_M_FPDIR0_P02                  *((volatile unsigned char*)(0xF8018010UL))
#define bFM0P_GPIO_M_FPDIR0_P03                  *((volatile unsigned char*)(0xF8018020UL))
#define bFM0P_GPIO_M_FPDIR0_P04                  *((volatile unsigned char*)(0xF8018040UL))
#define bFM0P_GPIO_M_FPDIR0_P05                  *((volatile unsigned char*)(0xF8018080UL))
#define bFM0P_GPIO_M_FPDIR0_P06                  *((volatile unsigned char*)(0xF8018100UL))
#define bFM0P_GPIO_M_FPDIR0_P07                  *((volatile unsigned char*)(0xF8018200UL))
#define bFM0P_GPIO_M_FPDIR1_P10                  *((volatile unsigned char*)(0xF8018404UL))
#define bFM0P_GPIO_M_FPDIR1_P11                  *((volatile unsigned char*)(0xF8018408UL))
#define bFM0P_GPIO_M_FPDIR1_P12                  *((volatile unsigned char*)(0xF8018410UL))
#define bFM0P_GPIO_M_FPDIR1_P13                  *((volatile unsigned char*)(0xF8018420UL))
#define bFM0P_GPIO_M_FPDIR1_P14                  *((volatile unsigned char*)(0xF8018440UL))
#define bFM0P_GPIO_M_FPDIR1_P15                  *((volatile unsigned char*)(0xF8018480UL))
#define bFM0P_GPIO_M_FPDIR1_P16                  *((volatile unsigned char*)(0xF8018500UL))
#define bFM0P_GPIO_M_FPDIR1_P17                  *((volatile unsigned char*)(0xF8018600UL))
#define bFM0P_GPIO_M_FPDOR0_P00                  *((volatile unsigned char*)(0xF801C004UL))
#define bFM0P_GPIO_M_FPDOR0_P01                  *((volatile unsigned char*)(0xF801C008UL))
#define bFM0P_GPIO_M_FPDOR0_P02                  *((volatile unsigned char*)(0xF801C010UL))
#define bFM0P_GPIO_M_FPDOR0_P03                  *((volatile unsigned char*)(0xF801C020UL))
#define bFM0P_GPIO_M_FPDOR0_P04                  *((volatile unsigned char*)(0xF801C040UL))
#define bFM0P_GPIO_M_FPDOR0_P05                  *((volatile unsigned char*)(0xF801C080UL))
#define bFM0P_GPIO_M_FPDOR0_P06                  *((volatile unsigned char*)(0xF801C100UL))
#define bFM0P_GPIO_M_FPDOR0_P07                  *((volatile unsigned char*)(0xF801C200UL))
#define bFM0P_GPIO_M_FPDOR1_P10                  *((volatile unsigned char*)(0xF801C404UL))
#define bFM0P_GPIO_M_FPDOR1_P11                  *((volatile unsigned char*)(0xF801C408UL))
#define bFM0P_GPIO_M_FPDOR1_P12                  *((volatile unsigned char*)(0xF801C410UL))
#define bFM0P_GPIO_M_FPDOR1_P13                  *((volatile unsigned char*)(0xF801C420UL))
#define bFM0P_GPIO_M_FPDOR1_P14                  *((volatile unsigned char*)(0xF801C440UL))
#define bFM0P_GPIO_M_FPDOR1_P15                  *((volatile unsigned char*)(0xF801C480UL))
#define bFM0P_GPIO_M_FPDOR1_P16                  *((volatile unsigned char*)(0xF801C500UL))
#define bFM0P_GPIO_M_FPDOR1_P17                  *((volatile unsigned char*)(0xF801C600UL))

