furjie/Single-BLDC-driver-and-app/s6e1a1.h
/* Low voltage detection registers */
#define bFM0P_LVD_LVD_CTL_SVHI0                *((volatile unsigned int*)(0x426A0008UL))
#define bFM0P_LVD_LVD_CTL_SVHI1                *((volatile unsigned int*)(0x426A000CUL))
#define bFM0P_LVD_LVD_CTL_SVHI2                *((volatile unsigned int*)(0x426A0010UL))
#define bFM0P_LVD_LVD_CTL_SVHI3                *((volatile unsigned int*)(0x426A0014UL))
#define bFM0P_LVD_LVD_CTL_SVHI4                *((volatile unsigned int*)(0x426A0018UL))
#define bFM0P_LVD_LVD_CTL_LVDIE                *((volatile unsigned int*)(0x426A001CUL))
#define bFM0P_LVD_LVD_CTL_SVHR0                *((volatile unsigned int*)(0x426A0028UL))
#define bFM0P_LVD_LVD_CTL_SVHR1                *((volatile unsigned int*)(0x426A002CUL))
#define bFM0P_LVD_LVD_CTL_SVHR2                *((volatile unsigned int*)(0x426A0030UL))
#define bFM0P_LVD_LVD_CTL_SVHR3                *((volatile unsigned int*)(0x426A0034UL))
#define bFM0P_LVD_LVD_CTL_SVHR4                *((volatile unsigned int*)(0x426A0038UL))
#define bFM0P_LVD_LVD_CTL_LVDRE                *((volatile unsigned int*)(0x426A003CUL))
#define bFM0P_LVD_LVD_STR_LVDIR                *((volatile unsigned int*)(0x426A009CUL))
#define bFM0P_LVD_LVD_CLR_LVDCL                *((volatile unsigned int*)(0x426A011CUL))
#define bFM0P_LVD_LVD_RLR_LVDLCK0              *((volatile unsigned int*)(0x426A0180UL))
#define bFM0P_LVD_LVD_RLR_LVDLCK1              *((volatile unsigned int*)(0x426A0184UL))
#define bFM0P_LVD_LVD_RLR_LVDLCK2              *((volatile unsigned int*)(0x426A0188UL))
#define bFM0P_LVD_LVD_RLR_LVDLCK3              *((volatile unsigned int*)(0x426A018CUL))
#define bFM0P_LVD_LVD_RLR_LVDLCK4              *((volatile unsigned int*)(0x426A0190UL))
#define bFM0P_LVD_LVD_RLR_LVDLCK5              *((volatile unsigned int*)(0x426A0194UL))
#define bFM0P_LVD_LVD_RLR_LVDLCK6              *((volatile unsigned int*)(0x426A0198UL))
#define bFM0P_LVD_LVD_RLR_LVDLCK7              *((volatile unsigned int*)(0x426A019CUL))
#define bFM0P_LVD_LVD_RLR_LVDLCK8              *((volatile unsigned int*)(0x426A01A0UL))
#define bFM0P_LVD_LVD_RLR_LVDLCK9              *((volatile unsigned int*)(0x426A01A4UL))
#define bFM0P_LVD_LVD_RLR_LVDLCK10             *((volatile unsigned int*)(0x426A01A8UL))
#define bFM0P_LVD_LVD_RLR_LVDLCK11             *((volatile unsigned int*)(0x426A01ACUL))
#define bFM0P_LVD_LVD_RLR_LVDLCK12             *((volatile unsigned int*)(0x426A01B0UL))
#define bFM0P_LVD_LVD_RLR_LVDLCK13             *((volatile unsigned int*)(0x426A01B4UL))
#define bFM0P_LVD_LVD_RLR_LVDLCK14             *((volatile unsigned int*)(0x426A01B8UL))
#define bFM0P_LVD_LVD_RLR_LVDLCK15             *((volatile unsigned int*)(0x426A01BCUL))
#define bFM0P_LVD_LVD_RLR_LVDLCK16             *((volatile unsigned int*)(0x426A01C0UL))
#define bFM0P_LVD_LVD_RLR_LVDLCK17             *((volatile unsigned int*)(0x426A01C4UL))
#define bFM0P_LVD_LVD_RLR_LVDLCK18             *((volatile unsigned int*)(0x426A01C8UL))
#define bFM0P_LVD_LVD_RLR_LVDLCK19             *((volatile unsigned int*)(0x426A01CCUL))
#define bFM0P_LVD_LVD_RLR_LVDLCK20             *((volatile unsigned int*)(0x426A01D0UL))
#define bFM0P_LVD_LVD_RLR_LVDLCK21             *((volatile unsigned int*)(0x426A01D4UL))
#define bFM0P_LVD_LVD_RLR_LVDLCK22             *((volatile unsigned int*)(0x426A01D8UL))
#define bFM0P_LVD_LVD_RLR_LVDLCK23             *((volatile unsigned int*)(0x426A01DCUL))
#define bFM0P_LVD_LVD_RLR_LVDLCK24             *((volatile unsigned int*)(0x426A01E0UL))
#define bFM0P_LVD_LVD_RLR_LVDLCK25             *((volatile unsigned int*)(0x426A01E4UL))
#define bFM0P_LVD_LVD_RLR_LVDLCK26             *((volatile unsigned int*)(0x426A01E8UL))
#define bFM0P_LVD_LVD_RLR_LVDLCK27             *((volatile unsigned int*)(0x426A01ECUL))
#define bFM0P_LVD_LVD_RLR_LVDLCK28             *((volatile unsigned int*)(0x426A01F0UL))
#define bFM0P_LVD_LVD_RLR_LVDLCK29             *((volatile unsigned int*)(0x426A01F4UL))
#define bFM0P_LVD_LVD_RLR_LVDLCK30             *((volatile unsigned int*)(0x426A01F8UL))
#define bFM0P_LVD_LVD_RLR_LVDLCK31             *((volatile unsigned int*)(0x426A01FCUL))
#define bFM0P_LVD_LVD_STR2_LVDRRDY             *((volatile unsigned int*)(0x426A0218UL))
#define bFM0P_LVD_LVD_STR2_LVDIRDY             *((volatile unsigned int*)(0x426A021CUL))

/* Deep standby mode control registers */
#define bFM0P_DS_REG_CTL_ISUBSEL0              *((volatile unsigned int*)(0x426A2004UL))
#define bFM0P_DS_REG_CTL_ISUBSEL1              *((volatile unsigned int*)(0x426A2008UL))
#define bFM0P_DS_RCK_CTL_RTCCKE                *((volatile unsigned int*)(0x426A2080UL))
#define bFM0P_DS_RCK_CTL_CECCKE                *((volatile unsigned int*)(0x426A2084UL))
#define bFM0P_DS_PMD_CTL_RTCE                  *((volatile unsigned int*)(0x426B0000UL))
#define bFM0P_DS_WRFSR_WINITX                  *((volatile unsigned int*)(0x426B0080UL))
#define bFM0P_DS_WRFSR_WLVDH                   *((volatile unsigned int*)(0x426B0084UL))
#define bFM0P_DS_WIFSR_WRTCI                   *((volatile unsigned int*)(0x426B0100UL))
#define bFM0P_DS_WIFSR_WLVDI                   *((volatile unsigned int*)(0x426B0104UL))
#define bFM0P_DS_WIFSR_WUI0                    *((volatile unsigned int*)(0x426B0108UL))
#define bFM0P_DS_WIFSR_WUI1                    *((volatile unsigned int*)(0x426B010CUL))
#define bFM0P_DS_WIFSR_WUI2                    *((volatile unsigned int*)(0x426B0110UL))
#define bFM0P_DS_WIFSR_WUI3                    *((volatile unsigned int*)(0x426B0114UL))
#define bFM0P_DS_WIFSR_WUI4                    *((volatile unsigned int*)(0x426B0118UL))
#define bFM0P_DS_WIFSR_WUI5                    *((volatile unsigned int*)(0x426B011CUL))
#define bFM0P_DS_WIFSR_WCEC0I                  *((volatile unsigned int*)(0x426B0120UL))
#define bFM0P_DS_WIFSR_WCEC1I                  *((volatile unsigned int*)(0x426B0124UL))
#define bFM0P_DS_WIER_WRTCE                    *((volatile unsigned int*)(0x426B0180UL))
#define bFM0P_DS_WIER_WLVDE                    *((volatile unsigned int*)(0x426B0184UL))
#define bFM0P_DS_WIER_WUE1                     *((volatile unsigned int*)(0x426B018CUL))
#define bFM0P_DS_WIER_WUE2                     *((volatile unsigned int*)(0x426B0190UL))
#define bFM0P_DS_WIER_WUE3                     *((volatile unsigned int*)(0x426B0194UL))
#define bFM0P_DS_WIER_WUE4                     *((volatile unsigned int*)(0x426B0198UL))
#define bFM0P_DS_WIER_WUE5                     *((volatile unsigned int*)(0x426B019CUL))
#define bFM0P_DS_WIER_WCEC0E                   *((volatile unsigned int*)(0x426B01A0UL))
#define bFM0P_DS_WIER_WCEC1E                   *((volatile unsigned int*)(0x426B01A4UL))
#define bFM0P_DS_WILVR_WUI1LV                  *((volatile unsigned int*)(0x426B0200UL))
#define bFM0P_DS_WILVR_WUI2LV                  *((volatile unsigned int*)(0x426B0204UL))
#define bFM0P_DS_WILVR_WUI3LV                  *((volatile unsigned int*)(0x426B0208UL))
#define bFM0P_DS_WILVR_WUI4LV                  *((volatile unsigned int*)(0x426B020CUL))
#define bFM0P_DS_WILVR_WUI5LV                  *((volatile unsigned int*)(0x426B0210UL))
#define bFM0P_DS_DSRAMR_SRAMR0                 *((volatile unsigned int*)(0x426B0280UL))
#define bFM0P_DS_DSRAMR_SRAMR1                 *((volatile unsigned int*)(0x426B0284UL))
#define bFM0P_DS_BUR01_BUR010                  *((volatile unsigned int*)(0x426B2000UL))
#define bFM0P_DS_BUR01_BUR011                  *((volatile unsigned int*)(0x426B2004UL))
#define bFM0P_DS_BUR01_BUR012                  *((volatile unsigned int*)(0x426B2008UL))
#define bFM0P_DS_BUR01_BUR013                  *((volatile unsigned int*)(0x426B200CUL))
#define bFM0P_DS_BUR01_BUR014                  *((volatile unsigned int*)(0x426B2010UL))
#define bFM0P_DS_BUR01_BUR015                  *((volatile unsigned int*)(0x426B2014UL))
#define bFM0P_DS_BUR01_BUR016                  *((volatile unsigned int*)(0x426B2018UL))
#define bFM0P_DS_BUR01_BUR017                  *((volatile unsigned int*)(0x426B201CUL))
#define bFM0P_DS_BUR02_BUR020                  *((volatile unsigned int*)(0x426B2020UL))
#define bFM0P_DS_BUR02_BUR021                  *((volatile unsigned int*)(0x426B2024UL))
#define bFM0P_DS_BUR02_BUR022                  *((volatile unsigned int*)(0x426B2028UL))
#define bFM0P_DS_BUR02_BUR023                  *((volatile unsigned int*)(0x426B202CUL))
#define bFM0P_DS_BUR02_BUR024                  *((volatile unsigned int*)(0x426B2030UL))
#define bFM0P_DS_BUR02_BUR025                  *((volatile unsigned int*)(0x426B2034UL))
#define bFM0P_DS_BUR02_BUR026                  *((volatile unsigned int*)(0x426B2038UL))
#define bFM0P_DS_BUR02_BUR027                  *((volatile unsigned int*)(0x426B203CUL))
#define bFM0P_DS_BUR03_BUR030                  *((volatile unsigned int*)(0x426B2040UL))
#define bFM0P_DS_BUR03_BUR031                  *((volatile unsigned int*)(0x426B2044UL))
#define bFM0P_DS_BUR03_BUR032                  *((volatile unsigned int*)(0x426B2048UL))
#define bFM0P_DS_BUR03_BUR033                  *((volatile unsigned int*)(0x426B204CUL))
#define bFM0P_DS_BUR03_BUR034                  *((volatile unsigned int*)(0x426B2050UL))
#define bFM0P_DS_BUR03_BUR035                  *((volatile unsigned int*)(0x426B2054UL))
#define bFM0P_DS_BUR03_BUR036                  *((volatile unsigned int*)(0x426B2058UL))
#define bFM0P_DS_BUR03_BUR037                  *((volatile unsigned int*)(0x426B205CUL))
#define bFM0P_DS_BUR04_BUR040                  *((volatile unsigned int*)(0x426B2060UL))
#define bFM0P_DS_BUR04_BUR041                  *((volatile unsigned int*)(0x426B2064UL))
#define bFM0P_DS_BUR04_BUR042                  *((volatile unsigned int*)(0x426B2068UL))
#define bFM0P_DS_BUR04_BUR043                  *((volatile unsigned int*)(0x426B206CUL))
#define bFM0P_DS_BUR04_BUR044                  *((volatile unsigned int*)(0x426B2070UL))
#define bFM0P_DS_BUR04_BUR045                  *((volatile unsigned int*)(0x426B2074UL))
#define bFM0P_DS_BUR04_BUR046                  *((volatile unsigned int*)(0x426B2078UL))
#define bFM0P_DS_BUR04_BUR047                  *((volatile unsigned int*)(0x426B207CUL))
#define bFM0P_DS_BUR05_BUR050                  *((volatile unsigned int*)(0x426B2080UL))
#define bFM0P_DS_BUR05_BUR051                  *((volatile unsigned int*)(0x426B2084UL))
#define bFM0P_DS_BUR05_BUR052                  *((volatile unsigned int*)(0x426B2088UL))
#define bFM0P_DS_BUR05_BUR053                  *((volatile unsigned int*)(0x426B208CUL))
#define bFM0P_DS_BUR05_BUR054                  *((volatile unsigned int*)(0x426B2090UL))
#define bFM0P_DS_BUR05_BUR055                  *((volatile unsigned int*)(0x426B2094UL))
#define bFM0P_DS_BUR05_BUR056                  *((volatile unsigned int*)(0x426B2098UL))
#define bFM0P_DS_BUR05_BUR057                  *((volatile unsigned int*)(0x426B209CUL))
#define bFM0P_DS_BUR06_BUR060                  *((volatile unsigned int*)(0x426B20A0UL))
#define bFM0P_DS_BUR06_BUR061                  *((volatile unsigned int*)(0x426B20A4UL))
#define bFM0P_DS_BUR06_BUR062                  *((volatile unsigned int*)(0x426B20A8UL))
#define bFM0P_DS_BUR06_BUR063                  *((volatile unsigned int*)(0x426B20ACUL))
#define bFM0P_DS_BUR06_BUR064                  *((volatile unsigned int*)(0x426B20B0UL))
#define bFM0P_DS_BUR06_BUR065                  *((volatile unsigned int*)(0x426B20B4UL))
#define bFM0P_DS_BUR06_BUR066                  *((volatile unsigned int*)(0x426B20B8UL))
#define bFM0P_DS_BUR06_BUR067                  *((volatile unsigned int*)(0x426B20BCUL))
#define bFM0P_DS_BUR07_BUR070                  *((volatile unsigned int*)(0x426B20C0UL))
#define bFM0P_DS_BUR07_BUR071                  *((volatile unsigned int*)(0x426B20C4UL))
#define bFM0P_DS_BUR07_BUR072                  *((volatile unsigned int*)(0x426B20C8UL))
#define bFM0P_DS_BUR07_BUR073                  *((volatile unsigned int*)(0x426B20CCUL))
#define bFM0P_DS_BUR07_BUR074                  *((volatile unsigned int*)(0x426B20D0UL))
#define bFM0P_DS_BUR07_BUR075                  *((volatile unsigned int*)(0x426B20D4UL))
#define bFM0P_DS_BUR07_BUR076                  *((volatile unsigned int*)(0x426B20D8UL))
#define bFM0P_DS_BUR07_BUR077                  *((volatile unsigned int*)(0x426B20DCUL))
#define bFM0P_DS_BUR08_BUR080                  *((volatile unsigned int*)(0x426B20E0UL))
#define bFM0P_DS_BUR08_BUR081                  *((volatile unsigned int*)(0x426B20E4UL))
#define bFM0P_DS_BUR08_BUR082                  *((volatile unsigned int*)(0x426B20E8UL))
#define bFM0P_DS_BUR08_BUR083                  *((volatile unsigned int*)(0x426B20ECUL))
#define bFM0P_DS_BUR08_BUR084                  *((volatile unsigned int*)(0x426B20F0UL))
#define bFM0P_DS_BUR08_BUR085                  *((volatile unsigned int*)(0x426B20F4UL))
#define bFM0P_DS_BUR08_BUR086                  *((volatile unsigned int*)(0x426B20F8UL))
#define bFM0P_DS_BUR08_BUR087                  *((volatile unsigned int*)(0x426B20FCUL))
#define bFM0P_DS_BUR09_BUR090                  *((volatile unsigned int*)(0x426B2100UL))
#define bFM0P_DS_BUR09_BUR091                  *((volatile unsigned int*)(0x426B2104UL))
#define bFM0P_DS_BUR09_BUR092                  *((volatile unsigned int*)(0x426B2108UL))
#define bFM0P_DS_BUR09_BUR093                  *((volatile unsigned int*)(0x426B210CUL))
#define bFM0P_DS_BUR09_BUR094                  *((volatile unsigned int*)(0x426B2110UL))
#define bFM0P_DS_BUR09_BUR095                  *((volatile unsigned int*)(0x426B2114UL))
#define bFM0P_DS_BUR09_BUR096                  *((volatile unsigned int*)(0x426B2118UL))
#define bFM0P_DS_BUR09_BUR097                  *((volatile unsigned int*)(0x426B211CUL))
#define bFM0P_DS_BUR10_BUR100                  *((volatile unsigned int*)(0x426B2120UL))
#define bFM0P_DS_BUR10_BUR101                  *((volatile unsigned int*)(0x426B2124UL))
#define bFM0P_DS_BUR10_BUR102                  *((volatile unsigned int*)(0x426B2128UL))
#define bFM0P_DS_BUR10_BUR103                  *((volatile unsigned int*)(0x426B212CUL))
#define bFM0P_DS_BUR10_BUR104                  *((volatile unsigned int*)(0x426B2130UL))
#define bFM0P_DS_BUR10_BUR105                  *((volatile unsigned int*)(0x426B2134UL))
#define bFM0P_DS_BUR10_BUR106                  *((volatile unsigned int*)(0x426B2138UL))
#define bFM0P_DS_BUR10_BUR107                  *((volatile unsigned int*)(0x426B213CUL))
#define bFM0P_DS_BUR11_BUR110                  *((volatile unsigned int*)(0x426B2140UL))
#define bFM0P_DS_BUR11_BUR111                  *((volatile unsigned int*)(0x426B2144UL))
#define bFM0P_DS_BUR11_BUR112                  *((volatile unsigned int*)(0x426B2148UL))
#define bFM0P_DS_BUR11_BUR113                  *((volatile unsigned int*)(0x426B214CUL))
#define bFM0P_DS_BUR11_BUR114                  *((volatile unsigned int*)(0x426B2150UL))
#define bFM0P_DS_BUR11_BUR115                  *((volatile unsigned int*)(0x426B2154UL))
#define bFM0P_DS_BUR11_BUR116                  *((volatile unsigned int*)(0x426B2158UL))
#define bFM0P_DS_BUR11_BUR117                  *((volatile unsigned int*)(0x426B215CUL))
#define bFM0P_DS_BUR12_BUR120                  *((volatile unsigned int*)(0x426B2160UL))
#define bFM0P_DS_BUR12_BUR121                  *((volatile unsigned int*)(0x426B2164UL))
#define bFM0P_DS_BUR12_BUR122                  *((volatile unsigned int*)(0x426B2168UL))
#define bFM0P_DS_BUR12_BUR123                  *((volatile unsigned int*)(0x426B216CUL))
#define bFM0P_DS_BUR12_BUR124                  *((volatile unsigned int*)(0x426B2170UL))
#define bFM0P_DS_BUR12_BUR125                  *((volatile unsigned int*)(0x426B2174UL))
#define bFM0P_DS_BUR12_BUR126                  *((volatile unsigned int*)(0x426B2178UL))
#define bFM0P_DS_BUR12_BUR127                  *((volatile unsigned int*)(0x426B217CUL))
#define bFM0P_DS_BUR13_BUR130                  *((volatile unsigned int*)(0x426B2180UL))
#define bFM0P_DS_BUR13_BUR131                  *((volatile unsigned int*)(0x426B2184UL))
#define bFM0P_DS_BUR13_BUR132                  *((volatile unsigned int*)(0x426B2188UL))
#define bFM0P_DS_BUR13_BUR133                  *((volatile unsigned int*)(0x426B218CUL))
#define bFM0P_DS_BUR13_BUR134                  *((volatile unsigned int*)(0x426B2190UL))
#define bFM0P_DS_BUR13_BUR135                  *((volatile unsigned int*)(0x426B2194UL))
#define bFM0P_DS_BUR13_BUR136                  *((volatile unsigned int*)(0x426B2198UL))
#define bFM0P_DS_BUR13_BUR137                  *((volatile unsigned int*)(0x426B219CUL))
#define bFM0P_DS_BUR14_BUR140                  *((volatile unsigned int*)(0x426B21A0UL))
#define bFM0P_DS_BUR14_BUR141                  *((volatile unsigned int*)(0x426B21A4UL))
#define bFM0P_DS_BUR14_BUR142                  *((volatile unsigned int*)(0x426B21A8UL))
#define bFM0P_DS_BUR14_BUR143                  *((volatile unsigned int*)(0x426B21ACUL))
#define bFM0P_DS_BUR14_BUR144                  *((volatile unsigned int*)(0x426B21B0UL))
#define bFM0P_DS_BUR14_BUR145                  *((volatile unsigned int*)(0x426B21B4UL))
#define bFM0P_DS_BUR14_BUR146                  *((volatile unsigned int*)(0x426B21B8UL))
#define bFM0P_DS_BUR14_BUR147                  *((volatile unsigned int*)(0x426B21BCUL))
#define bFM0P_DS_BUR15_BUR150                  *((volatile unsigned int*)(0x426B21C0UL))
#define bFM0P_DS_BUR15_BUR151                  *((volatile unsigned int*)(0x426B21C4UL))
#define bFM0P_DS_BUR15_BUR152                  *((volatile unsigned int*)(0x426B21C8UL))
#define bFM0P_DS_BUR15_BUR153                  *((volatile unsigned int*)(0x426B21CCUL))
#define bFM0P_DS_BUR15_BUR154                  *((volatile unsigned int*)(0x426B21D0UL))
#define bFM0P_DS_BUR15_BUR155                  *((volatile unsigned int*)(0x426B21D4UL))
#define bFM0P_DS_BUR15_BUR156                  *((volatile unsigned int*)(0x426B21D8UL))
#define bFM0P_DS_BUR15_BUR157                  *((volatile unsigned int*)(0x426B21DCUL))
#define bFM0P_DS_BUR16_BUR160                  *((volatile unsigned int*)(0x426B21E0UL))
#define bFM0P_DS_BUR16_BUR161                  *((volatile unsigned int*)(0x426B21E4UL))
#define bFM0P_DS_BUR16_BUR162                  *((volatile unsigned int*)(0x426B21E8UL))
#define bFM0P_DS_BUR16_BUR163                  *((volatile unsigned int*)(0x426B21ECUL))
#define bFM0P_DS_BUR16_BUR164                  *((volatile unsigned int*)(0x426B21F0UL))
#define bFM0P_DS_BUR16_BUR165                  *((volatile unsigned int*)(0x426B21F4UL))
#define bFM0P_DS_BUR16_BUR166                  *((volatile unsigned int*)(0x426B21F8UL))
#define bFM0P_DS_BUR16_BUR167                  *((volatile unsigned int*)(0x426B21FCUL))

