furjie/Single-BLDC-driver-and-app/s6e1a1.h
/* MFS UART channel 0 registers */
#define bFM0P_MFS0_UART_SMR_SOE                *((volatile unsigned int*)(0x42700000UL))
#define bFM0P_MFS0_UART_SMR_BDS                *((volatile unsigned int*)(0x42700008UL))
#define bFM0P_MFS0_UART_SMR_SBL                *((volatile unsigned int*)(0x4270000CUL))
#define bFM0P_MFS0_UART_SMR_MD0                *((volatile unsigned int*)(0x42700014UL))
#define bFM0P_MFS0_UART_SMR_MD1                *((volatile unsigned int*)(0x42700018UL))
#define bFM0P_MFS0_UART_SMR_MD2                *((volatile unsigned int*)(0x4270001CUL))
#define bFM0P_MFS0_UART_SCR_TXE                *((volatile unsigned int*)(0x42700020UL))
#define bFM0P_MFS0_UART_SCR_RXE                *((volatile unsigned int*)(0x42700024UL))
#define bFM0P_MFS0_UART_SCR_TBIE               *((volatile unsigned int*)(0x42700028UL))
#define bFM0P_MFS0_UART_SCR_TIE                *((volatile unsigned int*)(0x4270002CUL))
#define bFM0P_MFS0_UART_SCR_RIE                *((volatile unsigned int*)(0x42700030UL))
#define bFM0P_MFS0_UART_SCR_UPCL               *((volatile unsigned int*)(0x4270003CUL))
#define bFM0P_MFS0_UART_ESCR_L0                *((volatile unsigned int*)(0x42700080UL))
#define bFM0P_MFS0_UART_ESCR_L1                *((volatile unsigned int*)(0x42700084UL))
#define bFM0P_MFS0_UART_ESCR_L2                *((volatile unsigned int*)(0x42700088UL))
#define bFM0P_MFS0_UART_ESCR_P                 *((volatile unsigned int*)(0x4270008CUL))
#define bFM0P_MFS0_UART_ESCR_PEN               *((volatile unsigned int*)(0x42700090UL))
#define bFM0P_MFS0_UART_ESCR_INV               *((volatile unsigned int*)(0x42700094UL))
#define bFM0P_MFS0_UART_ESCR_ESBL              *((volatile unsigned int*)(0x42700098UL))
#define bFM0P_MFS0_UART_ESCR_FLWEN             *((volatile unsigned int*)(0x4270009CUL))
#define bFM0P_MFS0_UART_SSR_TBI                *((volatile unsigned int*)(0x427000A0UL))
#define bFM0P_MFS0_UART_SSR_TDRE               *((volatile unsigned int*)(0x427000A4UL))
#define bFM0P_MFS0_UART_SSR_RDRF               *((volatile unsigned int*)(0x427000A8UL))
#define bFM0P_MFS0_UART_SSR_ORE                *((volatile unsigned int*)(0x427000ACUL))
#define bFM0P_MFS0_UART_SSR_FRE                *((volatile unsigned int*)(0x427000B0UL))
#define bFM0P_MFS0_UART_SSR_PE                 *((volatile unsigned int*)(0x427000B4UL))
#define bFM0P_MFS0_UART_SSR_REC                *((volatile unsigned int*)(0x427000BCUL))
#define bFM0P_MFS0_UART_BGR_BGR00              *((volatile unsigned int*)(0x42700180UL))
#define bFM0P_MFS0_UART_BGR_BGR01              *((volatile unsigned int*)(0x42700184UL))
#define bFM0P_MFS0_UART_BGR_BGR02              *((volatile unsigned int*)(0x42700188UL))
#define bFM0P_MFS0_UART_BGR_BGR03              *((volatile unsigned int*)(0x4270018CUL))
#define bFM0P_MFS0_UART_BGR_BGR04              *((volatile unsigned int*)(0x42700190UL))
#define bFM0P_MFS0_UART_BGR_BGR05              *((volatile unsigned int*)(0x42700194UL))
#define bFM0P_MFS0_UART_BGR_BGR06              *((volatile unsigned int*)(0x42700198UL))
#define bFM0P_MFS0_UART_BGR_BGR07              *((volatile unsigned int*)(0x4270019CUL))
#define bFM0P_MFS0_UART_BGR_BGR10              *((volatile unsigned int*)(0x427001A0UL))
#define bFM0P_MFS0_UART_BGR_BGR11              *((volatile unsigned int*)(0x427001A4UL))
#define bFM0P_MFS0_UART_BGR_BGR12              *((volatile unsigned int*)(0x427001A8UL))
#define bFM0P_MFS0_UART_BGR_BGR13              *((volatile unsigned int*)(0x427001ACUL))
#define bFM0P_MFS0_UART_BGR_BGR14              *((volatile unsigned int*)(0x427001B0UL))
#define bFM0P_MFS0_UART_BGR_BGR15              *((volatile unsigned int*)(0x427001B4UL))
#define bFM0P_MFS0_UART_BGR_BGR16              *((volatile unsigned int*)(0x427001B8UL))
#define bFM0P_MFS0_UART_BGR_EXT                *((volatile unsigned int*)(0x427001BCUL))
#define bFM0P_MFS0_UART_FCR0_FE1               *((volatile unsigned int*)(0x42700280UL))
#define bFM0P_MFS0_UART_FCR0_FE2               *((volatile unsigned int*)(0x42700284UL))
#define bFM0P_MFS0_UART_FCR0_FCL1              *((volatile unsigned int*)(0x42700288UL))
#define bFM0P_MFS0_UART_FCR0_FCL2              *((volatile unsigned int*)(0x4270028CUL))
#define bFM0P_MFS0_UART_FCR0_FSET              *((volatile unsigned int*)(0x42700290UL))
#define bFM0P_MFS0_UART_FCR0_FLD               *((volatile unsigned int*)(0x42700294UL))
#define bFM0P_MFS0_UART_FCR0_FLST              *((volatile unsigned int*)(0x42700298UL))
#define bFM0P_MFS0_UART_FCR1_FSEL              *((volatile unsigned int*)(0x427002A0UL))
#define bFM0P_MFS0_UART_FCR1_FTIE              *((volatile unsigned int*)(0x427002A4UL))
#define bFM0P_MFS0_UART_FCR1_FDRQ              *((volatile unsigned int*)(0x427002A8UL))
#define bFM0P_MFS0_UART_FCR1_FRIIE             *((volatile unsigned int*)(0x427002ACUL))
#define bFM0P_MFS0_UART_FCR1_FLSTE             *((volatile unsigned int*)(0x427002B0UL))
/* MFS CSIO channel 0 registers */
#define bFM0P_MFS0_CSIO_SMR_SOE                *((volatile unsigned int*)(0x42700000UL))
#define bFM0P_MFS0_CSIO_SMR_SCKE               *((volatile unsigned int*)(0x42700004UL))
#define bFM0P_MFS0_CSIO_SMR_BDS                *((volatile unsigned int*)(0x42700008UL))
#define bFM0P_MFS0_CSIO_SMR_SCINV              *((volatile unsigned int*)(0x4270000CUL))
#define bFM0P_MFS0_CSIO_SMR_MD0                *((volatile unsigned int*)(0x42700014UL))
#define bFM0P_MFS0_CSIO_SMR_MD1                *((volatile unsigned int*)(0x42700018UL))
#define bFM0P_MFS0_CSIO_SMR_MD2                *((volatile unsigned int*)(0x4270001CUL))
#define bFM0P_MFS0_CSIO_SCR_TXE                *((volatile unsigned int*)(0x42700020UL))
#define bFM0P_MFS0_CSIO_SCR_RXE                *((volatile unsigned int*)(0x42700024UL))
#define bFM0P_MFS0_CSIO_SCR_TBIE               *((volatile unsigned int*)(0x42700028UL))
#define bFM0P_MFS0_CSIO_SCR_TIE                *((volatile unsigned int*)(0x4270002CUL))
#define bFM0P_MFS0_CSIO_SCR_RIE                *((volatile unsigned int*)(0x42700030UL))
#define bFM0P_MFS0_CSIO_SCR_SPI                *((volatile unsigned int*)(0x42700034UL))
#define bFM0P_MFS0_CSIO_SCR_MS                 *((volatile unsigned int*)(0x42700038UL))
#define bFM0P_MFS0_CSIO_SCR_UPCL               *((volatile unsigned int*)(0x4270003CUL))
#define bFM0P_MFS0_CSIO_ESCR_L0                *((volatile unsigned int*)(0x42700080UL))
#define bFM0P_MFS0_CSIO_ESCR_L1                *((volatile unsigned int*)(0x42700084UL))
#define bFM0P_MFS0_CSIO_ESCR_L2                *((volatile unsigned int*)(0x42700088UL))
#define bFM0P_MFS0_CSIO_ESCR_WT0               *((volatile unsigned int*)(0x4270008CUL))
#define bFM0P_MFS0_CSIO_ESCR_WT1               *((volatile unsigned int*)(0x42700090UL))
#define bFM0P_MFS0_CSIO_ESCR_CSFE              *((volatile unsigned int*)(0x42700094UL))
#define bFM0P_MFS0_CSIO_ESCR_L3                *((volatile unsigned int*)(0x42700098UL))
#define bFM0P_MFS0_CSIO_ESCR_SOP               *((volatile unsigned int*)(0x4270009CUL))
#define bFM0P_MFS0_CSIO_SSR_TBI                *((volatile unsigned int*)(0x427000A0UL))
#define bFM0P_MFS0_CSIO_SSR_TDRE               *((volatile unsigned int*)(0x427000A4UL))
#define bFM0P_MFS0_CSIO_SSR_RDRF               *((volatile unsigned int*)(0x427000A8UL))
#define bFM0P_MFS0_CSIO_SSR_ORE                *((volatile unsigned int*)(0x427000ACUL))
#define bFM0P_MFS0_CSIO_SSR_REC                *((volatile unsigned int*)(0x427000BCUL))
#define bFM0P_MFS0_CSIO_BGR_BGR00              *((volatile unsigned int*)(0x42700180UL))
#define bFM0P_MFS0_CSIO_BGR_BGR01              *((volatile unsigned int*)(0x42700184UL))
#define bFM0P_MFS0_CSIO_BGR_BGR02              *((volatile unsigned int*)(0x42700188UL))
#define bFM0P_MFS0_CSIO_BGR_BGR03              *((volatile unsigned int*)(0x4270018CUL))
#define bFM0P_MFS0_CSIO_BGR_BGR04              *((volatile unsigned int*)(0x42700190UL))
#define bFM0P_MFS0_CSIO_BGR_BGR05              *((volatile unsigned int*)(0x42700194UL))
#define bFM0P_MFS0_CSIO_BGR_BGR06              *((volatile unsigned int*)(0x42700198UL))
#define bFM0P_MFS0_CSIO_BGR_BGR07              *((volatile unsigned int*)(0x4270019CUL))
#define bFM0P_MFS0_CSIO_BGR_BGR10              *((volatile unsigned int*)(0x427001A0UL))
#define bFM0P_MFS0_CSIO_BGR_BGR11              *((volatile unsigned int*)(0x427001A4UL))
#define bFM0P_MFS0_CSIO_BGR_BGR12              *((volatile unsigned int*)(0x427001A8UL))
#define bFM0P_MFS0_CSIO_BGR_BGR13              *((volatile unsigned int*)(0x427001ACUL))
#define bFM0P_MFS0_CSIO_BGR_BGR14              *((volatile unsigned int*)(0x427001B0UL))
#define bFM0P_MFS0_CSIO_BGR_BGR15              *((volatile unsigned int*)(0x427001B4UL))
#define bFM0P_MFS0_CSIO_BGR_BGR16              *((volatile unsigned int*)(0x427001B8UL))
#define bFM0P_MFS0_CSIO_FCR0_FE1               *((volatile unsigned int*)(0x42700280UL))
#define bFM0P_MFS0_CSIO_FCR0_FE2               *((volatile unsigned int*)(0x42700284UL))
#define bFM0P_MFS0_CSIO_FCR0_FCL1              *((volatile unsigned int*)(0x42700288UL))
#define bFM0P_MFS0_CSIO_FCR0_FCL2              *((volatile unsigned int*)(0x4270028CUL))
#define bFM0P_MFS0_CSIO_FCR0_FSET              *((volatile unsigned int*)(0x42700290UL))
#define bFM0P_MFS0_CSIO_FCR0_FLD               *((volatile unsigned int*)(0x42700294UL))
#define bFM0P_MFS0_CSIO_FCR0_FLST              *((volatile unsigned int*)(0x42700298UL))
#define bFM0P_MFS0_CSIO_FCR1_FSEL              *((volatile unsigned int*)(0x427002A0UL))
#define bFM0P_MFS0_CSIO_FCR1_FTIE              *((volatile unsigned int*)(0x427002A4UL))
#define bFM0P_MFS0_CSIO_FCR1_FDRQ              *((volatile unsigned int*)(0x427002A8UL))
#define bFM0P_MFS0_CSIO_FCR1_FRIIE             *((volatile unsigned int*)(0x427002ACUL))
#define bFM0P_MFS0_CSIO_FCR1_FLSTE             *((volatile unsigned int*)(0x427002B0UL))
#define bFM0P_MFS0_CSIO_SCSTR0_CSHD0           *((volatile unsigned int*)(0x42700380UL))
#define bFM0P_MFS0_CSIO_SCSTR0_CSHD1           *((volatile unsigned int*)(0x42700384UL))
#define bFM0P_MFS0_CSIO_SCSTR0_CSHD2           *((volatile unsigned int*)(0x42700388UL))
#define bFM0P_MFS0_CSIO_SCSTR0_CSHD3           *((volatile unsigned int*)(0x4270038CUL))
#define bFM0P_MFS0_CSIO_SCSTR0_CSHD4           *((volatile unsigned int*)(0x42700390UL))
#define bFM0P_MFS0_CSIO_SCSTR0_CSHD5           *((volatile unsigned int*)(0x42700394UL))
#define bFM0P_MFS0_CSIO_SCSTR0_CSHD6           *((volatile unsigned int*)(0x42700398UL))
#define bFM0P_MFS0_CSIO_SCSTR0_CSHD7           *((volatile unsigned int*)(0x4270039CUL))
#define bFM0P_MFS0_CSIO_SCSTR1_CSSU0           *((volatile unsigned int*)(0x427003A0UL))
#define bFM0P_MFS0_CSIO_SCSTR1_CSSU1           *((volatile unsigned int*)(0x427003A4UL))
#define bFM0P_MFS0_CSIO_SCSTR1_CSSU2           *((volatile unsigned int*)(0x427003A8UL))
#define bFM0P_MFS0_CSIO_SCSTR1_CSSU3           *((volatile unsigned int*)(0x427003ACUL))
#define bFM0P_MFS0_CSIO_SCSTR1_CSSU4           *((volatile unsigned int*)(0x427003B0UL))
#define bFM0P_MFS0_CSIO_SCSTR1_CSSU5           *((volatile unsigned int*)(0x427003B4UL))
#define bFM0P_MFS0_CSIO_SCSTR1_CSSU6           *((volatile unsigned int*)(0x427003B8UL))
#define bFM0P_MFS0_CSIO_SCSTR1_CSSU7           *((volatile unsigned int*)(0x427003BCUL))
#define bFM0P_MFS0_CSIO_SCSTR32_CSDS0          *((volatile unsigned int*)(0x42700400UL))
#define bFM0P_MFS0_CSIO_SCSTR32_CSDS1          *((volatile unsigned int*)(0x42700404UL))
#define bFM0P_MFS0_CSIO_SCSTR32_CSDS2          *((volatile unsigned int*)(0x42700408UL))
#define bFM0P_MFS0_CSIO_SCSTR32_CSDS3          *((volatile unsigned int*)(0x4270040CUL))
#define bFM0P_MFS0_CSIO_SCSTR32_CSDS4          *((volatile unsigned int*)(0x42700410UL))
#define bFM0P_MFS0_CSIO_SCSTR32_CSDS5          *((volatile unsigned int*)(0x42700414UL))
#define bFM0P_MFS0_CSIO_SCSTR32_CSDS6          *((volatile unsigned int*)(0x42700418UL))
#define bFM0P_MFS0_CSIO_SCSTR32_CSDS7          *((volatile unsigned int*)(0x4270041CUL))
#define bFM0P_MFS0_CSIO_SCSTR32_CSDS8          *((volatile unsigned int*)(0x42700420UL))
#define bFM0P_MFS0_CSIO_SCSTR32_CSDS9          *((volatile unsigned int*)(0x42700424UL))
#define bFM0P_MFS0_CSIO_SCSTR32_CSDS10         *((volatile unsigned int*)(0x42700428UL))
#define bFM0P_MFS0_CSIO_SCSTR32_CSDS11         *((volatile unsigned int*)(0x4270042CUL))
#define bFM0P_MFS0_CSIO_SCSTR32_CSDS12         *((volatile unsigned int*)(0x42700430UL))
#define bFM0P_MFS0_CSIO_SCSTR32_CSDS13         *((volatile unsigned int*)(0x42700434UL))
#define bFM0P_MFS0_CSIO_SCSTR32_CSDS14         *((volatile unsigned int*)(0x42700438UL))
#define bFM0P_MFS0_CSIO_SCSTR32_CSDS15         *((volatile unsigned int*)(0x4270043CUL))
#define bFM0P_MFS0_CSIO_SACSR_TMRE             *((volatile unsigned int*)(0x42700480UL))
#define bFM0P_MFS0_CSIO_SACSR_TDIV0            *((volatile unsigned int*)(0x42700484UL))
#define bFM0P_MFS0_CSIO_SACSR_TDIV1            *((volatile unsigned int*)(0x42700488UL))
#define bFM0P_MFS0_CSIO_SACSR_TDIV2            *((volatile unsigned int*)(0x4270048CUL))
#define bFM0P_MFS0_CSIO_SACSR_TDIV3            *((volatile unsigned int*)(0x42700490UL))
#define bFM0P_MFS0_CSIO_SACSR_TSYNE            *((volatile unsigned int*)(0x42700498UL))
#define bFM0P_MFS0_CSIO_SACSR_TINTE            *((volatile unsigned int*)(0x4270049CUL))
#define bFM0P_MFS0_CSIO_SACSR_TINT             *((volatile unsigned int*)(0x427004A0UL))
#define bFM0P_MFS0_CSIO_SACSR_CSE              *((volatile unsigned int*)(0x427004ACUL))
#define bFM0P_MFS0_CSIO_SACSR_CSEIE            *((volatile unsigned int*)(0x427004B0UL))
#define bFM0P_MFS0_CSIO_SACSR_TBEEN            *((volatile unsigned int*)(0x427004B4UL))
#define bFM0P_MFS0_CSIO_STMR_TM0               *((volatile unsigned int*)(0x42700500UL))
#define bFM0P_MFS0_CSIO_STMR_TM1               *((volatile unsigned int*)(0x42700504UL))
#define bFM0P_MFS0_CSIO_STMR_TM2               *((volatile unsigned int*)(0x42700508UL))
#define bFM0P_MFS0_CSIO_STMR_TM3               *((volatile unsigned int*)(0x4270050CUL))
#define bFM0P_MFS0_CSIO_STMR_TM4               *((volatile unsigned int*)(0x42700510UL))
#define bFM0P_MFS0_CSIO_STMR_TM5               *((volatile unsigned int*)(0x42700514UL))
#define bFM0P_MFS0_CSIO_STMR_TM6               *((volatile unsigned int*)(0x42700518UL))
#define bFM0P_MFS0_CSIO_STMR_TM7               *((volatile unsigned int*)(0x4270051CUL))
#define bFM0P_MFS0_CSIO_STMR_TM8               *((volatile unsigned int*)(0x42700520UL))
#define bFM0P_MFS0_CSIO_STMR_TM9               *((volatile unsigned int*)(0x42700524UL))
#define bFM0P_MFS0_CSIO_STMR_TM10              *((volatile unsigned int*)(0x42700528UL))
#define bFM0P_MFS0_CSIO_STMR_TM11              *((volatile unsigned int*)(0x4270052CUL))
#define bFM0P_MFS0_CSIO_STMR_TM12              *((volatile unsigned int*)(0x42700530UL))
#define bFM0P_MFS0_CSIO_STMR_TM13              *((volatile unsigned int*)(0x42700534UL))
#define bFM0P_MFS0_CSIO_STMR_TM14              *((volatile unsigned int*)(0x42700538UL))
#define bFM0P_MFS0_CSIO_STMR_TM15              *((volatile unsigned int*)(0x4270053CUL))
#define bFM0P_MFS0_CSIO_TMCR_TC0               *((volatile unsigned int*)(0x42700580UL))
#define bFM0P_MFS0_CSIO_TMCR_TC1               *((volatile unsigned int*)(0x42700584UL))
#define bFM0P_MFS0_CSIO_TMCR_TC2               *((volatile unsigned int*)(0x42700588UL))
#define bFM0P_MFS0_CSIO_TMCR_TC3               *((volatile unsigned int*)(0x4270058CUL))
#define bFM0P_MFS0_CSIO_TMCR_TC4               *((volatile unsigned int*)(0x42700590UL))
#define bFM0P_MFS0_CSIO_TMCR_TC5               *((volatile unsigned int*)(0x42700594UL))
#define bFM0P_MFS0_CSIO_TMCR_TC6               *((volatile unsigned int*)(0x42700598UL))
#define bFM0P_MFS0_CSIO_TMCR_TC7               *((volatile unsigned int*)(0x4270059CUL))
#define bFM0P_MFS0_CSIO_TMCR_TC8               *((volatile unsigned int*)(0x427005A0UL))
#define bFM0P_MFS0_CSIO_TMCR_TC9               *((volatile unsigned int*)(0x427005A4UL))
#define bFM0P_MFS0_CSIO_TMCR_TC10              *((volatile unsigned int*)(0x427005A8UL))
#define bFM0P_MFS0_CSIO_TMCR_TC11              *((volatile unsigned int*)(0x427005ACUL))
#define bFM0P_MFS0_CSIO_TMCR_TC12              *((volatile unsigned int*)(0x427005B0UL))
#define bFM0P_MFS0_CSIO_TMCR_TC13              *((volatile unsigned int*)(0x427005B4UL))
#define bFM0P_MFS0_CSIO_TMCR_TC14              *((volatile unsigned int*)(0x427005B8UL))
#define bFM0P_MFS0_CSIO_TMCR_TC15              *((volatile unsigned int*)(0x427005BCUL))
#define bFM0P_MFS0_CSIO_SCSCR_CSOE             *((volatile unsigned int*)(0x42700600UL))
#define bFM0P_MFS0_CSIO_SCSCR_CSEN0            *((volatile unsigned int*)(0x42700604UL))
#define bFM0P_MFS0_CSIO_SCSCR_CSEN1            *((volatile unsigned int*)(0x42700608UL))
#define bFM0P_MFS0_CSIO_SCSCR_CSEN2            *((volatile unsigned int*)(0x4270060CUL))
#define bFM0P_MFS0_CSIO_SCSCR_CSEN3            *((volatile unsigned int*)(0x42700610UL))
#define bFM0P_MFS0_CSIO_SCSCR_CSLVL            *((volatile unsigned int*)(0x42700614UL))
#define bFM0P_MFS0_CSIO_SCSCR_CDIV0            *((volatile unsigned int*)(0x42700618UL))
#define bFM0P_MFS0_CSIO_SCSCR_CDIV1            *((volatile unsigned int*)(0x4270061CUL))
#define bFM0P_MFS0_CSIO_SCSCR_CDIV2            *((volatile unsigned int*)(0x42700620UL))
#define bFM0P_MFS0_CSIO_SCSCR_SCAM             *((volatile unsigned int*)(0x42700624UL))
#define bFM0P_MFS0_CSIO_SCSCR_SCD0             *((volatile unsigned int*)(0x42700628UL))
#define bFM0P_MFS0_CSIO_SCSCR_SCD1             *((volatile unsigned int*)(0x4270062CUL))
#define bFM0P_MFS0_CSIO_SCSCR_SED0             *((volatile unsigned int*)(0x42700630UL))
#define bFM0P_MFS0_CSIO_SCSCR_SED1             *((volatile unsigned int*)(0x42700634UL))
#define bFM0P_MFS0_CSIO_SCSCR_SST0             *((volatile unsigned int*)(0x42700638UL))
#define bFM0P_MFS0_CSIO_SCSCR_SST1             *((volatile unsigned int*)(0x4270063CUL))
#define bFM0P_MFS0_CSIO_SCSFR0_CS1L0           *((volatile unsigned int*)(0x42700680UL))
#define bFM0P_MFS0_CSIO_SCSFR0_CS1L1           *((volatile unsigned int*)(0x42700684UL))
#define bFM0P_MFS0_CSIO_SCSFR0_CS1L2           *((volatile unsigned int*)(0x42700688UL))
#define bFM0P_MFS0_CSIO_SCSFR0_CS1L3           *((volatile unsigned int*)(0x4270068CUL))
#define bFM0P_MFS0_CSIO_SCSFR0_CS1BDS          *((volatile unsigned int*)(0x42700690UL))
#define bFM0P_MFS0_CSIO_SCSFR0_CS1SPI          *((volatile unsigned int*)(0x42700694UL))
#define bFM0P_MFS0_CSIO_SCSFR0_CS1SCINV        *((volatile unsigned int*)(0x42700698UL))
#define bFM0P_MFS0_CSIO_SCSFR0_CS1CSLVL        *((volatile unsigned int*)(0x4270069CUL))
#define bFM0P_MFS0_CSIO_SCSFR1_CS2L0           *((volatile unsigned int*)(0x427006A0UL))
#define bFM0P_MFS0_CSIO_SCSFR1_CS2L1           *((volatile unsigned int*)(0x427006A4UL))
#define bFM0P_MFS0_CSIO_SCSFR1_CS2L2           *((volatile unsigned int*)(0x427006A8UL))
#define bFM0P_MFS0_CSIO_SCSFR1_CS2L3           *((volatile unsigned int*)(0x427006ACUL))
#define bFM0P_MFS0_CSIO_SCSFR1_CS2BDS          *((volatile unsigned int*)(0x427006B0UL))
#define bFM0P_MFS0_CSIO_SCSFR1_CS2SPI          *((volatile unsigned int*)(0x427006B4UL))
#define bFM0P_MFS0_CSIO_SCSFR1_CS2SCINV        *((volatile unsigned int*)(0x427006B8UL))
#define bFM0P_MFS0_CSIO_SCSFR1_CS2CSLVL        *((volatile unsigned int*)(0x427006BCUL))
#define bFM0P_MFS0_CSIO_SCSFR3_CS3L0           *((volatile unsigned int*)(0x42700700UL))
#define bFM0P_MFS0_CSIO_SCSFR3_CS3L1           *((volatile unsigned int*)(0x42700704UL))
#define bFM0P_MFS0_CSIO_SCSFR3_CS3L2           *((volatile unsigned int*)(0x42700708UL))
#define bFM0P_MFS0_CSIO_SCSFR3_CS3L3           *((volatile unsigned int*)(0x4270070CUL))
#define bFM0P_MFS0_CSIO_SCSFR3_CS3BDS          *((volatile unsigned int*)(0x42700710UL))
#define bFM0P_MFS0_CSIO_SCSFR3_CS3SPI          *((volatile unsigned int*)(0x42700714UL))
#define bFM0P_MFS0_CSIO_SCSFR3_CS3SCINV        *((volatile unsigned int*)(0x42700718UL))
#define bFM0P_MFS0_CSIO_SCSFR3_CS3CSLVL        *((volatile unsigned int*)(0x4270071CUL))

