furjie/Single-BLDC-driver-and-app/s6e1a1.h
/* MFS LIN channel 0 registers */
#define bFM0P_MFS0_LIN_SMR_SOE                 *((volatile unsigned int*)(0x42700000UL))
#define bFM0P_MFS0_LIN_SMR_SBL                 *((volatile unsigned int*)(0x4270000CUL))
#define bFM0P_MFS0_LIN_SMR_MD0                 *((volatile unsigned int*)(0x42700014UL))
#define bFM0P_MFS0_LIN_SMR_MD1                 *((volatile unsigned int*)(0x42700018UL))
#define bFM0P_MFS0_LIN_SMR_MD2                 *((volatile unsigned int*)(0x4270001CUL))
#define bFM0P_MFS0_LIN_SCR_TXE                 *((volatile unsigned int*)(0x42700020UL))
#define bFM0P_MFS0_LIN_SCR_RXE                 *((volatile unsigned int*)(0x42700024UL))
#define bFM0P_MFS0_LIN_SCR_TBIE                *((volatile unsigned int*)(0x42700028UL))
#define bFM0P_MFS0_LIN_SCR_TIE                 *((volatile unsigned int*)(0x4270002CUL))
#define bFM0P_MFS0_LIN_SCR_RIE                 *((volatile unsigned int*)(0x42700030UL))
#define bFM0P_MFS0_LIN_SCR_LBR                 *((volatile unsigned int*)(0x42700034UL))
#define bFM0P_MFS0_LIN_SCR_MS                  *((volatile unsigned int*)(0x42700038UL))
#define bFM0P_MFS0_LIN_SCR_UPCL                *((volatile unsigned int*)(0x4270003CUL))
#define bFM0P_MFS0_LIN_ESCR_DEL0               *((volatile unsigned int*)(0x42700080UL))
#define bFM0P_MFS0_LIN_ESCR_DEL1               *((volatile unsigned int*)(0x42700084UL))
#define bFM0P_MFS0_LIN_ESCR_LBL0               *((volatile unsigned int*)(0x42700088UL))
#define bFM0P_MFS0_LIN_ESCR_LBL1               *((volatile unsigned int*)(0x4270008CUL))
#define bFM0P_MFS0_LIN_ESCR_LBIE               *((volatile unsigned int*)(0x42700090UL))
#define bFM0P_MFS0_LIN_ESCR_ESBL               *((volatile unsigned int*)(0x42700098UL))
#define bFM0P_MFS0_LIN_SSR_TBI                 *((volatile unsigned int*)(0x427000A0UL))
#define bFM0P_MFS0_LIN_SSR_TDRE                *((volatile unsigned int*)(0x427000A4UL))
#define bFM0P_MFS0_LIN_SSR_RDRF                *((volatile unsigned int*)(0x427000A8UL))
#define bFM0P_MFS0_LIN_SSR_ORE                 *((volatile unsigned int*)(0x427000ACUL))
#define bFM0P_MFS0_LIN_SSR_FRE                 *((volatile unsigned int*)(0x427000B0UL))
#define bFM0P_MFS0_LIN_SSR_LBD                 *((volatile unsigned int*)(0x427000B4UL))
#define bFM0P_MFS0_LIN_SSR_REC                 *((volatile unsigned int*)(0x427000BCUL))
#define bFM0P_MFS0_LIN_BGR_BGR00               *((volatile unsigned int*)(0x42700180UL))
#define bFM0P_MFS0_LIN_BGR_BGR01               *((volatile unsigned int*)(0x42700184UL))
#define bFM0P_MFS0_LIN_BGR_BGR02               *((volatile unsigned int*)(0x42700188UL))
#define bFM0P_MFS0_LIN_BGR_BGR03               *((volatile unsigned int*)(0x4270018CUL))
#define bFM0P_MFS0_LIN_BGR_BGR04               *((volatile unsigned int*)(0x42700190UL))
#define bFM0P_MFS0_LIN_BGR_BGR05               *((volatile unsigned int*)(0x42700194UL))
#define bFM0P_MFS0_LIN_BGR_BGR06               *((volatile unsigned int*)(0x42700198UL))
#define bFM0P_MFS0_LIN_BGR_BGR07               *((volatile unsigned int*)(0x4270019CUL))
#define bFM0P_MFS0_LIN_BGR_BGR10               *((volatile unsigned int*)(0x427001A0UL))
#define bFM0P_MFS0_LIN_BGR_BGR11               *((volatile unsigned int*)(0x427001A4UL))
#define bFM0P_MFS0_LIN_BGR_BGR12               *((volatile unsigned int*)(0x427001A8UL))
#define bFM0P_MFS0_LIN_BGR_BGR13               *((volatile unsigned int*)(0x427001ACUL))
#define bFM0P_MFS0_LIN_BGR_BGR14               *((volatile unsigned int*)(0x427001B0UL))
#define bFM0P_MFS0_LIN_BGR_BGR15               *((volatile unsigned int*)(0x427001B4UL))
#define bFM0P_MFS0_LIN_BGR_BGR16               *((volatile unsigned int*)(0x427001B8UL))
#define bFM0P_MFS0_LIN_BGR_EXT                 *((volatile unsigned int*)(0x427001BCUL))
#define bFM0P_MFS0_LIN_FCR0_FE1                *((volatile unsigned int*)(0x42700280UL))
#define bFM0P_MFS0_LIN_FCR0_FE2                *((volatile unsigned int*)(0x42700284UL))
#define bFM0P_MFS0_LIN_FCR0_FCL1               *((volatile unsigned int*)(0x42700288UL))
#define bFM0P_MFS0_LIN_FCR0_FCL2               *((volatile unsigned int*)(0x4270028CUL))
#define bFM0P_MFS0_LIN_FCR0_FSET               *((volatile unsigned int*)(0x42700290UL))
#define bFM0P_MFS0_LIN_FCR0_FLD                *((volatile unsigned int*)(0x42700294UL))
#define bFM0P_MFS0_LIN_FCR0_FLST               *((volatile unsigned int*)(0x42700298UL))
#define bFM0P_MFS0_LIN_FCR1_FSEL               *((volatile unsigned int*)(0x427002A0UL))
#define bFM0P_MFS0_LIN_FCR1_FTIE               *((volatile unsigned int*)(0x427002A4UL))
#define bFM0P_MFS0_LIN_FCR1_FDRQ               *((volatile unsigned int*)(0x427002A8UL))
#define bFM0P_MFS0_LIN_FCR1_FRIIE              *((volatile unsigned int*)(0x427002ACUL))
#define bFM0P_MFS0_LIN_FCR1_FLSTE              *((volatile unsigned int*)(0x427002B0UL))

/* MFS I2C channel 0 registers */
#define bFM0P_MFS0_I2C_SMR_TIE                 *((volatile unsigned int*)(0x42700008UL))
#define bFM0P_MFS0_I2C_SMR_RIE                 *((volatile unsigned int*)(0x4270000CUL))
#define bFM0P_MFS0_I2C_SMR_MD0                 *((volatile unsigned int*)(0x42700014UL))
#define bFM0P_MFS0_I2C_SMR_MD1                 *((volatile unsigned int*)(0x42700018UL))
#define bFM0P_MFS0_I2C_SMR_MD2                 *((volatile unsigned int*)(0x4270001CUL))
#define bFM0P_MFS0_I2C_IBCR_INT                *((volatile unsigned int*)(0x42700020UL))
#define bFM0P_MFS0_I2C_IBCR_BER                *((volatile unsigned int*)(0x42700024UL))
#define bFM0P_MFS0_I2C_IBCR_INTE               *((volatile unsigned int*)(0x42700028UL))
#define bFM0P_MFS0_I2C_IBCR_CNDE               *((volatile unsigned int*)(0x4270002CUL))
#define bFM0P_MFS0_I2C_IBCR_WSEL               *((volatile unsigned int*)(0x42700030UL))
#define bFM0P_MFS0_I2C_IBCR_ACKE               *((volatile unsigned int*)(0x42700034UL))
#define bFM0P_MFS0_I2C_IBCR_ACT_SCC            *((volatile unsigned int*)(0x42700038UL))
#define bFM0P_MFS0_I2C_IBCR_MSS                *((volatile unsigned int*)(0x4270003CUL))
#define bFM0P_MFS0_I2C_IBSR_BB                 *((volatile unsigned int*)(0x42700080UL))
#define bFM0P_MFS0_I2C_IBSR_SPC                *((volatile unsigned int*)(0x42700084UL))
#define bFM0P_MFS0_I2C_IBSR_RSC                *((volatile unsigned int*)(0x42700088UL))
#define bFM0P_MFS0_I2C_IBSR_AL                 *((volatile unsigned int*)(0x4270008CUL))
#define bFM0P_MFS0_I2C_IBSR_TRX                *((volatile unsigned int*)(0x42700090UL))
#define bFM0P_MFS0_I2C_IBSR_RSA                *((volatile unsigned int*)(0x42700094UL))
#define bFM0P_MFS0_I2C_IBSR_RACK               *((volatile unsigned int*)(0x42700098UL))
#define bFM0P_MFS0_I2C_IBSR_FBT                *((volatile unsigned int*)(0x4270009CUL))
#define bFM0P_MFS0_I2C_SSR_TBI                 *((volatile unsigned int*)(0x427000A0UL))
#define bFM0P_MFS0_I2C_SSR_TDRE                *((volatile unsigned int*)(0x427000A4UL))
#define bFM0P_MFS0_I2C_SSR_RDRF                *((volatile unsigned int*)(0x427000A8UL))
#define bFM0P_MFS0_I2C_SSR_ORE                 *((volatile unsigned int*)(0x427000ACUL))
#define bFM0P_MFS0_I2C_SSR_TBIE                *((volatile unsigned int*)(0x427000B0UL))
#define bFM0P_MFS0_I2C_SSR_DMA                 *((volatile unsigned int*)(0x427000B4UL))
#define bFM0P_MFS0_I2C_SSR_TSET                *((volatile unsigned int*)(0x427000B8UL))
#define bFM0P_MFS0_I2C_SSR_REC                 *((volatile unsigned int*)(0x427000BCUL))
#define bFM0P_MFS0_I2C_BGR_BGR00               *((volatile unsigned int*)(0x42700180UL))
#define bFM0P_MFS0_I2C_BGR_BGR01               *((volatile unsigned int*)(0x42700184UL))
#define bFM0P_MFS0_I2C_BGR_BGR02               *((volatile unsigned int*)(0x42700188UL))
#define bFM0P_MFS0_I2C_BGR_BGR03               *((volatile unsigned int*)(0x4270018CUL))
#define bFM0P_MFS0_I2C_BGR_BGR04               *((volatile unsigned int*)(0x42700190UL))
#define bFM0P_MFS0_I2C_BGR_BGR05               *((volatile unsigned int*)(0x42700194UL))
#define bFM0P_MFS0_I2C_BGR_BGR06               *((volatile unsigned int*)(0x42700198UL))
#define bFM0P_MFS0_I2C_BGR_BGR07               *((volatile unsigned int*)(0x4270019CUL))
#define bFM0P_MFS0_I2C_BGR_BGR10               *((volatile unsigned int*)(0x427001A0UL))
#define bFM0P_MFS0_I2C_BGR_BGR11               *((volatile unsigned int*)(0x427001A4UL))
#define bFM0P_MFS0_I2C_BGR_BGR12               *((volatile unsigned int*)(0x427001A8UL))
#define bFM0P_MFS0_I2C_BGR_BGR13               *((volatile unsigned int*)(0x427001ACUL))
#define bFM0P_MFS0_I2C_BGR_BGR14               *((volatile unsigned int*)(0x427001B0UL))
#define bFM0P_MFS0_I2C_BGR_BGR15               *((volatile unsigned int*)(0x427001B4UL))
#define bFM0P_MFS0_I2C_BGR_BGR16               *((volatile unsigned int*)(0x427001B8UL))
#define bFM0P_MFS0_I2C_ISBA_SA0                *((volatile unsigned int*)(0x42700200UL))
#define bFM0P_MFS0_I2C_ISBA_SA1                *((volatile unsigned int*)(0x42700204UL))
#define bFM0P_MFS0_I2C_ISBA_SA2                *((volatile unsigned int*)(0x42700208UL))
#define bFM0P_MFS0_I2C_ISBA_SA3                *((volatile unsigned int*)(0x4270020CUL))
#define bFM0P_MFS0_I2C_ISBA_SA4                *((volatile unsigned int*)(0x42700210UL))
#define bFM0P_MFS0_I2C_ISBA_SA5                *((volatile unsigned int*)(0x42700214UL))
#define bFM0P_MFS0_I2C_ISBA_SA6                *((volatile unsigned int*)(0x42700218UL))
#define bFM0P_MFS0_I2C_ISBA_SAEN               *((volatile unsigned int*)(0x4270021CUL))
#define bFM0P_MFS0_I2C_ISMK_SM0                *((volatile unsigned int*)(0x42700220UL))
#define bFM0P_MFS0_I2C_ISMK_SM1                *((volatile unsigned int*)(0x42700224UL))
#define bFM0P_MFS0_I2C_ISMK_SM2                *((volatile unsigned int*)(0x42700228UL))
#define bFM0P_MFS0_I2C_ISMK_SM3                *((volatile unsigned int*)(0x4270022CUL))
#define bFM0P_MFS0_I2C_ISMK_SM4                *((volatile unsigned int*)(0x42700230UL))
#define bFM0P_MFS0_I2C_ISMK_SM5                *((volatile unsigned int*)(0x42700234UL))
#define bFM0P_MFS0_I2C_ISMK_SM6                *((volatile unsigned int*)(0x42700238UL))
#define bFM0P_MFS0_I2C_ISMK_EN                 *((volatile unsigned int*)(0x4270023CUL))
#define bFM0P_MFS0_I2C_FCR0_FE1                *((volatile unsigned int*)(0x42700280UL))
#define bFM0P_MFS0_I2C_FCR0_FE2                *((volatile unsigned int*)(0x42700284UL))
#define bFM0P_MFS0_I2C_FCR0_FCL1               *((volatile unsigned int*)(0x42700288UL))
#define bFM0P_MFS0_I2C_FCR0_FCL2               *((volatile unsigned int*)(0x4270028CUL))
#define bFM0P_MFS0_I2C_FCR0_FSET               *((volatile unsigned int*)(0x42700290UL))
#define bFM0P_MFS0_I2C_FCR0_FLD                *((volatile unsigned int*)(0x42700294UL))
#define bFM0P_MFS0_I2C_FCR0_FLST               *((volatile unsigned int*)(0x42700298UL))
#define bFM0P_MFS0_I2C_FCR1_FSEL               *((volatile unsigned int*)(0x427002A0UL))
#define bFM0P_MFS0_I2C_FCR1_FTIE               *((volatile unsigned int*)(0x427002A4UL))
#define bFM0P_MFS0_I2C_FCR1_FDRQ               *((volatile unsigned int*)(0x427002A8UL))
#define bFM0P_MFS0_I2C_FCR1_FRIIE              *((volatile unsigned int*)(0x427002ACUL))
#define bFM0P_MFS0_I2C_FCR1_FLSTE              *((volatile unsigned int*)(0x427002B0UL))
#define bFM0P_MFS0_I2C_EIBCR_BEC               *((volatile unsigned int*)(0x427003A0UL))
#define bFM0P_MFS0_I2C_EIBCR_SOCE              *((volatile unsigned int*)(0x427003A4UL))
#define bFM0P_MFS0_I2C_EIBCR_SCLC              *((volatile unsigned int*)(0x427003A8UL))
#define bFM0P_MFS0_I2C_EIBCR_SDAC              *((volatile unsigned int*)(0x427003ACUL))
#define bFM0P_MFS0_I2C_EIBCR_SCLS              *((volatile unsigned int*)(0x427003B0UL))
#define bFM0P_MFS0_I2C_EIBCR_SDAS              *((volatile unsigned int*)(0x427003B4UL))

