furjie/Single-BLDC-driver-and-app/s6e1a1.h
/* MFS UART channel 1 registers */
#define bFM0P_MFS1_UART_SMR_SOE                *((volatile unsigned int*)(0x42702000UL))
#define bFM0P_MFS1_UART_SMR_BDS                *((volatile unsigned int*)(0x42702008UL))
#define bFM0P_MFS1_UART_SMR_SBL                *((volatile unsigned int*)(0x4270200CUL))
#define bFM0P_MFS1_UART_SMR_MD0                *((volatile unsigned int*)(0x42702014UL))
#define bFM0P_MFS1_UART_SMR_MD1                *((volatile unsigned int*)(0x42702018UL))
#define bFM0P_MFS1_UART_SMR_MD2                *((volatile unsigned int*)(0x4270201CUL))
#define bFM0P_MFS1_UART_SCR_TXE                *((volatile unsigned int*)(0x42702020UL))
#define bFM0P_MFS1_UART_SCR_RXE                *((volatile unsigned int*)(0x42702024UL))
#define bFM0P_MFS1_UART_SCR_TBIE               *((volatile unsigned int*)(0x42702028UL))
#define bFM0P_MFS1_UART_SCR_TIE                *((volatile unsigned int*)(0x4270202CUL))
#define bFM0P_MFS1_UART_SCR_RIE                *((volatile unsigned int*)(0x42702030UL))
#define bFM0P_MFS1_UART_SCR_UPCL               *((volatile unsigned int*)(0x4270203CUL))
#define bFM0P_MFS1_UART_ESCR_L0                *((volatile unsigned int*)(0x42702080UL))
#define bFM0P_MFS1_UART_ESCR_L1                *((volatile unsigned int*)(0x42702084UL))
#define bFM0P_MFS1_UART_ESCR_L2                *((volatile unsigned int*)(0x42702088UL))
#define bFM0P_MFS1_UART_ESCR_P                 *((volatile unsigned int*)(0x4270208CUL))
#define bFM0P_MFS1_UART_ESCR_PEN               *((volatile unsigned int*)(0x42702090UL))
#define bFM0P_MFS1_UART_ESCR_INV               *((volatile unsigned int*)(0x42702094UL))
#define bFM0P_MFS1_UART_ESCR_ESBL              *((volatile unsigned int*)(0x42702098UL))
#define bFM0P_MFS1_UART_ESCR_FLWEN             *((volatile unsigned int*)(0x4270209CUL))
#define bFM0P_MFS1_UART_SSR_TBI                *((volatile unsigned int*)(0x427020A0UL))
#define bFM0P_MFS1_UART_SSR_TDRE               *((volatile unsigned int*)(0x427020A4UL))
#define bFM0P_MFS1_UART_SSR_RDRF               *((volatile unsigned int*)(0x427020A8UL))
#define bFM0P_MFS1_UART_SSR_ORE                *((volatile unsigned int*)(0x427020ACUL))
#define bFM0P_MFS1_UART_SSR_FRE                *((volatile unsigned int*)(0x427020B0UL))
#define bFM0P_MFS1_UART_SSR_PE                 *((volatile unsigned int*)(0x427020B4UL))
#define bFM0P_MFS1_UART_SSR_REC                *((volatile unsigned int*)(0x427020BCUL))
#define bFM0P_MFS1_UART_BGR_BGR00              *((volatile unsigned int*)(0x42702180UL))
#define bFM0P_MFS1_UART_BGR_BGR01              *((volatile unsigned int*)(0x42702184UL))
#define bFM0P_MFS1_UART_BGR_BGR02              *((volatile unsigned int*)(0x42702188UL))
#define bFM0P_MFS1_UART_BGR_BGR03              *((volatile unsigned int*)(0x4270218CUL))
#define bFM0P_MFS1_UART_BGR_BGR04              *((volatile unsigned int*)(0x42702190UL))
#define bFM0P_MFS1_UART_BGR_BGR05              *((volatile unsigned int*)(0x42702194UL))
#define bFM0P_MFS1_UART_BGR_BGR06              *((volatile unsigned int*)(0x42702198UL))
#define bFM0P_MFS1_UART_BGR_BGR07              *((volatile unsigned int*)(0x4270219CUL))
#define bFM0P_MFS1_UART_BGR_BGR10              *((volatile unsigned int*)(0x427021A0UL))
#define bFM0P_MFS1_UART_BGR_BGR11              *((volatile unsigned int*)(0x427021A4UL))
#define bFM0P_MFS1_UART_BGR_BGR12              *((volatile unsigned int*)(0x427021A8UL))
#define bFM0P_MFS1_UART_BGR_BGR13              *((volatile unsigned int*)(0x427021ACUL))
#define bFM0P_MFS1_UART_BGR_BGR14              *((volatile unsigned int*)(0x427021B0UL))
#define bFM0P_MFS1_UART_BGR_BGR15              *((volatile unsigned int*)(0x427021B4UL))
#define bFM0P_MFS1_UART_BGR_BGR16              *((volatile unsigned int*)(0x427021B8UL))
#define bFM0P_MFS1_UART_BGR_EXT                *((volatile unsigned int*)(0x427021BCUL))
#define bFM0P_MFS1_UART_FCR0_FE1               *((volatile unsigned int*)(0x42702280UL))
#define bFM0P_MFS1_UART_FCR0_FE2               *((volatile unsigned int*)(0x42702284UL))
#define bFM0P_MFS1_UART_FCR0_FCL1              *((volatile unsigned int*)(0x42702288UL))
#define bFM0P_MFS1_UART_FCR0_FCL2              *((volatile unsigned int*)(0x4270228CUL))
#define bFM0P_MFS1_UART_FCR0_FSET              *((volatile unsigned int*)(0x42702290UL))
#define bFM0P_MFS1_UART_FCR0_FLD               *((volatile unsigned int*)(0x42702294UL))
#define bFM0P_MFS1_UART_FCR0_FLST              *((volatile unsigned int*)(0x42702298UL))
#define bFM0P_MFS1_UART_FCR0_FE1               *((volatile unsigned int*)(0x42702280UL))
#define bFM0P_MFS1_UART_FCR0_FE2               *((volatile unsigned int*)(0x42702284UL))
#define bFM0P_MFS1_UART_FCR0_FCL1              *((volatile unsigned int*)(0x42702288UL))
#define bFM0P_MFS1_UART_FCR0_FCL2              *((volatile unsigned int*)(0x4270228CUL))
#define bFM0P_MFS1_UART_FCR0_FSET              *((volatile unsigned int*)(0x42702290UL))
#define bFM0P_MFS1_UART_FCR0_FLD               *((volatile unsigned int*)(0x42702294UL))
#define bFM0P_MFS1_UART_FCR0_FLST              *((volatile unsigned int*)(0x42702298UL))
#define bFM0P_MFS1_UART_FCR1_FSEL              *((volatile unsigned int*)(0x427022A0UL))
#define bFM0P_MFS1_UART_FCR1_FTIE              *((volatile unsigned int*)(0x427022A4UL))
#define bFM0P_MFS1_UART_FCR1_FDRQ              *((volatile unsigned int*)(0x427022A8UL))
#define bFM0P_MFS1_UART_FCR1_FRIIE             *((volatile unsigned int*)(0x427022ACUL))
#define bFM0P_MFS1_UART_FCR1_FLSTE             *((volatile unsigned int*)(0x427022B0UL))

/* MFS CSIO channel 1 registers */
#define bFM0P_MFS1_CSIO_SMR_SOE                *((volatile unsigned int*)(0x42702000UL))
#define bFM0P_MFS1_CSIO_SMR_SCKE               *((volatile unsigned int*)(0x42702004UL))
#define bFM0P_MFS1_CSIO_SMR_BDS                *((volatile unsigned int*)(0x42702008UL))
#define bFM0P_MFS1_CSIO_SMR_SCINV              *((volatile unsigned int*)(0x4270200CUL))
#define bFM0P_MFS1_CSIO_SMR_MD0                *((volatile unsigned int*)(0x42702014UL))
#define bFM0P_MFS1_CSIO_SMR_MD1                *((volatile unsigned int*)(0x42702018UL))
#define bFM0P_MFS1_CSIO_SMR_MD2                *((volatile unsigned int*)(0x4270201CUL))
#define bFM0P_MFS1_CSIO_SCR_TXE                *((volatile unsigned int*)(0x42702020UL))
#define bFM0P_MFS1_CSIO_SCR_RXE                *((volatile unsigned int*)(0x42702024UL))
#define bFM0P_MFS1_CSIO_SCR_TBIE               *((volatile unsigned int*)(0x42702028UL))
#define bFM0P_MFS1_CSIO_SCR_TIE                *((volatile unsigned int*)(0x4270202CUL))
#define bFM0P_MFS1_CSIO_SCR_RIE                *((volatile unsigned int*)(0x42702030UL))
#define bFM0P_MFS1_CSIO_SCR_SPI                *((volatile unsigned int*)(0x42702034UL))
#define bFM0P_MFS1_CSIO_SCR_MS                 *((volatile unsigned int*)(0x42702038UL))
#define bFM0P_MFS1_CSIO_SCR_UPCL               *((volatile unsigned int*)(0x4270203CUL))
#define bFM0P_MFS1_CSIO_ESCR_L0                *((volatile unsigned int*)(0x42702080UL))
#define bFM0P_MFS1_CSIO_ESCR_L1                *((volatile unsigned int*)(0x42702084UL))
#define bFM0P_MFS1_CSIO_ESCR_L2                *((volatile unsigned int*)(0x42702088UL))
#define bFM0P_MFS1_CSIO_ESCR_WT0               *((volatile unsigned int*)(0x4270208CUL))
#define bFM0P_MFS1_CSIO_ESCR_WT1               *((volatile unsigned int*)(0x42702090UL))
#define bFM0P_MFS1_CSIO_ESCR_CSFE              *((volatile unsigned int*)(0x42702094UL))
#define bFM0P_MFS1_CSIO_ESCR_L3                *((volatile unsigned int*)(0x42702098UL))
#define bFM0P_MFS1_CSIO_ESCR_SOP               *((volatile unsigned int*)(0x4270209CUL))
#define bFM0P_MFS1_CSIO_SSR_TBI                *((volatile unsigned int*)(0x427020A0UL))
#define bFM0P_MFS1_CSIO_SSR_TDRE               *((volatile unsigned int*)(0x427020A4UL))
#define bFM0P_MFS1_CSIO_SSR_RDRF               *((volatile unsigned int*)(0x427020A8UL))
#define bFM0P_MFS1_CSIO_SSR_ORE                *((volatile unsigned int*)(0x427020ACUL))
#define bFM0P_MFS1_CSIO_SSR_REC                *((volatile unsigned int*)(0x427020BCUL))
#define bFM0P_MFS1_CSIO_BGR_BGR00              *((volatile unsigned int*)(0x42702180UL))
#define bFM0P_MFS1_CSIO_BGR_BGR01              *((volatile unsigned int*)(0x42702184UL))
#define bFM0P_MFS1_CSIO_BGR_BGR02              *((volatile unsigned int*)(0x42702188UL))
#define bFM0P_MFS1_CSIO_BGR_BGR03              *((volatile unsigned int*)(0x4270218CUL))
#define bFM0P_MFS1_CSIO_BGR_BGR04              *((volatile unsigned int*)(0x42702190UL))
#define bFM0P_MFS1_CSIO_BGR_BGR05              *((volatile unsigned int*)(0x42702194UL))
#define bFM0P_MFS1_CSIO_BGR_BGR06              *((volatile unsigned int*)(0x42702198UL))
#define bFM0P_MFS1_CSIO_BGR_BGR07              *((volatile unsigned int*)(0x4270219CUL))
#define bFM0P_MFS1_CSIO_BGR_BGR10              *((volatile unsigned int*)(0x427021A0UL))
#define bFM0P_MFS1_CSIO_BGR_BGR11              *((volatile unsigned int*)(0x427021A4UL))
#define bFM0P_MFS1_CSIO_BGR_BGR12              *((volatile unsigned int*)(0x427021A8UL))
#define bFM0P_MFS1_CSIO_BGR_BGR13              *((volatile unsigned int*)(0x427021ACUL))
#define bFM0P_MFS1_CSIO_BGR_BGR14              *((volatile unsigned int*)(0x427021B0UL))
#define bFM0P_MFS1_CSIO_BGR_BGR15              *((volatile unsigned int*)(0x427021B4UL))
#define bFM0P_MFS1_CSIO_BGR_BGR16              *((volatile unsigned int*)(0x427021B8UL))
#define bFM0P_MFS1_CSIO_FCR0_FE1               *((volatile unsigned int*)(0x42702280UL))
#define bFM0P_MFS1_CSIO_FCR0_FE2               *((volatile unsigned int*)(0x42702284UL))
#define bFM0P_MFS1_CSIO_FCR0_FCL1              *((volatile unsigned int*)(0x42702288UL))
#define bFM0P_MFS1_CSIO_FCR0_FCL2              *((volatile unsigned int*)(0x4270228CUL))
#define bFM0P_MFS1_CSIO_FCR0_FSET              *((volatile unsigned int*)(0x42702290UL))
#define bFM0P_MFS1_CSIO_FCR0_FLD               *((volatile unsigned int*)(0x42702294UL))
#define bFM0P_MFS1_CSIO_FCR0_FLST              *((volatile unsigned int*)(0x42702298UL))
#define bFM0P_MFS1_CSIO_FCR1_FSEL              *((volatile unsigned int*)(0x427022A0UL))
#define bFM0P_MFS1_CSIO_FCR1_FTIE              *((volatile unsigned int*)(0x427022A4UL))
#define bFM0P_MFS1_CSIO_FCR1_FDRQ              *((volatile unsigned int*)(0x427022A8UL))
#define bFM0P_MFS1_CSIO_FCR1_FRIIE             *((volatile unsigned int*)(0x427022ACUL))
#define bFM0P_MFS1_CSIO_FCR1_FLSTE             *((volatile unsigned int*)(0x427022B0UL))
#define bFM0P_MFS1_CSIO_SCSTR0_CSHD0           *((volatile unsigned int*)(0x42702380UL))
#define bFM0P_MFS1_CSIO_SCSTR0_CSHD1           *((volatile unsigned int*)(0x42702384UL))
#define bFM0P_MFS1_CSIO_SCSTR0_CSHD2           *((volatile unsigned int*)(0x42702388UL))
#define bFM0P_MFS1_CSIO_SCSTR0_CSHD3           *((volatile unsigned int*)(0x4270238CUL))
#define bFM0P_MFS1_CSIO_SCSTR0_CSHD4           *((volatile unsigned int*)(0x42702390UL))
#define bFM0P_MFS1_CSIO_SCSTR0_CSHD5           *((volatile unsigned int*)(0x42702394UL))
#define bFM0P_MFS1_CSIO_SCSTR0_CSHD6           *((volatile unsigned int*)(0x42702398UL))
#define bFM0P_MFS1_CSIO_SCSTR0_CSHD7           *((volatile unsigned int*)(0x4270239CUL))
#define bFM0P_MFS1_CSIO_SCSTR1_CSSU0           *((volatile unsigned int*)(0x427023A0UL))
#define bFM0P_MFS1_CSIO_SCSTR1_CSSU1           *((volatile unsigned int*)(0x427023A4UL))
#define bFM0P_MFS1_CSIO_SCSTR1_CSSU2           *((volatile unsigned int*)(0x427023A8UL))
#define bFM0P_MFS1_CSIO_SCSTR1_CSSU3           *((volatile unsigned int*)(0x427023ACUL))
#define bFM0P_MFS1_CSIO_SCSTR1_CSSU4           *((volatile unsigned int*)(0x427023B0UL))
#define bFM0P_MFS1_CSIO_SCSTR1_CSSU5           *((volatile unsigned int*)(0x427023B4UL))
#define bFM0P_MFS1_CSIO_SCSTR1_CSSU6           *((volatile unsigned int*)(0x427023B8UL))
#define bFM0P_MFS1_CSIO_SCSTR1_CSSU7           *((volatile unsigned int*)(0x427023BCUL))
#define bFM0P_MFS1_CSIO_SCSTR32_CSDS0          *((volatile unsigned int*)(0x42702400UL))
#define bFM0P_MFS1_CSIO_SCSTR32_CSDS1          *((volatile unsigned int*)(0x42702404UL))
#define bFM0P_MFS1_CSIO_SCSTR32_CSDS2          *((volatile unsigned int*)(0x42702408UL))
#define bFM0P_MFS1_CSIO_SCSTR32_CSDS3          *((volatile unsigned int*)(0x4270240CUL))
#define bFM0P_MFS1_CSIO_SCSTR32_CSDS4          *((volatile unsigned int*)(0x42702410UL))
#define bFM0P_MFS1_CSIO_SCSTR32_CSDS5          *((volatile unsigned int*)(0x42702414UL))
#define bFM0P_MFS1_CSIO_SCSTR32_CSDS6          *((volatile unsigned int*)(0x42702418UL))
#define bFM0P_MFS1_CSIO_SCSTR32_CSDS7          *((volatile unsigned int*)(0x4270241CUL))
#define bFM0P_MFS1_CSIO_SCSTR32_CSDS8          *((volatile unsigned int*)(0x42702420UL))
#define bFM0P_MFS1_CSIO_SCSTR32_CSDS9          *((volatile unsigned int*)(0x42702424UL))
#define bFM0P_MFS1_CSIO_SCSTR32_CSDS10         *((volatile unsigned int*)(0x42702428UL))
#define bFM0P_MFS1_CSIO_SCSTR32_CSDS11         *((volatile unsigned int*)(0x4270242CUL))
#define bFM0P_MFS1_CSIO_SCSTR32_CSDS12         *((volatile unsigned int*)(0x42702430UL))
#define bFM0P_MFS1_CSIO_SCSTR32_CSDS13         *((volatile unsigned int*)(0x42702434UL))
#define bFM0P_MFS1_CSIO_SCSTR32_CSDS14         *((volatile unsigned int*)(0x42702438UL))
#define bFM0P_MFS1_CSIO_SCSTR32_CSDS15         *((volatile unsigned int*)(0x4270243CUL))
#define bFM0P_MFS1_CSIO_SACSR_TMRE             *((volatile unsigned int*)(0x42702480UL))
#define bFM0P_MFS1_CSIO_SACSR_TDIV0            *((volatile unsigned int*)(0x42702484UL))
#define bFM0P_MFS1_CSIO_SACSR_TDIV1            *((volatile unsigned int*)(0x42702488UL))
#define bFM0P_MFS1_CSIO_SACSR_TDIV2            *((volatile unsigned int*)(0x4270248CUL))
#define bFM0P_MFS1_CSIO_SACSR_TDIV3            *((volatile unsigned int*)(0x42702490UL))
#define bFM0P_MFS1_CSIO_SACSR_TSYNE            *((volatile unsigned int*)(0x42702498UL))
#define bFM0P_MFS1_CSIO_SACSR_TINTE            *((volatile unsigned int*)(0x4270249CUL))
#define bFM0P_MFS1_CSIO_SACSR_TINT             *((volatile unsigned int*)(0x427024A0UL))
#define bFM0P_MFS1_CSIO_SACSR_CSE              *((volatile unsigned int*)(0x427024ACUL))
#define bFM0P_MFS1_CSIO_SACSR_CSEIE            *((volatile unsigned int*)(0x427024B0UL))
#define bFM0P_MFS1_CSIO_SACSR_TBEEN            *((volatile unsigned int*)(0x427024B4UL))
#define bFM0P_MFS1_CSIO_STMR_TM0               *((volatile unsigned int*)(0x42702500UL))
#define bFM0P_MFS1_CSIO_STMR_TM1               *((volatile unsigned int*)(0x42702504UL))
#define bFM0P_MFS1_CSIO_STMR_TM2               *((volatile unsigned int*)(0x42702508UL))
#define bFM0P_MFS1_CSIO_STMR_TM3               *((volatile unsigned int*)(0x4270250CUL))
#define bFM0P_MFS1_CSIO_STMR_TM4               *((volatile unsigned int*)(0x42702510UL))
#define bFM0P_MFS1_CSIO_STMR_TM5               *((volatile unsigned int*)(0x42702514UL))
#define bFM0P_MFS1_CSIO_STMR_TM6               *((volatile unsigned int*)(0x42702518UL))
#define bFM0P_MFS1_CSIO_STMR_TM7               *((volatile unsigned int*)(0x4270251CUL))
#define bFM0P_MFS1_CSIO_STMR_TM8               *((volatile unsigned int*)(0x42702520UL))
#define bFM0P_MFS1_CSIO_STMR_TM9               *((volatile unsigned int*)(0x42702524UL))
#define bFM0P_MFS1_CSIO_STMR_TM10              *((volatile unsigned int*)(0x42702528UL))
#define bFM0P_MFS1_CSIO_STMR_TM11              *((volatile unsigned int*)(0x4270252CUL))
#define bFM0P_MFS1_CSIO_STMR_TM12              *((volatile unsigned int*)(0x42702530UL))
#define bFM0P_MFS1_CSIO_STMR_TM13              *((volatile unsigned int*)(0x42702534UL))
#define bFM0P_MFS1_CSIO_STMR_TM14              *((volatile unsigned int*)(0x42702538UL))
#define bFM0P_MFS1_CSIO_STMR_TM15              *((volatile unsigned int*)(0x4270253CUL))
#define bFM0P_MFS1_CSIO_TMCR_TC0               *((volatile unsigned int*)(0x42702580UL))
#define bFM0P_MFS1_CSIO_TMCR_TC1               *((volatile unsigned int*)(0x42702584UL))
#define bFM0P_MFS1_CSIO_TMCR_TC2               *((volatile unsigned int*)(0x42702588UL))
#define bFM0P_MFS1_CSIO_TMCR_TC3               *((volatile unsigned int*)(0x4270258CUL))
#define bFM0P_MFS1_CSIO_TMCR_TC4               *((volatile unsigned int*)(0x42702590UL))
#define bFM0P_MFS1_CSIO_TMCR_TC5               *((volatile unsigned int*)(0x42702594UL))
#define bFM0P_MFS1_CSIO_TMCR_TC6               *((volatile unsigned int*)(0x42702598UL))
#define bFM0P_MFS1_CSIO_TMCR_TC7               *((volatile unsigned int*)(0x4270259CUL))
#define bFM0P_MFS1_CSIO_TMCR_TC8               *((volatile unsigned int*)(0x427025A0UL))
#define bFM0P_MFS1_CSIO_TMCR_TC9               *((volatile unsigned int*)(0x427025A4UL))
#define bFM0P_MFS1_CSIO_TMCR_TC10              *((volatile unsigned int*)(0x427025A8UL))
#define bFM0P_MFS1_CSIO_TMCR_TC11              *((volatile unsigned int*)(0x427025ACUL))
#define bFM0P_MFS1_CSIO_TMCR_TC12              *((volatile unsigned int*)(0x427025B0UL))
#define bFM0P_MFS1_CSIO_TMCR_TC13              *((volatile unsigned int*)(0x427025B4UL))
#define bFM0P_MFS1_CSIO_TMCR_TC14              *((volatile unsigned int*)(0x427025B8UL))
#define bFM0P_MFS1_CSIO_TMCR_TC15              *((volatile unsigned int*)(0x427025BCUL))
#define bFM0P_MFS1_CSIO_SCSCR_CSOE             *((volatile unsigned int*)(0x42702600UL))
#define bFM0P_MFS1_CSIO_SCSCR_CSEN0            *((volatile unsigned int*)(0x42702604UL))
#define bFM0P_MFS1_CSIO_SCSCR_CSEN1            *((volatile unsigned int*)(0x42702608UL))
#define bFM0P_MFS1_CSIO_SCSCR_CSEN2            *((volatile unsigned int*)(0x4270260CUL))
#define bFM0P_MFS1_CSIO_SCSCR_CSEN3            *((volatile unsigned int*)(0x42702610UL))
#define bFM0P_MFS1_CSIO_SCSCR_CSLVL            *((volatile unsigned int*)(0x42702614UL))
#define bFM0P_MFS1_CSIO_SCSCR_CDIV0            *((volatile unsigned int*)(0x42702618UL))
#define bFM0P_MFS1_CSIO_SCSCR_CDIV1            *((volatile unsigned int*)(0x4270261CUL))
#define bFM0P_MFS1_CSIO_SCSCR_CDIV2            *((volatile unsigned int*)(0x42702620UL))
#define bFM0P_MFS1_CSIO_SCSCR_SCAM             *((volatile unsigned int*)(0x42702624UL))
#define bFM0P_MFS1_CSIO_SCSCR_SCD0             *((volatile unsigned int*)(0x42702628UL))
#define bFM0P_MFS1_CSIO_SCSCR_SCD1             *((volatile unsigned int*)(0x4270262CUL))
#define bFM0P_MFS1_CSIO_SCSCR_SED0             *((volatile unsigned int*)(0x42702630UL))
#define bFM0P_MFS1_CSIO_SCSCR_SED1             *((volatile unsigned int*)(0x42702634UL))
#define bFM0P_MFS1_CSIO_SCSCR_SST0             *((volatile unsigned int*)(0x42702638UL))
#define bFM0P_MFS1_CSIO_SCSCR_SST1             *((volatile unsigned int*)(0x4270263CUL))
#define bFM0P_MFS1_CSIO_SCSFR0_CS1L0           *((volatile unsigned int*)(0x42702680UL))
#define bFM0P_MFS1_CSIO_SCSFR0_CS1L1           *((volatile unsigned int*)(0x42702684UL))
#define bFM0P_MFS1_CSIO_SCSFR0_CS1L2           *((volatile unsigned int*)(0x42702688UL))
#define bFM0P_MFS1_CSIO_SCSFR0_CS1L3           *((volatile unsigned int*)(0x4270268CUL))
#define bFM0P_MFS1_CSIO_SCSFR0_CS1BDS          *((volatile unsigned int*)(0x42702690UL))
#define bFM0P_MFS1_CSIO_SCSFR0_CS1SPI          *((volatile unsigned int*)(0x42702694UL))
#define bFM0P_MFS1_CSIO_SCSFR0_CS1SCINV        *((volatile unsigned int*)(0x42702698UL))
#define bFM0P_MFS1_CSIO_SCSFR0_CS1CSLVL        *((volatile unsigned int*)(0x4270269CUL))
#define bFM0P_MFS1_CSIO_SCSFR1_CS2L0           *((volatile unsigned int*)(0x427026A0UL))
#define bFM0P_MFS1_CSIO_SCSFR1_CS2L1           *((volatile unsigned int*)(0x427026A4UL))
#define bFM0P_MFS1_CSIO_SCSFR1_CS2L2           *((volatile unsigned int*)(0x427026A8UL))
#define bFM0P_MFS1_CSIO_SCSFR1_CS2L3           *((volatile unsigned int*)(0x427026ACUL))
#define bFM0P_MFS1_CSIO_SCSFR1_CS2BDS          *((volatile unsigned int*)(0x427026B0UL))
#define bFM0P_MFS1_CSIO_SCSFR1_CS2SPI          *((volatile unsigned int*)(0x427026B4UL))
#define bFM0P_MFS1_CSIO_SCSFR1_CS2SCINV        *((volatile unsigned int*)(0x427026B8UL))
#define bFM0P_MFS1_CSIO_SCSFR1_CS2CSLVL        *((volatile unsigned int*)(0x427026BCUL))
#define bFM0P_MFS1_CSIO_SCSFR3_CS3L0           *((volatile unsigned int*)(0x42702700UL))
#define bFM0P_MFS1_CSIO_SCSFR3_CS3L1           *((volatile unsigned int*)(0x42702704UL))
#define bFM0P_MFS1_CSIO_SCSFR3_CS3L2           *((volatile unsigned int*)(0x42702708UL))
#define bFM0P_MFS1_CSIO_SCSFR3_CS3L3           *((volatile unsigned int*)(0x4270270CUL))
#define bFM0P_MFS1_CSIO_SCSFR3_CS3BDS          *((volatile unsigned int*)(0x42702710UL))
#define bFM0P_MFS1_CSIO_SCSFR3_CS3SPI          *((volatile unsigned int*)(0x42702714UL))
#define bFM0P_MFS1_CSIO_SCSFR3_CS3SCINV        *((volatile unsigned int*)(0x42702718UL))
#define bFM0P_MFS1_CSIO_SCSFR3_CS3CSLVL        *((volatile unsigned int*)(0x4270271CUL))

