furjie/Single-BLDC-driver-and-app/s6e1a1.h
/* MFS LIN channel 1 registers */
#define bFM0P_MFS1_LIN_SMR_SOE                 *((volatile unsigned int*)(0x42702000UL))
#define bFM0P_MFS1_LIN_SMR_SBL                 *((volatile unsigned int*)(0x4270200CUL))
#define bFM0P_MFS1_LIN_SMR_MD0                 *((volatile unsigned int*)(0x42702014UL))
#define bFM0P_MFS1_LIN_SMR_MD1                 *((volatile unsigned int*)(0x42702018UL))
#define bFM0P_MFS1_LIN_SMR_MD2                 *((volatile unsigned int*)(0x4270201CUL))
#define bFM0P_MFS1_LIN_SCR_TXE                 *((volatile unsigned int*)(0x42702020UL))
#define bFM0P_MFS1_LIN_SCR_RXE                 *((volatile unsigned int*)(0x42702024UL))
#define bFM0P_MFS1_LIN_SCR_TBIE                *((volatile unsigned int*)(0x42702028UL))
#define bFM0P_MFS1_LIN_SCR_TIE                 *((volatile unsigned int*)(0x4270202CUL))
#define bFM0P_MFS1_LIN_SCR_RIE                 *((volatile unsigned int*)(0x42702030UL))
#define bFM0P_MFS1_LIN_SCR_LBR                 *((volatile unsigned int*)(0x42702034UL))
#define bFM0P_MFS1_LIN_SCR_MS                  *((volatile unsigned int*)(0x42702038UL))
#define bFM0P_MFS1_LIN_SCR_UPCL                *((volatile unsigned int*)(0x4270203CUL))
#define bFM0P_MFS1_LIN_ESCR_DEL0               *((volatile unsigned int*)(0x42702080UL))
#define bFM0P_MFS1_LIN_ESCR_DEL1               *((volatile unsigned int*)(0x42702084UL))
#define bFM0P_MFS1_LIN_ESCR_LBL0               *((volatile unsigned int*)(0x42702088UL))
#define bFM0P_MFS1_LIN_ESCR_LBL1               *((volatile unsigned int*)(0x4270208CUL))
#define bFM0P_MFS1_LIN_ESCR_LBIE               *((volatile unsigned int*)(0x42702090UL))
#define bFM0P_MFS1_LIN_ESCR_ESBL               *((volatile unsigned int*)(0x42702098UL))
#define bFM0P_MFS1_LIN_SSR_TBI                 *((volatile unsigned int*)(0x427020A0UL))
#define bFM0P_MFS1_LIN_SSR_TDRE                *((volatile unsigned int*)(0x427020A4UL))
#define bFM0P_MFS1_LIN_SSR_RDRF                *((volatile unsigned int*)(0x427020A8UL))
#define bFM0P_MFS1_LIN_SSR_ORE                 *((volatile unsigned int*)(0x427020ACUL))
#define bFM0P_MFS1_LIN_SSR_FRE                 *((volatile unsigned int*)(0x427020B0UL))
#define bFM0P_MFS1_LIN_SSR_LBD                 *((volatile unsigned int*)(0x427020B4UL))
#define bFM0P_MFS1_LIN_SSR_REC                 *((volatile unsigned int*)(0x427020BCUL))
#define bFM0P_MFS1_LIN_BGR_BGR00               *((volatile unsigned int*)(0x42702180UL))
#define bFM0P_MFS1_LIN_BGR_BGR01               *((volatile unsigned int*)(0x42702184UL))
#define bFM0P_MFS1_LIN_BGR_BGR02               *((volatile unsigned int*)(0x42702188UL))
#define bFM0P_MFS1_LIN_BGR_BGR03               *((volatile unsigned int*)(0x4270218CUL))
#define bFM0P_MFS1_LIN_BGR_BGR04               *((volatile unsigned int*)(0x42702190UL))
#define bFM0P_MFS1_LIN_BGR_BGR05               *((volatile unsigned int*)(0x42702194UL))
#define bFM0P_MFS1_LIN_BGR_BGR06               *((volatile unsigned int*)(0x42702198UL))
#define bFM0P_MFS1_LIN_BGR_BGR07               *((volatile unsigned int*)(0x4270219CUL))
#define bFM0P_MFS1_LIN_BGR_BGR10               *((volatile unsigned int*)(0x427021A0UL))
#define bFM0P_MFS1_LIN_BGR_BGR11               *((volatile unsigned int*)(0x427021A4UL))
#define bFM0P_MFS1_LIN_BGR_BGR12               *((volatile unsigned int*)(0x427021A8UL))
#define bFM0P_MFS1_LIN_BGR_BGR13               *((volatile unsigned int*)(0x427021ACUL))
#define bFM0P_MFS1_LIN_BGR_BGR14               *((volatile unsigned int*)(0x427021B0UL))
#define bFM0P_MFS1_LIN_BGR_BGR15               *((volatile unsigned int*)(0x427021B4UL))
#define bFM0P_MFS1_LIN_BGR_BGR16               *((volatile unsigned int*)(0x427021B8UL))
#define bFM0P_MFS1_LIN_BGR_EXT                 *((volatile unsigned int*)(0x427021BCUL))
#define bFM0P_MFS1_LIN_FCR0_FE1                *((volatile unsigned int*)(0x42702280UL))
#define bFM0P_MFS1_LIN_FCR0_FE2                *((volatile unsigned int*)(0x42702284UL))
#define bFM0P_MFS1_LIN_FCR0_FCL1               *((volatile unsigned int*)(0x42702288UL))
#define bFM0P_MFS1_LIN_FCR0_FCL2               *((volatile unsigned int*)(0x4270228CUL))
#define bFM0P_MFS1_LIN_FCR0_FSET               *((volatile unsigned int*)(0x42702290UL))
#define bFM0P_MFS1_LIN_FCR0_FLD                *((volatile unsigned int*)(0x42702294UL))
#define bFM0P_MFS1_LIN_FCR0_FLST               *((volatile unsigned int*)(0x42702298UL))
#define bFM0P_MFS1_LIN_FCR1_FSEL               *((volatile unsigned int*)(0x427022A0UL))
#define bFM0P_MFS1_LIN_FCR1_FTIE               *((volatile unsigned int*)(0x427022A4UL))
#define bFM0P_MFS1_LIN_FCR1_FDRQ               *((volatile unsigned int*)(0x427022A8UL))
#define bFM0P_MFS1_LIN_FCR1_FRIIE              *((volatile unsigned int*)(0x427022ACUL))
#define bFM0P_MFS1_LIN_FCR1_FLSTE              *((volatile unsigned int*)(0x427022B0UL))

/* MFS I2C channel 1 registers */
#define bFM0P_MFS1_I2C_SMR_TIE                 *((volatile unsigned int*)(0x42702008UL))
#define bFM0P_MFS1_I2C_SMR_RIE                 *((volatile unsigned int*)(0x4270200CUL))
#define bFM0P_MFS1_I2C_SMR_MD0                 *((volatile unsigned int*)(0x42702014UL))
#define bFM0P_MFS1_I2C_SMR_MD1                 *((volatile unsigned int*)(0x42702018UL))
#define bFM0P_MFS1_I2C_SMR_MD2                 *((volatile unsigned int*)(0x4270201CUL))
#define bFM0P_MFS1_I2C_IBCR_INT                *((volatile unsigned int*)(0x42702020UL))
#define bFM0P_MFS1_I2C_IBCR_BER                *((volatile unsigned int*)(0x42702024UL))
#define bFM0P_MFS1_I2C_IBCR_INTE               *((volatile unsigned int*)(0x42702028UL))
#define bFM0P_MFS1_I2C_IBCR_CNDE               *((volatile unsigned int*)(0x4270202CUL))
#define bFM0P_MFS1_I2C_IBCR_WSEL               *((volatile unsigned int*)(0x42702030UL))
#define bFM0P_MFS1_I2C_IBCR_ACKE               *((volatile unsigned int*)(0x42702034UL))
#define bFM0P_MFS1_I2C_IBCR_ACT_SCC            *((volatile unsigned int*)(0x42702038UL))
#define bFM0P_MFS1_I2C_IBCR_MSS                *((volatile unsigned int*)(0x4270203CUL))
#define bFM0P_MFS1_I2C_IBSR_BB                 *((volatile unsigned int*)(0x42702080UL))
#define bFM0P_MFS1_I2C_IBSR_SPC                *((volatile unsigned int*)(0x42702084UL))
#define bFM0P_MFS1_I2C_IBSR_RSC                *((volatile unsigned int*)(0x42702088UL))
#define bFM0P_MFS1_I2C_IBSR_AL                 *((volatile unsigned int*)(0x4270208CUL))
#define bFM0P_MFS1_I2C_IBSR_TRX                *((volatile unsigned int*)(0x42702090UL))
#define bFM0P_MFS1_I2C_IBSR_RSA                *((volatile unsigned int*)(0x42702094UL))
#define bFM0P_MFS1_I2C_IBSR_RACK               *((volatile unsigned int*)(0x42702098UL))
#define bFM0P_MFS1_I2C_IBSR_FBT                *((volatile unsigned int*)(0x4270209CUL))
#define bFM0P_MFS1_I2C_SSR_TBI                 *((volatile unsigned int*)(0x427020A0UL))
#define bFM0P_MFS1_I2C_SSR_TDRE                *((volatile unsigned int*)(0x427020A4UL))
#define bFM0P_MFS1_I2C_SSR_RDRF                *((volatile unsigned int*)(0x427020A8UL))
#define bFM0P_MFS1_I2C_SSR_ORE                 *((volatile unsigned int*)(0x427020ACUL))
#define bFM0P_MFS1_I2C_SSR_TBIE                *((volatile unsigned int*)(0x427020B0UL))
#define bFM0P_MFS1_I2C_SSR_DMA                 *((volatile unsigned int*)(0x427020B4UL))
#define bFM0P_MFS1_I2C_SSR_TSET                *((volatile unsigned int*)(0x427020B8UL))
#define bFM0P_MFS1_I2C_SSR_REC                 *((volatile unsigned int*)(0x427020BCUL))
#define bFM0P_MFS1_I2C_BGR_BGR00               *((volatile unsigned int*)(0x42702180UL))
#define bFM0P_MFS1_I2C_BGR_BGR01               *((volatile unsigned int*)(0x42702184UL))
#define bFM0P_MFS1_I2C_BGR_BGR02               *((volatile unsigned int*)(0x42702188UL))
#define bFM0P_MFS1_I2C_BGR_BGR03               *((volatile unsigned int*)(0x4270218CUL))
#define bFM0P_MFS1_I2C_BGR_BGR04               *((volatile unsigned int*)(0x42702190UL))
#define bFM0P_MFS1_I2C_BGR_BGR05               *((volatile unsigned int*)(0x42702194UL))
#define bFM0P_MFS1_I2C_BGR_BGR06               *((volatile unsigned int*)(0x42702198UL))
#define bFM0P_MFS1_I2C_BGR_BGR07               *((volatile unsigned int*)(0x4270219CUL))
#define bFM0P_MFS1_I2C_BGR_BGR10               *((volatile unsigned int*)(0x427021A0UL))
#define bFM0P_MFS1_I2C_BGR_BGR11               *((volatile unsigned int*)(0x427021A4UL))
#define bFM0P_MFS1_I2C_BGR_BGR12               *((volatile unsigned int*)(0x427021A8UL))
#define bFM0P_MFS1_I2C_BGR_BGR13               *((volatile unsigned int*)(0x427021ACUL))
#define bFM0P_MFS1_I2C_BGR_BGR14               *((volatile unsigned int*)(0x427021B0UL))
#define bFM0P_MFS1_I2C_BGR_BGR15               *((volatile unsigned int*)(0x427021B4UL))
#define bFM0P_MFS1_I2C_BGR_BGR16               *((volatile unsigned int*)(0x427021B8UL))
#define bFM0P_MFS1_I2C_ISBA_SA0                *((volatile unsigned int*)(0x42702200UL))
#define bFM0P_MFS1_I2C_ISBA_SA1                *((volatile unsigned int*)(0x42702204UL))
#define bFM0P_MFS1_I2C_ISBA_SA2                *((volatile unsigned int*)(0x42702208UL))
#define bFM0P_MFS1_I2C_ISBA_SA3                *((volatile unsigned int*)(0x4270220CUL))
#define bFM0P_MFS1_I2C_ISBA_SA4                *((volatile unsigned int*)(0x42702210UL))
#define bFM0P_MFS1_I2C_ISBA_SA5                *((volatile unsigned int*)(0x42702214UL))
#define bFM0P_MFS1_I2C_ISBA_SA6                *((volatile unsigned int*)(0x42702218UL))
#define bFM0P_MFS1_I2C_ISBA_SAEN               *((volatile unsigned int*)(0x4270221CUL))
#define bFM0P_MFS1_I2C_ISMK_SM0                *((volatile unsigned int*)(0x42702220UL))
#define bFM0P_MFS1_I2C_ISMK_SM1                *((volatile unsigned int*)(0x42702224UL))
#define bFM0P_MFS1_I2C_ISMK_SM2                *((volatile unsigned int*)(0x42702228UL))
#define bFM0P_MFS1_I2C_ISMK_SM3                *((volatile unsigned int*)(0x4270222CUL))
#define bFM0P_MFS1_I2C_ISMK_SM4                *((volatile unsigned int*)(0x42702230UL))
#define bFM0P_MFS1_I2C_ISMK_SM5                *((volatile unsigned int*)(0x42702234UL))
#define bFM0P_MFS1_I2C_ISMK_SM6                *((volatile unsigned int*)(0x42702238UL))
#define bFM0P_MFS1_I2C_ISMK_EN                 *((volatile unsigned int*)(0x4270223CUL))
#define bFM0P_MFS1_I2C_FCR0_FE1                *((volatile unsigned int*)(0x42702280UL))
#define bFM0P_MFS1_I2C_FCR0_FE2                *((volatile unsigned int*)(0x42702284UL))
#define bFM0P_MFS1_I2C_FCR0_FCL1               *((volatile unsigned int*)(0x42702288UL))
#define bFM0P_MFS1_I2C_FCR0_FCL2               *((volatile unsigned int*)(0x4270228CUL))
#define bFM0P_MFS1_I2C_FCR0_FSET               *((volatile unsigned int*)(0x42702290UL))
#define bFM0P_MFS1_I2C_FCR0_FLD                *((volatile unsigned int*)(0x42702294UL))
#define bFM0P_MFS1_I2C_FCR0_FLST               *((volatile unsigned int*)(0x42702298UL))
#define bFM0P_MFS1_I2C_FCR1_FSEL               *((volatile unsigned int*)(0x427022A0UL))
#define bFM0P_MFS1_I2C_FCR1_FTIE               *((volatile unsigned int*)(0x427022A4UL))
#define bFM0P_MFS1_I2C_FCR1_FDRQ               *((volatile unsigned int*)(0x427022A8UL))
#define bFM0P_MFS1_I2C_FCR1_FRIIE              *((volatile unsigned int*)(0x427022ACUL))
#define bFM0P_MFS1_I2C_FCR1_FLSTE              *((volatile unsigned int*)(0x427022B0UL))
#define bFM0P_MFS1_I2C_EIBCR_BEC               *((volatile unsigned int*)(0x427023A0UL))
#define bFM0P_MFS1_I2C_EIBCR_SOCE              *((volatile unsigned int*)(0x427023A4UL))
#define bFM0P_MFS1_I2C_EIBCR_SCLC              *((volatile unsigned int*)(0x427023A8UL))
#define bFM0P_MFS1_I2C_EIBCR_SDAC              *((volatile unsigned int*)(0x427023ACUL))
#define bFM0P_MFS1_I2C_EIBCR_SCLS              *((volatile unsigned int*)(0x427023B0UL))
#define bFM0P_MFS1_I2C_EIBCR_SDAS              *((volatile unsigned int*)(0x427023B4UL))

/* MFS3 UART channel 3 register */
#define bFM0P_MFS3_UART_SMR_SOE                *((volatile unsigned int*)(0x42706000UL))
#define bFM0P_MFS3_UART_SMR_BDS                *((volatile unsigned int*)(0x42706008UL))
#define bFM0P_MFS3_UART_SMR_SBL                *((volatile unsigned int*)(0x4270600CUL))
#define bFM0P_MFS3_UART_SMR_MD0                *((volatile unsigned int*)(0x42706014UL))
#define bFM0P_MFS3_UART_SMR_MD1                *((volatile unsigned int*)(0x42706018UL))
#define bFM0P_MFS3_UART_SMR_MD2                *((volatile unsigned int*)(0x4270601CUL))
#define bFM0P_MFS3_UART_SCR_TXE                *((volatile unsigned int*)(0x42706020UL))
#define bFM0P_MFS3_UART_SCR_RXE                *((volatile unsigned int*)(0x42706024UL))
#define bFM0P_MFS3_UART_SCR_TBIE               *((volatile unsigned int*)(0x42706028UL))
#define bFM0P_MFS3_UART_SCR_TIE                *((volatile unsigned int*)(0x4270602CUL))
#define bFM0P_MFS3_UART_SCR_RIE                *((volatile unsigned int*)(0x42706030UL))
#define bFM0P_MFS3_UART_SCR_UPCL               *((volatile unsigned int*)(0x4270603CUL))
#define bFM0P_MFS3_UART_ESCR_L0                *((volatile unsigned int*)(0x42706080UL))
#define bFM0P_MFS3_UART_ESCR_L1                *((volatile unsigned int*)(0x42706084UL))
#define bFM0P_MFS3_UART_ESCR_L2                *((volatile unsigned int*)(0x42706088UL))
#define bFM0P_MFS3_UART_ESCR_P                 *((volatile unsigned int*)(0x4270608CUL))
#define bFM0P_MFS3_UART_ESCR_PEN               *((volatile unsigned int*)(0x42706090UL))
#define bFM0P_MFS3_UART_ESCR_INV               *((volatile unsigned int*)(0x42706094UL))
#define bFM0P_MFS3_UART_ESCR_ESBL              *((volatile unsigned int*)(0x42706098UL))
#define bFM0P_MFS3_UART_ESCR_FLWEN             *((volatile unsigned int*)(0x4270609CUL))
#define bFM0P_MFS3_UART_SSR_TBI                *((volatile unsigned int*)(0x427060A0UL))
#define bFM0P_MFS3_UART_SSR_TDRE               *((volatile unsigned int*)(0x427060A4UL))
#define bFM0P_MFS3_UART_SSR_RDRF               *((volatile unsigned int*)(0x427060A8UL))
#define bFM0P_MFS3_UART_SSR_ORE                *((volatile unsigned int*)(0x427060ACUL))
#define bFM0P_MFS3_UART_SSR_FRE                *((volatile unsigned int*)(0x427060B0UL))
#define bFM0P_MFS3_UART_SSR_PE                 *((volatile unsigned int*)(0x427060B4UL))
#define bFM0P_MFS3_UART_SSR_REC                *((volatile unsigned int*)(0x427060BCUL))
#define bFM0P_MFS3_UART_BGR_BGR00              *((volatile unsigned int*)(0x42706180UL))
#define bFM0P_MFS3_UART_BGR_BGR01              *((volatile unsigned int*)(0x42706184UL))
#define bFM0P_MFS3_UART_BGR_BGR02              *((volatile unsigned int*)(0x42706188UL))
#define bFM0P_MFS3_UART_BGR_BGR03              *((volatile unsigned int*)(0x4270618CUL))
#define bFM0P_MFS3_UART_BGR_BGR04              *((volatile unsigned int*)(0x42706190UL))
#define bFM0P_MFS3_UART_BGR_BGR05              *((volatile unsigned int*)(0x42706194UL))
#define bFM0P_MFS3_UART_BGR_BGR06              *((volatile unsigned int*)(0x42706198UL))
#define bFM0P_MFS3_UART_BGR_BGR07              *((volatile unsigned int*)(0x4270619CUL))
#define bFM0P_MFS3_UART_BGR_BGR10              *((volatile unsigned int*)(0x427061A0UL))
#define bFM0P_MFS3_UART_BGR_BGR11              *((volatile unsigned int*)(0x427061A4UL))
#define bFM0P_MFS3_UART_BGR_BGR12              *((volatile unsigned int*)(0x427061A8UL))
#define bFM0P_MFS3_UART_BGR_BGR13              *((volatile unsigned int*)(0x427061ACUL))
#define bFM0P_MFS3_UART_BGR_BGR14              *((volatile unsigned int*)(0x427061B0UL))
#define bFM0P_MFS3_UART_BGR_BGR15              *((volatile unsigned int*)(0x427061B4UL))
#define bFM0P_MFS3_UART_BGR_BGR16              *((volatile unsigned int*)(0x427061B8UL))
#define bFM0P_MFS3_UART_BGR_EXT                *((volatile unsigned int*)(0x427061BCUL))
#define bFM0P_MFS3_UART_FCR0_FE1               *((volatile unsigned int*)(0x42706280UL))
#define bFM0P_MFS3_UART_FCR0_FE2               *((volatile unsigned int*)(0x42706284UL))
#define bFM0P_MFS3_UART_FCR0_FCL1              *((volatile unsigned int*)(0x42706288UL))
#define bFM0P_MFS3_UART_FCR0_FCL2              *((volatile unsigned int*)(0x4270628CUL))
#define bFM0P_MFS3_UART_FCR0_FSET              *((volatile unsigned int*)(0x42706290UL))
#define bFM0P_MFS3_UART_FCR0_FLD               *((volatile unsigned int*)(0x42706294UL))
#define bFM0P_MFS3_UART_FCR0_FLST              *((volatile unsigned int*)(0x42706298UL))
#define bFM0P_MFS3_UART_FCR1_FSEL              *((volatile unsigned int*)(0x427062A0UL))
#define bFM0P_MFS3_UART_FCR1_FTIE              *((volatile unsigned int*)(0x427062A4UL))
#define bFM0P_MFS3_UART_FCR1_FDRQ              *((volatile unsigned int*)(0x427062A8UL))
#define bFM0P_MFS3_UART_FCR1_FRIIE             *((volatile unsigned int*)(0x427062ACUL))
#define bFM0P_MFS3_UART_FCR1_FLSTE             *((volatile unsigned int*)(0x427062B0UL))

