furjie/Single-BLDC-driver-and-app/s6e1a1.h
/* MFS3 CSIO channel 3 register */
#define bFM0P_MFS3_CSIO_SMR_SOE                *((volatile unsigned int*)(0x42706000UL))
#define bFM0P_MFS3_CSIO_SMR_SCKE               *((volatile unsigned int*)(0x42706004UL))
#define bFM0P_MFS3_CSIO_SMR_BDS                *((volatile unsigned int*)(0x42706008UL))
#define bFM0P_MFS3_CSIO_SMR_SCINV              *((volatile unsigned int*)(0x4270600CUL))
#define bFM0P_MFS3_CSIO_SMR_MD0                *((volatile unsigned int*)(0x42706014UL))
#define bFM0P_MFS3_CSIO_SMR_MD1                *((volatile unsigned int*)(0x42706018UL))
#define bFM0P_MFS3_CSIO_SMR_MD2                *((volatile unsigned int*)(0x4270601CUL))
#define bFM0P_MFS3_CSIO_SCR_TXE                *((volatile unsigned int*)(0x42706020UL))
#define bFM0P_MFS3_CSIO_SCR_RXE                *((volatile unsigned int*)(0x42706024UL))
#define bFM0P_MFS3_CSIO_SCR_TBIE               *((volatile unsigned int*)(0x42706028UL))
#define bFM0P_MFS3_CSIO_SCR_TIE                *((volatile unsigned int*)(0x4270602CUL))
#define bFM0P_MFS3_CSIO_SCR_RIE                *((volatile unsigned int*)(0x42706030UL))
#define bFM0P_MFS3_CSIO_SCR_SPI                *((volatile unsigned int*)(0x42706034UL))
#define bFM0P_MFS3_CSIO_SCR_MS                 *((volatile unsigned int*)(0x42706038UL))
#define bFM0P_MFS3_CSIO_SCR_UPCL               *((volatile unsigned int*)(0x4270603CUL))
#define bFM0P_MFS3_CSIO_ESCR_L0                *((volatile unsigned int*)(0x42706080UL))
#define bFM0P_MFS3_CSIO_ESCR_L1                *((volatile unsigned int*)(0x42706084UL))
#define bFM0P_MFS3_CSIO_ESCR_L2                *((volatile unsigned int*)(0x42706088UL))
#define bFM0P_MFS3_CSIO_ESCR_WT0               *((volatile unsigned int*)(0x4270608CUL))
#define bFM0P_MFS3_CSIO_ESCR_WT1               *((volatile unsigned int*)(0x42706090UL))
#define bFM0P_MFS3_CSIO_ESCR_CSFE              *((volatile unsigned int*)(0x42706094UL))
#define bFM0P_MFS3_CSIO_ESCR_L3                *((volatile unsigned int*)(0x42706098UL))
#define bFM0P_MFS3_CSIO_ESCR_SOP               *((volatile unsigned int*)(0x4270609CUL))
#define bFM0P_MFS3_CSIO_SSR_TBI                *((volatile unsigned int*)(0x427060A0UL))
#define bFM0P_MFS3_CSIO_SSR_TDRE               *((volatile unsigned int*)(0x427060A4UL))
#define bFM0P_MFS3_CSIO_SSR_RDRF               *((volatile unsigned int*)(0x427060A8UL))
#define bFM0P_MFS3_CSIO_SSR_ORE                *((volatile unsigned int*)(0x427060ACUL))
#define bFM0P_MFS3_CSIO_SSR_REC                *((volatile unsigned int*)(0x427060BCUL))
#define bFM0P_MFS3_CSIO_BGR_BGR00              *((volatile unsigned int*)(0x42706180UL))
#define bFM0P_MFS3_CSIO_BGR_BGR01              *((volatile unsigned int*)(0x42706184UL))
#define bFM0P_MFS3_CSIO_BGR_BGR02              *((volatile unsigned int*)(0x42706188UL))
#define bFM0P_MFS3_CSIO_BGR_BGR03              *((volatile unsigned int*)(0x4270618CUL))
#define bFM0P_MFS3_CSIO_BGR_BGR04              *((volatile unsigned int*)(0x42706190UL))
#define bFM0P_MFS3_CSIO_BGR_BGR05              *((volatile unsigned int*)(0x42706194UL))
#define bFM0P_MFS3_CSIO_BGR_BGR06              *((volatile unsigned int*)(0x42706198UL))
#define bFM0P_MFS3_CSIO_BGR_BGR07              *((volatile unsigned int*)(0x4270619CUL))
#define bFM0P_MFS3_CSIO_BGR_BGR10              *((volatile unsigned int*)(0x427061A0UL))
#define bFM0P_MFS3_CSIO_BGR_BGR11              *((volatile unsigned int*)(0x427061A4UL))
#define bFM0P_MFS3_CSIO_BGR_BGR12              *((volatile unsigned int*)(0x427061A8UL))
#define bFM0P_MFS3_CSIO_BGR_BGR13              *((volatile unsigned int*)(0x427061ACUL))
#define bFM0P_MFS3_CSIO_BGR_BGR14              *((volatile unsigned int*)(0x427061B0UL))
#define bFM0P_MFS3_CSIO_BGR_BGR15              *((volatile unsigned int*)(0x427061B4UL))
#define bFM0P_MFS3_CSIO_BGR_BGR16              *((volatile unsigned int*)(0x427061B8UL))
#define bFM0P_MFS3_CSIO_FCR0_FE1               *((volatile unsigned int*)(0x42706280UL))
#define bFM0P_MFS3_CSIO_FCR0_FE2               *((volatile unsigned int*)(0x42706284UL))
#define bFM0P_MFS3_CSIO_FCR0_FCL1              *((volatile unsigned int*)(0x42706288UL))
#define bFM0P_MFS3_CSIO_FCR0_FCL2              *((volatile unsigned int*)(0x4270628CUL))
#define bFM0P_MFS3_CSIO_FCR0_FSET              *((volatile unsigned int*)(0x42706290UL))
#define bFM0P_MFS3_CSIO_FCR0_FLD               *((volatile unsigned int*)(0x42706294UL))
#define bFM0P_MFS3_CSIO_FCR0_FLST              *((volatile unsigned int*)(0x42706298UL))
#define bFM0P_MFS3_CSIO_FCR1_FSEL              *((volatile unsigned int*)(0x427062A0UL))
#define bFM0P_MFS3_CSIO_FCR1_FTIE              *((volatile unsigned int*)(0x427062A4UL))
#define bFM0P_MFS3_CSIO_FCR1_FDRQ              *((volatile unsigned int*)(0x427062A8UL))
#define bFM0P_MFS3_CSIO_FCR1_FRIIE             *((volatile unsigned int*)(0x427062ACUL))
#define bFM0P_MFS3_CSIO_FCR1_FLSTE             *((volatile unsigned int*)(0x427062B0UL))
#define bFM0P_MFS3_CSIO_SCSTR0_CSHD0           *((volatile unsigned int*)(0x42706380UL))
#define bFM0P_MFS3_CSIO_SCSTR0_CSHD1           *((volatile unsigned int*)(0x42706384UL))
#define bFM0P_MFS3_CSIO_SCSTR0_CSHD2           *((volatile unsigned int*)(0x42706388UL))
#define bFM0P_MFS3_CSIO_SCSTR0_CSHD3           *((volatile unsigned int*)(0x4270638CUL))
#define bFM0P_MFS3_CSIO_SCSTR0_CSHD4           *((volatile unsigned int*)(0x42706390UL))
#define bFM0P_MFS3_CSIO_SCSTR0_CSHD5           *((volatile unsigned int*)(0x42706394UL))
#define bFM0P_MFS3_CSIO_SCSTR0_CSHD6           *((volatile unsigned int*)(0x42706398UL))
#define bFM0P_MFS3_CSIO_SCSTR0_CSHD7           *((volatile unsigned int*)(0x4270639CUL))
#define bFM0P_MFS3_CSIO_SCSTR1_CSSU0           *((volatile unsigned int*)(0x427063A0UL))
#define bFM0P_MFS3_CSIO_SCSTR1_CSSU1           *((volatile unsigned int*)(0x427063A4UL))
#define bFM0P_MFS3_CSIO_SCSTR1_CSSU2           *((volatile unsigned int*)(0x427063A8UL))
#define bFM0P_MFS3_CSIO_SCSTR1_CSSU3           *((volatile unsigned int*)(0x427063ACUL))
#define bFM0P_MFS3_CSIO_SCSTR1_CSSU4           *((volatile unsigned int*)(0x427063B0UL))
#define bFM0P_MFS3_CSIO_SCSTR1_CSSU5           *((volatile unsigned int*)(0x427063B4UL))
#define bFM0P_MFS3_CSIO_SCSTR1_CSSU6           *((volatile unsigned int*)(0x427063B8UL))
#define bFM0P_MFS3_CSIO_SCSTR1_CSSU7           *((volatile unsigned int*)(0x427063BCUL))
#define bFM0P_MFS3_CSIO_SCSTR32_CSDS0          *((volatile unsigned int*)(0x42706400UL))
#define bFM0P_MFS3_CSIO_SCSTR32_CSDS1          *((volatile unsigned int*)(0x42706404UL))
#define bFM0P_MFS3_CSIO_SCSTR32_CSDS2          *((volatile unsigned int*)(0x42706408UL))
#define bFM0P_MFS3_CSIO_SCSTR32_CSDS3          *((volatile unsigned int*)(0x4270640CUL))
#define bFM0P_MFS3_CSIO_SCSTR32_CSDS4          *((volatile unsigned int*)(0x42706410UL))
#define bFM0P_MFS3_CSIO_SCSTR32_CSDS5          *((volatile unsigned int*)(0x42706414UL))
#define bFM0P_MFS3_CSIO_SCSTR32_CSDS6          *((volatile unsigned int*)(0x42706418UL))
#define bFM0P_MFS3_CSIO_SCSTR32_CSDS7          *((volatile unsigned int*)(0x4270641CUL))
#define bFM0P_MFS3_CSIO_SCSTR32_CSDS8          *((volatile unsigned int*)(0x42706420UL))
#define bFM0P_MFS3_CSIO_SCSTR32_CSDS9          *((volatile unsigned int*)(0x42706424UL))
#define bFM0P_MFS3_CSIO_SCSTR32_CSDS10         *((volatile unsigned int*)(0x42706428UL))
#define bFM0P_MFS3_CSIO_SCSTR32_CSDS11         *((volatile unsigned int*)(0x4270642CUL))
#define bFM0P_MFS3_CSIO_SCSTR32_CSDS12         *((volatile unsigned int*)(0x42706430UL))
#define bFM0P_MFS3_CSIO_SCSTR32_CSDS13         *((volatile unsigned int*)(0x42706434UL))
#define bFM0P_MFS3_CSIO_SCSTR32_CSDS14         *((volatile unsigned int*)(0x42706438UL))
#define bFM0P_MFS3_CSIO_SCSTR32_CSDS15         *((volatile unsigned int*)(0x4270643CUL))
#define bFM0P_MFS3_CSIO_SACSR_TMRE             *((volatile unsigned int*)(0x42706480UL))
#define bFM0P_MFS3_CSIO_SACSR_TDIV0            *((volatile unsigned int*)(0x42706484UL))
#define bFM0P_MFS3_CSIO_SACSR_TDIV1            *((volatile unsigned int*)(0x42706488UL))
#define bFM0P_MFS3_CSIO_SACSR_TDIV2            *((volatile unsigned int*)(0x4270648CUL))
#define bFM0P_MFS3_CSIO_SACSR_TDIV3            *((volatile unsigned int*)(0x42706490UL))
#define bFM0P_MFS3_CSIO_SACSR_TSYNE            *((volatile unsigned int*)(0x42706498UL))
#define bFM0P_MFS3_CSIO_SACSR_TINTE            *((volatile unsigned int*)(0x4270649CUL))
#define bFM0P_MFS3_CSIO_SACSR_TINT             *((volatile unsigned int*)(0x427064A0UL))
#define bFM0P_MFS3_CSIO_SACSR_CSE              *((volatile unsigned int*)(0x427064ACUL))
#define bFM0P_MFS3_CSIO_SACSR_CSEIE            *((volatile unsigned int*)(0x427064B0UL))
#define bFM0P_MFS3_CSIO_SACSR_TBEEN            *((volatile unsigned int*)(0x427064B4UL))
#define bFM0P_MFS3_CSIO_STMR_TM0               *((volatile unsigned int*)(0x42706500UL))
#define bFM0P_MFS3_CSIO_STMR_TM1               *((volatile unsigned int*)(0x42706504UL))
#define bFM0P_MFS3_CSIO_STMR_TM2               *((volatile unsigned int*)(0x42706508UL))
#define bFM0P_MFS3_CSIO_STMR_TM3               *((volatile unsigned int*)(0x4270650CUL))
#define bFM0P_MFS3_CSIO_STMR_TM4               *((volatile unsigned int*)(0x42706510UL))
#define bFM0P_MFS3_CSIO_STMR_TM5               *((volatile unsigned int*)(0x42706514UL))
#define bFM0P_MFS3_CSIO_STMR_TM6               *((volatile unsigned int*)(0x42706518UL))
#define bFM0P_MFS3_CSIO_STMR_TM7               *((volatile unsigned int*)(0x4270651CUL))
#define bFM0P_MFS3_CSIO_STMR_TM8               *((volatile unsigned int*)(0x42706520UL))
#define bFM0P_MFS3_CSIO_STMR_TM9               *((volatile unsigned int*)(0x42706524UL))
#define bFM0P_MFS3_CSIO_STMR_TM10              *((volatile unsigned int*)(0x42706528UL))
#define bFM0P_MFS3_CSIO_STMR_TM11              *((volatile unsigned int*)(0x4270652CUL))
#define bFM0P_MFS3_CSIO_STMR_TM12              *((volatile unsigned int*)(0x42706530UL))
#define bFM0P_MFS3_CSIO_STMR_TM13              *((volatile unsigned int*)(0x42706534UL))
#define bFM0P_MFS3_CSIO_STMR_TM14              *((volatile unsigned int*)(0x42706538UL))
#define bFM0P_MFS3_CSIO_STMR_TM15              *((volatile unsigned int*)(0x4270653CUL))
#define bFM0P_MFS3_CSIO_TMCR_TC0               *((volatile unsigned int*)(0x42706580UL))
#define bFM0P_MFS3_CSIO_TMCR_TC1               *((volatile unsigned int*)(0x42706584UL))
#define bFM0P_MFS3_CSIO_TMCR_TC2               *((volatile unsigned int*)(0x42706588UL))
#define bFM0P_MFS3_CSIO_TMCR_TC3               *((volatile unsigned int*)(0x4270658CUL))
#define bFM0P_MFS3_CSIO_TMCR_TC4               *((volatile unsigned int*)(0x42706590UL))
#define bFM0P_MFS3_CSIO_TMCR_TC5               *((volatile unsigned int*)(0x42706594UL))
#define bFM0P_MFS3_CSIO_TMCR_TC6               *((volatile unsigned int*)(0x42706598UL))
#define bFM0P_MFS3_CSIO_TMCR_TC7               *((volatile unsigned int*)(0x4270659CUL))
#define bFM0P_MFS3_CSIO_TMCR_TC8               *((volatile unsigned int*)(0x427065A0UL))
#define bFM0P_MFS3_CSIO_TMCR_TC9               *((volatile unsigned int*)(0x427065A4UL))
#define bFM0P_MFS3_CSIO_TMCR_TC10              *((volatile unsigned int*)(0x427065A8UL))
#define bFM0P_MFS3_CSIO_TMCR_TC11              *((volatile unsigned int*)(0x427065ACUL))
#define bFM0P_MFS3_CSIO_TMCR_TC12              *((volatile unsigned int*)(0x427065B0UL))
#define bFM0P_MFS3_CSIO_TMCR_TC13              *((volatile unsigned int*)(0x427065B4UL))
#define bFM0P_MFS3_CSIO_TMCR_TC14              *((volatile unsigned int*)(0x427065B8UL))
#define bFM0P_MFS3_CSIO_TMCR_TC15              *((volatile unsigned int*)(0x427065BCUL))
#define bFM0P_MFS3_CSIO_SCSCR_CSOE             *((volatile unsigned int*)(0x42706600UL))
#define bFM0P_MFS3_CSIO_SCSCR_CSEN0            *((volatile unsigned int*)(0x42706604UL))
#define bFM0P_MFS3_CSIO_SCSCR_CSEN1            *((volatile unsigned int*)(0x42706608UL))
#define bFM0P_MFS3_CSIO_SCSCR_CSEN2            *((volatile unsigned int*)(0x4270660CUL))
#define bFM0P_MFS3_CSIO_SCSCR_CSEN3            *((volatile unsigned int*)(0x42706610UL))
#define bFM0P_MFS3_CSIO_SCSCR_CSLVL            *((volatile unsigned int*)(0x42706614UL))
#define bFM0P_MFS3_CSIO_SCSCR_CDIV0            *((volatile unsigned int*)(0x42706618UL))
#define bFM0P_MFS3_CSIO_SCSCR_CDIV1            *((volatile unsigned int*)(0x4270661CUL))
#define bFM0P_MFS3_CSIO_SCSCR_CDIV2            *((volatile unsigned int*)(0x42706620UL))
#define bFM0P_MFS3_CSIO_SCSCR_SCAM             *((volatile unsigned int*)(0x42706624UL))
#define bFM0P_MFS3_CSIO_SCSCR_SCD0             *((volatile unsigned int*)(0x42706628UL))
#define bFM0P_MFS3_CSIO_SCSCR_SCD1             *((volatile unsigned int*)(0x4270662CUL))
#define bFM0P_MFS3_CSIO_SCSCR_SED0             *((volatile unsigned int*)(0x42706630UL))
#define bFM0P_MFS3_CSIO_SCSCR_SED1             *((volatile unsigned int*)(0x42706634UL))
#define bFM0P_MFS3_CSIO_SCSCR_SST0             *((volatile unsigned int*)(0x42706638UL))
#define bFM0P_MFS3_CSIO_SCSCR_SST1             *((volatile unsigned int*)(0x4270663CUL))
#define bFM0P_MFS3_CSIO_SCSFR0_CS1L0           *((volatile unsigned int*)(0x42706680UL))
#define bFM0P_MFS3_CSIO_SCSFR0_CS1L1           *((volatile unsigned int*)(0x42706684UL))
#define bFM0P_MFS3_CSIO_SCSFR0_CS1L2           *((volatile unsigned int*)(0x42706688UL))
#define bFM0P_MFS3_CSIO_SCSFR0_CS1L3           *((volatile unsigned int*)(0x4270668CUL))
#define bFM0P_MFS3_CSIO_SCSFR0_CS1BDS          *((volatile unsigned int*)(0x42706690UL))
#define bFM0P_MFS3_CSIO_SCSFR0_CS1SPI          *((volatile unsigned int*)(0x42706694UL))
#define bFM0P_MFS3_CSIO_SCSFR0_CS1SCINV        *((volatile unsigned int*)(0x42706698UL))
#define bFM0P_MFS3_CSIO_SCSFR0_CS1CSLVL        *((volatile unsigned int*)(0x4270669CUL))
#define bFM0P_MFS3_CSIO_SCSFR1_CS2L0           *((volatile unsigned int*)(0x427066A0UL))
#define bFM0P_MFS3_CSIO_SCSFR1_CS2L1           *((volatile unsigned int*)(0x427066A4UL))
#define bFM0P_MFS3_CSIO_SCSFR1_CS2L2           *((volatile unsigned int*)(0x427066A8UL))
#define bFM0P_MFS3_CSIO_SCSFR1_CS2L3           *((volatile unsigned int*)(0x427066ACUL))
#define bFM0P_MFS3_CSIO_SCSFR1_CS2BDS          *((volatile unsigned int*)(0x427066B0UL))
#define bFM0P_MFS3_CSIO_SCSFR1_CS2SPI          *((volatile unsigned int*)(0x427066B4UL))
#define bFM0P_MFS3_CSIO_SCSFR1_CS2SCINV        *((volatile unsigned int*)(0x427066B8UL))
#define bFM0P_MFS3_CSIO_SCSFR1_CS2CSLVL        *((volatile unsigned int*)(0x427066BCUL))
#define bFM0P_MFS3_CSIO_SCSFR3_CS3L0           *((volatile unsigned int*)(0x42706700UL))
#define bFM0P_MFS3_CSIO_SCSFR3_CS3L1           *((volatile unsigned int*)(0x42706704UL))
#define bFM0P_MFS3_CSIO_SCSFR3_CS3L2           *((volatile unsigned int*)(0x42706708UL))
#define bFM0P_MFS3_CSIO_SCSFR3_CS3L3           *((volatile unsigned int*)(0x4270670CUL))
#define bFM0P_MFS3_CSIO_SCSFR3_CS3BDS          *((volatile unsigned int*)(0x42706710UL))
#define bFM0P_MFS3_CSIO_SCSFR3_CS3SPI          *((volatile unsigned int*)(0x42706714UL))
#define bFM0P_MFS3_CSIO_SCSFR3_CS3SCINV        *((volatile unsigned int*)(0x42706718UL))
#define bFM0P_MFS3_CSIO_SCSFR3_CS3CSLVL        *((volatile unsigned int*)(0x4270671CUL))

/* MFS3 LIN channel 3 register */
#define bFM0P_MFS3_LIN_SMR_SOE                 *((volatile unsigned int*)(0x42706000UL))
#define bFM0P_MFS3_LIN_SMR_SBL                 *((volatile unsigned int*)(0x4270600CUL))
#define bFM0P_MFS3_LIN_SMR_MD0                 *((volatile unsigned int*)(0x42706014UL))
#define bFM0P_MFS3_LIN_SMR_MD1                 *((volatile unsigned int*)(0x42706018UL))
#define bFM0P_MFS3_LIN_SMR_MD2                 *((volatile unsigned int*)(0x4270601CUL))
#define bFM0P_MFS3_LIN_SCR_TXE                 *((volatile unsigned int*)(0x42706020UL))
#define bFM0P_MFS3_LIN_SCR_RXE                 *((volatile unsigned int*)(0x42706024UL))
#define bFM0P_MFS3_LIN_SCR_TBIE                *((volatile unsigned int*)(0x42706028UL))
#define bFM0P_MFS3_LIN_SCR_TIE                 *((volatile unsigned int*)(0x4270602CUL))
#define bFM0P_MFS3_LIN_SCR_RIE                 *((volatile unsigned int*)(0x42706030UL))
#define bFM0P_MFS3_LIN_SCR_LBR                 *((volatile unsigned int*)(0x42706034UL))
#define bFM0P_MFS3_LIN_SCR_MS                  *((volatile unsigned int*)(0x42706038UL))
#define bFM0P_MFS3_LIN_SCR_UPCL                *((volatile unsigned int*)(0x4270603CUL))
#define bFM0P_MFS3_LIN_ESCR_DEL0               *((volatile unsigned int*)(0x42706080UL))
#define bFM0P_MFS3_LIN_ESCR_DEL1               *((volatile unsigned int*)(0x42706084UL))
#define bFM0P_MFS3_LIN_ESCR_LBL0               *((volatile unsigned int*)(0x42706088UL))
#define bFM0P_MFS3_LIN_ESCR_LBL1               *((volatile unsigned int*)(0x4270608CUL))
#define bFM0P_MFS3_LIN_ESCR_LBIE               *((volatile unsigned int*)(0x42706090UL))
#define bFM0P_MFS3_LIN_ESCR_ESBL               *((volatile unsigned int*)(0x42706098UL))
#define bFM0P_MFS3_LIN_SSR_TBI                 *((volatile unsigned int*)(0x427060A0UL))
#define bFM0P_MFS3_LIN_SSR_TDRE                *((volatile unsigned int*)(0x427060A4UL))
#define bFM0P_MFS3_LIN_SSR_RDRF                *((volatile unsigned int*)(0x427060A8UL))
#define bFM0P_MFS3_LIN_SSR_ORE                 *((volatile unsigned int*)(0x427060ACUL))
#define bFM0P_MFS3_LIN_SSR_FRE                 *((volatile unsigned int*)(0x427060B0UL))
#define bFM0P_MFS3_LIN_SSR_LBD                 *((volatile unsigned int*)(0x427060B4UL))
#define bFM0P_MFS3_LIN_SSR_REC                 *((volatile unsigned int*)(0x427060BCUL))
#define bFM0P_MFS3_LIN_BGR_BGR00               *((volatile unsigned int*)(0x42706180UL))
#define bFM0P_MFS3_LIN_BGR_BGR01               *((volatile unsigned int*)(0x42706184UL))
#define bFM0P_MFS3_LIN_BGR_BGR02               *((volatile unsigned int*)(0x42706188UL))
#define bFM0P_MFS3_LIN_BGR_BGR03               *((volatile unsigned int*)(0x4270618CUL))
#define bFM0P_MFS3_LIN_BGR_BGR04               *((volatile unsigned int*)(0x42706190UL))
#define bFM0P_MFS3_LIN_BGR_BGR05               *((volatile unsigned int*)(0x42706194UL))
#define bFM0P_MFS3_LIN_BGR_BGR06               *((volatile unsigned int*)(0x42706198UL))
#define bFM0P_MFS3_LIN_BGR_BGR07               *((volatile unsigned int*)(0x4270619CUL))
#define bFM0P_MFS3_LIN_BGR_BGR10               *((volatile unsigned int*)(0x427061A0UL))
#define bFM0P_MFS3_LIN_BGR_BGR11               *((volatile unsigned int*)(0x427061A4UL))
#define bFM0P_MFS3_LIN_BGR_BGR12               *((volatile unsigned int*)(0x427061A8UL))
#define bFM0P_MFS3_LIN_BGR_BGR13               *((volatile unsigned int*)(0x427061ACUL))
#define bFM0P_MFS3_LIN_BGR_BGR14               *((volatile unsigned int*)(0x427061B0UL))
#define bFM0P_MFS3_LIN_BGR_BGR15               *((volatile unsigned int*)(0x427061B4UL))
#define bFM0P_MFS3_LIN_BGR_BGR16               *((volatile unsigned int*)(0x427061B8UL))
#define bFM0P_MFS3_LIN_BGR_EXT                 *((volatile unsigned int*)(0x427061BCUL))
#define bFM0P_MFS3_LIN_FCR0_FE1                *((volatile unsigned int*)(0x42706280UL))
#define bFM0P_MFS3_LIN_FCR0_FE2                *((volatile unsigned int*)(0x42706284UL))
#define bFM0P_MFS3_LIN_FCR0_FCL1               *((volatile unsigned int*)(0x42706288UL))
#define bFM0P_MFS3_LIN_FCR0_FCL2               *((volatile unsigned int*)(0x4270628CUL))
#define bFM0P_MFS3_LIN_FCR0_FSET               *((volatile unsigned int*)(0x42706290UL))
#define bFM0P_MFS3_LIN_FCR0_FLD                *((volatile unsigned int*)(0x42706294UL))
#define bFM0P_MFS3_LIN_FCR0_FLST               *((volatile unsigned int*)(0x42706298UL))
#define bFM0P_MFS3_LIN_FCR1_FSEL               *((volatile unsigned int*)(0x427062A0UL))
#define bFM0P_MFS3_LIN_FCR1_FTIE               *((volatile unsigned int*)(0x427062A4UL))
#define bFM0P_MFS3_LIN_FCR1_FDRQ               *((volatile unsigned int*)(0x427062A8UL))
#define bFM0P_MFS3_LIN_FCR1_FRIIE              *((volatile unsigned int*)(0x427062ACUL))
#define bFM0P_MFS3_LIN_FCR1_FLSTE              *((volatile unsigned int*)(0x427062B0UL))

