furjie/Single-BLDC-driver-and-app/s6e1a1.h
/* MFS3 I2C channel 3 register */
#define bFM0P_MFS3_I2C_SMR_TIE                 *((volatile unsigned int*)(0x42706008UL))
#define bFM0P_MFS3_I2C_SMR_RIE                 *((volatile unsigned int*)(0x4270600CUL))
#define bFM0P_MFS3_I2C_SMR_MD0                 *((volatile unsigned int*)(0x42706014UL))
#define bFM0P_MFS3_I2C_SMR_MD1                 *((volatile unsigned int*)(0x42706018UL))
#define bFM0P_MFS3_I2C_SMR_MD2                 *((volatile unsigned int*)(0x4270601CUL))
#define bFM0P_MFS3_I2C_IBCR_INT                *((volatile unsigned int*)(0x42706020UL))
#define bFM0P_MFS3_I2C_IBCR_BER                *((volatile unsigned int*)(0x42706024UL))
#define bFM0P_MFS3_I2C_IBCR_INTE               *((volatile unsigned int*)(0x42706028UL))
#define bFM0P_MFS3_I2C_IBCR_CNDE               *((volatile unsigned int*)(0x4270602CUL))
#define bFM0P_MFS3_I2C_IBCR_WSEL               *((volatile unsigned int*)(0x42706030UL))
#define bFM0P_MFS3_I2C_IBCR_ACKE               *((volatile unsigned int*)(0x42706034UL))
#define bFM0P_MFS3_I2C_IBCR_ACT_SCC            *((volatile unsigned int*)(0x42706038UL))
#define bFM0P_MFS3_I2C_IBCR_MSS                *((volatile unsigned int*)(0x4270603CUL))
#define bFM0P_MFS3_I2C_IBSR_BB                 *((volatile unsigned int*)(0x42706080UL))
#define bFM0P_MFS3_I2C_IBSR_SPC                *((volatile unsigned int*)(0x42706084UL))
#define bFM0P_MFS3_I2C_IBSR_RSC                *((volatile unsigned int*)(0x42706088UL))
#define bFM0P_MFS3_I2C_IBSR_AL                 *((volatile unsigned int*)(0x4270608CUL))
#define bFM0P_MFS3_I2C_IBSR_TRX                *((volatile unsigned int*)(0x42706090UL))
#define bFM0P_MFS3_I2C_IBSR_RSA                *((volatile unsigned int*)(0x42706094UL))
#define bFM0P_MFS3_I2C_IBSR_RACK               *((volatile unsigned int*)(0x42706098UL))
#define bFM0P_MFS3_I2C_IBSR_FBT                *((volatile unsigned int*)(0x4270609CUL))
#define bFM0P_MFS3_I2C_SSR_TBI                 *((volatile unsigned int*)(0x427060A0UL))
#define bFM0P_MFS3_I2C_SSR_TDRE                *((volatile unsigned int*)(0x427060A4UL))
#define bFM0P_MFS3_I2C_SSR_RDRF                *((volatile unsigned int*)(0x427060A8UL))
#define bFM0P_MFS3_I2C_SSR_ORE                 *((volatile unsigned int*)(0x427060ACUL))
#define bFM0P_MFS3_I2C_SSR_TBIE                *((volatile unsigned int*)(0x427060B0UL))
#define bFM0P_MFS3_I2C_SSR_DMA                 *((volatile unsigned int*)(0x427060B4UL))
#define bFM0P_MFS3_I2C_SSR_TSET                *((volatile unsigned int*)(0x427060B8UL))
#define bFM0P_MFS3_I2C_SSR_REC                 *((volatile unsigned int*)(0x427060BCUL))
#define bFM0P_MFS3_I2C_BGR_BGR00               *((volatile unsigned int*)(0x42706180UL))
#define bFM0P_MFS3_I2C_BGR_BGR01               *((volatile unsigned int*)(0x42706184UL))
#define bFM0P_MFS3_I2C_BGR_BGR02               *((volatile unsigned int*)(0x42706188UL))
#define bFM0P_MFS3_I2C_BGR_BGR03               *((volatile unsigned int*)(0x4270618CUL))
#define bFM0P_MFS3_I2C_BGR_BGR04               *((volatile unsigned int*)(0x42706190UL))
#define bFM0P_MFS3_I2C_BGR_BGR05               *((volatile unsigned int*)(0x42706194UL))
#define bFM0P_MFS3_I2C_BGR_BGR06               *((volatile unsigned int*)(0x42706198UL))
#define bFM0P_MFS3_I2C_BGR_BGR07               *((volatile unsigned int*)(0x4270619CUL))
#define bFM0P_MFS3_I2C_BGR_BGR10               *((volatile unsigned int*)(0x427061A0UL))
#define bFM0P_MFS3_I2C_BGR_BGR11               *((volatile unsigned int*)(0x427061A4UL))
#define bFM0P_MFS3_I2C_BGR_BGR12               *((volatile unsigned int*)(0x427061A8UL))
#define bFM0P_MFS3_I2C_BGR_BGR13               *((volatile unsigned int*)(0x427061ACUL))
#define bFM0P_MFS3_I2C_BGR_BGR14               *((volatile unsigned int*)(0x427061B0UL))
#define bFM0P_MFS3_I2C_BGR_BGR15               *((volatile unsigned int*)(0x427061B4UL))
#define bFM0P_MFS3_I2C_BGR_BGR16               *((volatile unsigned int*)(0x427061B8UL))
#define bFM0P_MFS3_I2C_ISBA_SA0                *((volatile unsigned int*)(0x42706200UL))
#define bFM0P_MFS3_I2C_ISBA_SA1                *((volatile unsigned int*)(0x42706204UL))
#define bFM0P_MFS3_I2C_ISBA_SA2                *((volatile unsigned int*)(0x42706208UL))
#define bFM0P_MFS3_I2C_ISBA_SA3                *((volatile unsigned int*)(0x4270620CUL))
#define bFM0P_MFS3_I2C_ISBA_SA4                *((volatile unsigned int*)(0x42706210UL))
#define bFM0P_MFS3_I2C_ISBA_SA5                *((volatile unsigned int*)(0x42706214UL))
#define bFM0P_MFS3_I2C_ISBA_SA6                *((volatile unsigned int*)(0x42706218UL))
#define bFM0P_MFS3_I2C_ISBA_SAEN               *((volatile unsigned int*)(0x4270621CUL))
#define bFM0P_MFS3_I2C_ISMK_SM0                *((volatile unsigned int*)(0x42706220UL))
#define bFM0P_MFS3_I2C_ISMK_SM1                *((volatile unsigned int*)(0x42706224UL))
#define bFM0P_MFS3_I2C_ISMK_SM2                *((volatile unsigned int*)(0x42706228UL))
#define bFM0P_MFS3_I2C_ISMK_SM3                *((volatile unsigned int*)(0x4270622CUL))
#define bFM0P_MFS3_I2C_ISMK_SM4                *((volatile unsigned int*)(0x42706230UL))
#define bFM0P_MFS3_I2C_ISMK_SM5                *((volatile unsigned int*)(0x42706234UL))
#define bFM0P_MFS3_I2C_ISMK_SM6                *((volatile unsigned int*)(0x42706238UL))
#define bFM0P_MFS3_I2C_ISMK_EN                 *((volatile unsigned int*)(0x4270623CUL))
#define bFM0P_MFS3_I2C_FCR0_FE1                *((volatile unsigned int*)(0x42706280UL))
#define bFM0P_MFS3_I2C_FCR0_FE2                *((volatile unsigned int*)(0x42706284UL))
#define bFM0P_MFS3_I2C_FCR0_FCL1               *((volatile unsigned int*)(0x42706288UL))
#define bFM0P_MFS3_I2C_FCR0_FCL2               *((volatile unsigned int*)(0x4270628CUL))
#define bFM0P_MFS3_I2C_FCR0_FSET               *((volatile unsigned int*)(0x42706290UL))
#define bFM0P_MFS3_I2C_FCR0_FLD                *((volatile unsigned int*)(0x42706294UL))
#define bFM0P_MFS3_I2C_FCR0_FLST               *((volatile unsigned int*)(0x42706298UL))
#define bFM0P_MFS3_I2C_FCR1_FSEL               *((volatile unsigned int*)(0x427062A0UL))
#define bFM0P_MFS3_I2C_FCR1_FTIE               *((volatile unsigned int*)(0x427062A4UL))
#define bFM0P_MFS3_I2C_FCR1_FDRQ               *((volatile unsigned int*)(0x427062A8UL))
#define bFM0P_MFS3_I2C_FCR1_FRIIE              *((volatile unsigned int*)(0x427062ACUL))
#define bFM0P_MFS3_I2C_FCR1_FLSTE              *((volatile unsigned int*)(0x427062B0UL))
#define bFM0P_MFS3_I2C_EIBCR_BEC               *((volatile unsigned int*)(0x427063A0UL))
#define bFM0P_MFS3_I2C_EIBCR_SOCE              *((volatile unsigned int*)(0x427063A4UL))
#define bFM0P_MFS3_I2C_EIBCR_SCLC              *((volatile unsigned int*)(0x427063A8UL))
#define bFM0P_MFS3_I2C_EIBCR_SDAC              *((volatile unsigned int*)(0x427063ACUL))
#define bFM0P_MFS3_I2C_EIBCR_SCLS              *((volatile unsigned int*)(0x427063B0UL))
#define bFM0P_MFS3_I2C_EIBCR_SDAS              *((volatile unsigned int*)(0x427063B4UL))

/* CRC registers */
#define bFM0P_CRC_CRCCR_INIT                   *((volatile unsigned int*)(0x42720000UL))
#define bFM0P_CRC_CRCCR_CRC32                  *((volatile unsigned int*)(0x42720004UL))
#define bFM0P_CRC_CRCCR_LTLEND                 *((volatile unsigned int*)(0x42720008UL))
#define bFM0P_CRC_CRCCR_LSBFST                 *((volatile unsigned int*)(0x4272000CUL))
#define bFM0P_CRC_CRCCR_CRCLTE                 *((volatile unsigned int*)(0x42720010UL))
#define bFM0P_CRC_CRCCR_CRCLSF                 *((volatile unsigned int*)(0x42720014UL))
#define bFM0P_CRC_CRCCR_FXOR                   *((volatile unsigned int*)(0x42720018UL))
#define bFM0P_CRC_CRCINIT_D0                   *((volatile unsigned int*)(0x42720080UL))
#define bFM0P_CRC_CRCINIT_D1                   *((volatile unsigned int*)(0x42720084UL))
#define bFM0P_CRC_CRCINIT_D2                   *((volatile unsigned int*)(0x42720088UL))
#define bFM0P_CRC_CRCINIT_D3                   *((volatile unsigned int*)(0x4272008CUL))
#define bFM0P_CRC_CRCINIT_D4                   *((volatile unsigned int*)(0x42720090UL))
#define bFM0P_CRC_CRCINIT_D5                   *((volatile unsigned int*)(0x42720094UL))
#define bFM0P_CRC_CRCINIT_D6                   *((volatile unsigned int*)(0x42720098UL))
#define bFM0P_CRC_CRCINIT_D7                   *((volatile unsigned int*)(0x4272009CUL))
#define bFM0P_CRC_CRCINIT_D8                   *((volatile unsigned int*)(0x427200A0UL))
#define bFM0P_CRC_CRCINIT_D9                   *((volatile unsigned int*)(0x427200A4UL))
#define bFM0P_CRC_CRCINIT_D10                  *((volatile unsigned int*)(0x427200A8UL))
#define bFM0P_CRC_CRCINIT_D11                  *((volatile unsigned int*)(0x427200ACUL))
#define bFM0P_CRC_CRCINIT_D12                  *((volatile unsigned int*)(0x427200B0UL))
#define bFM0P_CRC_CRCINIT_D13                  *((volatile unsigned int*)(0x427200B4UL))
#define bFM0P_CRC_CRCINIT_D14                  *((volatile unsigned int*)(0x427200B8UL))
#define bFM0P_CRC_CRCINIT_D15                  *((volatile unsigned int*)(0x427200BCUL))
#define bFM0P_CRC_CRCINIT_D16                  *((volatile unsigned int*)(0x427200C0UL))
#define bFM0P_CRC_CRCINIT_D17                  *((volatile unsigned int*)(0x427200C4UL))
#define bFM0P_CRC_CRCINIT_D18                  *((volatile unsigned int*)(0x427200C8UL))
#define bFM0P_CRC_CRCINIT_D19                  *((volatile unsigned int*)(0x427200CCUL))
#define bFM0P_CRC_CRCINIT_D20                  *((volatile unsigned int*)(0x427200D0UL))
#define bFM0P_CRC_CRCINIT_D21                  *((volatile unsigned int*)(0x427200D4UL))
#define bFM0P_CRC_CRCINIT_D22                  *((volatile unsigned int*)(0x427200D8UL))
#define bFM0P_CRC_CRCINIT_D23                  *((volatile unsigned int*)(0x427200DCUL))
#define bFM0P_CRC_CRCINIT_D24                  *((volatile unsigned int*)(0x427200E0UL))
#define bFM0P_CRC_CRCINIT_D25                  *((volatile unsigned int*)(0x427200E4UL))
#define bFM0P_CRC_CRCINIT_D26                  *((volatile unsigned int*)(0x427200E8UL))
#define bFM0P_CRC_CRCINIT_D27                  *((volatile unsigned int*)(0x427200ECUL))
#define bFM0P_CRC_CRCINIT_D28                  *((volatile unsigned int*)(0x427200F0UL))
#define bFM0P_CRC_CRCINIT_D29                  *((volatile unsigned int*)(0x427200F4UL))
#define bFM0P_CRC_CRCINIT_D30                  *((volatile unsigned int*)(0x427200F8UL))
#define bFM0P_CRC_CRCINIT_D31                  *((volatile unsigned int*)(0x427200FCUL))
#define bFM0P_CRC_CRCIN_D0                     *((volatile unsigned int*)(0x42720100UL))
#define bFM0P_CRC_CRCIN_D1                     *((volatile unsigned int*)(0x42720104UL))
#define bFM0P_CRC_CRCIN_D2                     *((volatile unsigned int*)(0x42720108UL))
#define bFM0P_CRC_CRCIN_D3                     *((volatile unsigned int*)(0x4272010CUL))
#define bFM0P_CRC_CRCIN_D4                     *((volatile unsigned int*)(0x42720110UL))
#define bFM0P_CRC_CRCIN_D5                     *((volatile unsigned int*)(0x42720114UL))
#define bFM0P_CRC_CRCIN_D6                     *((volatile unsigned int*)(0x42720118UL))
#define bFM0P_CRC_CRCIN_D7                     *((volatile unsigned int*)(0x4272011CUL))
#define bFM0P_CRC_CRCIN_D8                     *((volatile unsigned int*)(0x42720120UL))
#define bFM0P_CRC_CRCIN_D9                     *((volatile unsigned int*)(0x42720124UL))
#define bFM0P_CRC_CRCIN_D10                    *((volatile unsigned int*)(0x42720128UL))
#define bFM0P_CRC_CRCIN_D11                    *((volatile unsigned int*)(0x4272012CUL))
#define bFM0P_CRC_CRCIN_D12                    *((volatile unsigned int*)(0x42720130UL))
#define bFM0P_CRC_CRCIN_D13                    *((volatile unsigned int*)(0x42720134UL))
#define bFM0P_CRC_CRCIN_D14                    *((volatile unsigned int*)(0x42720138UL))
#define bFM0P_CRC_CRCIN_D15                    *((volatile unsigned int*)(0x4272013CUL))
#define bFM0P_CRC_CRCIN_D16                    *((volatile unsigned int*)(0x42720140UL))
#define bFM0P_CRC_CRCIN_D17                    *((volatile unsigned int*)(0x42720144UL))
#define bFM0P_CRC_CRCIN_D18                    *((volatile unsigned int*)(0x42720148UL))
#define bFM0P_CRC_CRCIN_D19                    *((volatile unsigned int*)(0x4272014CUL))
#define bFM0P_CRC_CRCIN_D20                    *((volatile unsigned int*)(0x42720150UL))
#define bFM0P_CRC_CRCIN_D21                    *((volatile unsigned int*)(0x42720154UL))
#define bFM0P_CRC_CRCIN_D22                    *((volatile unsigned int*)(0x42720158UL))
#define bFM0P_CRC_CRCIN_D23                    *((volatile unsigned int*)(0x4272015CUL))
#define bFM0P_CRC_CRCIN_D24                    *((volatile unsigned int*)(0x42720160UL))
#define bFM0P_CRC_CRCIN_D25                    *((volatile unsigned int*)(0x42720164UL))
#define bFM0P_CRC_CRCIN_D26                    *((volatile unsigned int*)(0x42720168UL))
#define bFM0P_CRC_CRCIN_D27                    *((volatile unsigned int*)(0x4272016CUL))
#define bFM0P_CRC_CRCIN_D28                    *((volatile unsigned int*)(0x42720170UL))
#define bFM0P_CRC_CRCIN_D29                    *((volatile unsigned int*)(0x42720174UL))
#define bFM0P_CRC_CRCIN_D30                    *((volatile unsigned int*)(0x42720178UL))
#define bFM0P_CRC_CRCIN_D31                    *((volatile unsigned int*)(0x4272017CUL))
#define bFM0P_CRC_CRCR_D0                      *((volatile unsigned int*)(0x42720180UL))
#define bFM0P_CRC_CRCR_D1                      *((volatile unsigned int*)(0x42720184UL))
#define bFM0P_CRC_CRCR_D2                      *((volatile unsigned int*)(0x42720188UL))
#define bFM0P_CRC_CRCR_D3                      *((volatile unsigned int*)(0x4272018CUL))
#define bFM0P_CRC_CRCR_D4                      *((volatile unsigned int*)(0x42720190UL))
#define bFM0P_CRC_CRCR_D5                      *((volatile unsigned int*)(0x42720194UL))
#define bFM0P_CRC_CRCR_D6                      *((volatile unsigned int*)(0x42720198UL))
#define bFM0P_CRC_CRCR_D7                      *((volatile unsigned int*)(0x4272019CUL))
#define bFM0P_CRC_CRCR_D8                      *((volatile unsigned int*)(0x427201A0UL))
#define bFM0P_CRC_CRCR_D9                      *((volatile unsigned int*)(0x427201A4UL))
#define bFM0P_CRC_CRCR_D10                     *((volatile unsigned int*)(0x427201A8UL))
#define bFM0P_CRC_CRCR_D11                     *((volatile unsigned int*)(0x427201ACUL))
#define bFM0P_CRC_CRCR_D12                     *((volatile unsigned int*)(0x427201B0UL))
#define bFM0P_CRC_CRCR_D13                     *((volatile unsigned int*)(0x427201B4UL))
#define bFM0P_CRC_CRCR_D14                     *((volatile unsigned int*)(0x427201B8UL))
#define bFM0P_CRC_CRCR_D15                     *((volatile unsigned int*)(0x427201BCUL))
#define bFM0P_CRC_CRCR_D16                     *((volatile unsigned int*)(0x427201C0UL))
#define bFM0P_CRC_CRCR_D17                     *((volatile unsigned int*)(0x427201C4UL))
#define bFM0P_CRC_CRCR_D18                     *((volatile unsigned int*)(0x427201C8UL))
#define bFM0P_CRC_CRCR_D19                     *((volatile unsigned int*)(0x427201CCUL))
#define bFM0P_CRC_CRCR_D20                     *((volatile unsigned int*)(0x427201D0UL))
#define bFM0P_CRC_CRCR_D21                     *((volatile unsigned int*)(0x427201D4UL))
#define bFM0P_CRC_CRCR_D22                     *((volatile unsigned int*)(0x427201D8UL))
#define bFM0P_CRC_CRCR_D23                     *((volatile unsigned int*)(0x427201DCUL))
#define bFM0P_CRC_CRCR_D24                     *((volatile unsigned int*)(0x427201E0UL))
#define bFM0P_CRC_CRCR_D25                     *((volatile unsigned int*)(0x427201E4UL))
#define bFM0P_CRC_CRCR_D26                     *((volatile unsigned int*)(0x427201E8UL))
#define bFM0P_CRC_CRCR_D27                     *((volatile unsigned int*)(0x427201ECUL))
#define bFM0P_CRC_CRCR_D28                     *((volatile unsigned int*)(0x427201F0UL))
#define bFM0P_CRC_CRCR_D29                     *((volatile unsigned int*)(0x427201F4UL))
#define bFM0P_CRC_CRCR_D30                     *((volatile unsigned int*)(0x427201F8UL))
#define bFM0P_CRC_CRCR_D31                     *((volatile unsigned int*)(0x427201FCUL))

