furjie/Single-BLDC-driver-and-app/s6e1a1.h
/* Watch counter registers */
#define bFM0P_WC_WCRD_CTR0                     *((volatile unsigned int*)(0x42740000UL))
#define bFM0P_WC_WCRD_CTR1                     *((volatile unsigned int*)(0x42740004UL))
#define bFM0P_WC_WCRD_CTR2                     *((volatile unsigned int*)(0x42740008UL))
#define bFM0P_WC_WCRD_CTR3                     *((volatile unsigned int*)(0x4274000CUL))
#define bFM0P_WC_WCRD_CTR4                     *((volatile unsigned int*)(0x42740010UL))
#define bFM0P_WC_WCRD_CTR5                     *((volatile unsigned int*)(0x42740014UL))
#define bFM0P_WC_WCRL_RLC0                     *((volatile unsigned int*)(0x42740020UL))
#define bFM0P_WC_WCRL_RLC1                     *((volatile unsigned int*)(0x42740024UL))
#define bFM0P_WC_WCRL_RLC2                     *((volatile unsigned int*)(0x42740028UL))
#define bFM0P_WC_WCRL_RLC3                     *((volatile unsigned int*)(0x4274002CUL))
#define bFM0P_WC_WCRL_RLC4                     *((volatile unsigned int*)(0x42740030UL))
#define bFM0P_WC_WCRL_RLC5                     *((volatile unsigned int*)(0x42740034UL))
#define bFM0P_WC_WCCR_WCIF                     *((volatile unsigned int*)(0x42740040UL))
#define bFM0P_WC_WCCR_WCIE                     *((volatile unsigned int*)(0x42740044UL))
#define bFM0P_WC_WCCR_CS0                      *((volatile unsigned int*)(0x42740048UL))
#define bFM0P_WC_WCCR_CS1                      *((volatile unsigned int*)(0x4274004CUL))
#define bFM0P_WC_WCCR_WCOP                     *((volatile unsigned int*)(0x42740058UL))
#define bFM0P_WC_WCCR_WCEN                     *((volatile unsigned int*)(0x4274005CUL))
#define bFM0P_WC_CLK_SEL_SEL_IN0               *((volatile unsigned int*)(0x42740200UL))
#define bFM0P_WC_CLK_SEL_SEL_IN1               *((volatile unsigned int*)(0x42740204UL))
#define bFM0P_WC_CLK_SEL_SEL_OUT0              *((volatile unsigned int*)(0x42740220UL))
#define bFM0P_WC_CLK_SEL_SEL_OUT1              *((volatile unsigned int*)(0x42740224UL))
#define bFM0P_WC_CLK_SEL_SEL_OUT2              *((volatile unsigned int*)(0x42740228UL))
#define bFM0P_WC_CLK_EN_CLK_EN                 *((volatile unsigned int*)(0x42740280UL))
#define bFM0P_WC_CLK_EN_CLK_EN_R               *((volatile unsigned int*)(0x42740284UL))

/* Realtime clock registers */
#define bFM0P_RTC_WTCR1_ST                     *((volatile unsigned int*)(0x42760000UL))
#define bFM0P_RTC_WTCR1_RUN                    *((volatile unsigned int*)(0x42760008UL))
#define bFM0P_RTC_WTCR1_SRST                   *((volatile unsigned int*)(0x4276000CUL))
#define bFM0P_RTC_WTCR1_SCST                   *((volatile unsigned int*)(0x42760010UL))
#define bFM0P_RTC_WTCR1_SCRST                  *((volatile unsigned int*)(0x42760014UL))
#define bFM0P_RTC_WTCR1_BUSY                   *((volatile unsigned int*)(0x42760018UL))
#define bFM0P_RTC_WTCR1_MIEN                   *((volatile unsigned int*)(0x42760020UL))
#define bFM0P_RTC_WTCR1_HEN                    *((volatile unsigned int*)(0x42760024UL))
#define bFM0P_RTC_WTCR1_DEN                    *((volatile unsigned int*)(0x42760028UL))
#define bFM0P_RTC_WTCR1_MOEN                   *((volatile unsigned int*)(0x4276002CUL))
#define bFM0P_RTC_WTCR1_YEN                    *((volatile unsigned int*)(0x42760030UL))
#define bFM0P_RTC_WTCR1_INTSSI                 *((volatile unsigned int*)(0x42760040UL))
#define bFM0P_RTC_WTCR1_INTSI                  *((volatile unsigned int*)(0x42760044UL))
#define bFM0P_RTC_WTCR1_INTMI                  *((volatile unsigned int*)(0x42760048UL))
#define bFM0P_RTC_WTCR1_INTHI                  *((volatile unsigned int*)(0x4276004CUL))
#define bFM0P_RTC_WTCR1_INTTMI                 *((volatile unsigned int*)(0x42760050UL))
#define bFM0P_RTC_WTCR1_INTALI                 *((volatile unsigned int*)(0x42760054UL))
#define bFM0P_RTC_WTCR1_INTERI                 *((volatile unsigned int*)(0x42760058UL))
#define bFM0P_RTC_WTCR1_INTCRI                 *((volatile unsigned int*)(0x4276005CUL))
#define bFM0P_RTC_WTCR1_INTSSIE                *((volatile unsigned int*)(0x42760060UL))
#define bFM0P_RTC_WTCR1_INTSIE                 *((volatile unsigned int*)(0x42760064UL))
#define bFM0P_RTC_WTCR1_INTMIE                 *((volatile unsigned int*)(0x42760068UL))
#define bFM0P_RTC_WTCR1_INTHIE                 *((volatile unsigned int*)(0x4276006CUL))
#define bFM0P_RTC_WTCR1_INTTMIE                *((volatile unsigned int*)(0x42760070UL))
#define bFM0P_RTC_WTCR1_INTALIE                *((volatile unsigned int*)(0x42760074UL))
#define bFM0P_RTC_WTCR1_INTERIE                *((volatile unsigned int*)(0x42760078UL))
#define bFM0P_RTC_WTCR1_INTCRIE                *((volatile unsigned int*)(0x4276007CUL))
#define bFM0P_RTC_WTCR2_CREAD                  *((volatile unsigned int*)(0x42760080UL))
#define bFM0P_RTC_WTCR2_TMST                   *((volatile unsigned int*)(0x427600A0UL))
#define bFM0P_RTC_WTCR2_TMEN                   *((volatile unsigned int*)(0x427600A4UL))
#define bFM0P_RTC_WTCR2_TMRUN                  *((volatile unsigned int*)(0x427600A8UL))
#define bFM0P_RTC_WTBR_BR0                     *((volatile unsigned int*)(0x42760100UL))
#define bFM0P_RTC_WTBR_BR1                     *((volatile unsigned int*)(0x42760104UL))
#define bFM0P_RTC_WTBR_BR2                     *((volatile unsigned int*)(0x42760108UL))
#define bFM0P_RTC_WTBR_BR3                     *((volatile unsigned int*)(0x4276010CUL))
#define bFM0P_RTC_WTBR_BR4                     *((volatile unsigned int*)(0x42760110UL))
#define bFM0P_RTC_WTBR_BR5                     *((volatile unsigned int*)(0x42760114UL))
#define bFM0P_RTC_WTBR_BR6                     *((volatile unsigned int*)(0x42760118UL))
#define bFM0P_RTC_WTBR_BR7                     *((volatile unsigned int*)(0x4276011CUL))
#define bFM0P_RTC_WTBR_BR8                     *((volatile unsigned int*)(0x42760120UL))
#define bFM0P_RTC_WTBR_BR9                     *((volatile unsigned int*)(0x42760124UL))
#define bFM0P_RTC_WTBR_BR10                    *((volatile unsigned int*)(0x42760128UL))
#define bFM0P_RTC_WTBR_BR11                    *((volatile unsigned int*)(0x4276012CUL))
#define bFM0P_RTC_WTBR_BR12                    *((volatile unsigned int*)(0x42760130UL))
#define bFM0P_RTC_WTBR_BR13                    *((volatile unsigned int*)(0x42760134UL))
#define bFM0P_RTC_WTBR_BR14                    *((volatile unsigned int*)(0x42760138UL))
#define bFM0P_RTC_WTBR_BR15                    *((volatile unsigned int*)(0x4276013CUL))
#define bFM0P_RTC_WTBR_BR16                    *((volatile unsigned int*)(0x42760140UL))
#define bFM0P_RTC_WTBR_BR17                    *((volatile unsigned int*)(0x42760144UL))
#define bFM0P_RTC_WTBR_BR18                    *((volatile unsigned int*)(0x42760148UL))
#define bFM0P_RTC_WTBR_BR19                    *((volatile unsigned int*)(0x4276014CUL))
#define bFM0P_RTC_WTBR_BR20                    *((volatile unsigned int*)(0x42760150UL))
#define bFM0P_RTC_WTBR_BR21                    *((volatile unsigned int*)(0x42760154UL))
#define bFM0P_RTC_WTBR_BR22                    *((volatile unsigned int*)(0x42760158UL))
#define bFM0P_RTC_WTBR_BR23                    *((volatile unsigned int*)(0x4276015CUL))
#define bFM0P_RTC_WTSR_S0                      *((volatile unsigned int*)(0x42760180UL))
#define bFM0P_RTC_WTSR_S1                      *((volatile unsigned int*)(0x42760184UL))
#define bFM0P_RTC_WTSR_S2                      *((volatile unsigned int*)(0x42760188UL))
#define bFM0P_RTC_WTSR_S3                      *((volatile unsigned int*)(0x4276018CUL))
#define bFM0P_RTC_WTSR_TS0                     *((volatile unsigned int*)(0x42760190UL))
#define bFM0P_RTC_WTSR_TS1                     *((volatile unsigned int*)(0x42760194UL))
#define bFM0P_RTC_WTSR_TS2                     *((volatile unsigned int*)(0x42760198UL))
#define bFM0P_RTC_WTMIR_MI0                    *((volatile unsigned int*)(0x427601A0UL))
#define bFM0P_RTC_WTMIR_MI1                    *((volatile unsigned int*)(0x427601A4UL))
#define bFM0P_RTC_WTMIR_MI2                    *((volatile unsigned int*)(0x427601A8UL))
#define bFM0P_RTC_WTMIR_MI3                    *((volatile unsigned int*)(0x427601ACUL))
#define bFM0P_RTC_WTMIR_TMI0                   *((volatile unsigned int*)(0x427601B0UL))
#define bFM0P_RTC_WTMIR_TMI1                   *((volatile unsigned int*)(0x427601B4UL))
#define bFM0P_RTC_WTMIR_TMI2                   *((volatile unsigned int*)(0x427601B8UL))
#define bFM0P_RTC_WTHR_H0                      *((volatile unsigned int*)(0x427601C0UL))
#define bFM0P_RTC_WTHR_H1                      *((volatile unsigned int*)(0x427601C4UL))
#define bFM0P_RTC_WTHR_H2                      *((volatile unsigned int*)(0x427601C8UL))
#define bFM0P_RTC_WTHR_H3                      *((volatile unsigned int*)(0x427601CCUL))
#define bFM0P_RTC_WTHR_TH0                     *((volatile unsigned int*)(0x427601D0UL))
#define bFM0P_RTC_WTHR_TH1                     *((volatile unsigned int*)(0x427601D4UL))
#define bFM0P_RTC_WTDR_D0                      *((volatile unsigned int*)(0x427601E0UL))
#define bFM0P_RTC_WTDR_D1                      *((volatile unsigned int*)(0x427601E4UL))
#define bFM0P_RTC_WTDR_D2                      *((volatile unsigned int*)(0x427601E8UL))
#define bFM0P_RTC_WTDR_D3                      *((volatile unsigned int*)(0x427601ECUL))
#define bFM0P_RTC_WTDR_TD0                     *((volatile unsigned int*)(0x427601F0UL))
#define bFM0P_RTC_WTDR_TD1                     *((volatile unsigned int*)(0x427601F4UL))
#define bFM0P_RTC_WTDW_DW0                     *((volatile unsigned int*)(0x42760200UL))
#define bFM0P_RTC_WTDW_DW1                     *((volatile unsigned int*)(0x42760204UL))
#define bFM0P_RTC_WTDW_DW2                     *((volatile unsigned int*)(0x42760208UL))
#define bFM0P_RTC_WTMOR_MO0                    *((volatile unsigned int*)(0x42760220UL))
#define bFM0P_RTC_WTMOR_MO1                    *((volatile unsigned int*)(0x42760224UL))
#define bFM0P_RTC_WTMOR_MO2                    *((volatile unsigned int*)(0x42760228UL))
#define bFM0P_RTC_WTMOR_MO3                    *((volatile unsigned int*)(0x4276022CUL))
#define bFM0P_RTC_WTMOR_TMO                    *((volatile unsigned int*)(0x42760230UL))
#define bFM0P_RTC_WTYR_Y0                      *((volatile unsigned int*)(0x42760240UL))
#define bFM0P_RTC_WTYR_Y1                      *((volatile unsigned int*)(0x42760244UL))
#define bFM0P_RTC_WTYR_Y2                      *((volatile unsigned int*)(0x42760248UL))
#define bFM0P_RTC_WTYR_Y3                      *((volatile unsigned int*)(0x4276024CUL))
#define bFM0P_RTC_WTYR_TY0                     *((volatile unsigned int*)(0x42760250UL))
#define bFM0P_RTC_WTYR_TY1                     *((volatile unsigned int*)(0x42760254UL))
#define bFM0P_RTC_WTYR_TY2                     *((volatile unsigned int*)(0x42760258UL))
#define bFM0P_RTC_WTYR_TY3                     *((volatile unsigned int*)(0x4276025CUL))
#define bFM0P_RTC_ALMIR_AMI0                   *((volatile unsigned int*)(0x427602A0UL))
#define bFM0P_RTC_ALMIR_AMI1                   *((volatile unsigned int*)(0x427602A4UL))
#define bFM0P_RTC_ALMIR_AMI2                   *((volatile unsigned int*)(0x427602A8UL))
#define bFM0P_RTC_ALMIR_AMI3                   *((volatile unsigned int*)(0x427602ACUL))
#define bFM0P_RTC_ALMIR_TAMI0                  *((volatile unsigned int*)(0x427602B0UL))
#define bFM0P_RTC_ALMIR_TAMI1                  *((volatile unsigned int*)(0x427602B4UL))
#define bFM0P_RTC_ALMIR_TAMI2                  *((volatile unsigned int*)(0x427602B8UL))
#define bFM0P_RTC_ALHR_AH0                     *((volatile unsigned int*)(0x427602C0UL))
#define bFM0P_RTC_ALHR_AH1                     *((volatile unsigned int*)(0x427602C4UL))
#define bFM0P_RTC_ALHR_AH2                     *((volatile unsigned int*)(0x427602C8UL))
#define bFM0P_RTC_ALHR_AH3                     *((volatile unsigned int*)(0x427602CCUL))
#define bFM0P_RTC_ALHR_TAH0                    *((volatile unsigned int*)(0x427602D0UL))
#define bFM0P_RTC_ALHR_TAH1                    *((volatile unsigned int*)(0x427602D4UL))
#define bFM0P_RTC_ALDR_AD0                     *((volatile unsigned int*)(0x427602E0UL))
#define bFM0P_RTC_ALDR_AD1                     *((volatile unsigned int*)(0x427602E4UL))
#define bFM0P_RTC_ALDR_AD2                     *((volatile unsigned int*)(0x427602E8UL))
#define bFM0P_RTC_ALDR_AD3                     *((volatile unsigned int*)(0x427602ECUL))
#define bFM0P_RTC_ALDR_TAD0                    *((volatile unsigned int*)(0x427602F0UL))
#define bFM0P_RTC_ALDR_TAD1                    *((volatile unsigned int*)(0x427602F4UL))
#define bFM0P_RTC_ALMOR_AMO0                   *((volatile unsigned int*)(0x42760320UL))
#define bFM0P_RTC_ALMOR_AMO1                   *((volatile unsigned int*)(0x42760324UL))
#define bFM0P_RTC_ALMOR_AMO2                   *((volatile unsigned int*)(0x42760328UL))
#define bFM0P_RTC_ALMOR_AMO3                   *((volatile unsigned int*)(0x4276032CUL))
#define bFM0P_RTC_ALMOR_TAMO                   *((volatile unsigned int*)(0x42760330UL))
#define bFM0P_RTC_ALYR_AY0                     *((volatile unsigned int*)(0x42760340UL))
#define bFM0P_RTC_ALYR_AY1                     *((volatile unsigned int*)(0x42760344UL))
#define bFM0P_RTC_ALYR_AY2                     *((volatile unsigned int*)(0x42760348UL))
#define bFM0P_RTC_ALYR_AY3                     *((volatile unsigned int*)(0x4276034CUL))
#define bFM0P_RTC_ALYR_TAY0                    *((volatile unsigned int*)(0x42760350UL))
#define bFM0P_RTC_ALYR_TAY1                    *((volatile unsigned int*)(0x42760354UL))
#define bFM0P_RTC_ALYR_TAY2                    *((volatile unsigned int*)(0x42760358UL))
#define bFM0P_RTC_ALYR_TAY3                    *((volatile unsigned int*)(0x4276035CUL))
#define bFM0P_RTC_WTTR_TM0                     *((volatile unsigned int*)(0x42760380UL))
#define bFM0P_RTC_WTTR_TM1                     *((volatile unsigned int*)(0x42760384UL))
#define bFM0P_RTC_WTTR_TM2                     *((volatile unsigned int*)(0x42760388UL))
#define bFM0P_RTC_WTTR_TM3                     *((volatile unsigned int*)(0x4276038CUL))
#define bFM0P_RTC_WTTR_TM4                     *((volatile unsigned int*)(0x42760390UL))
#define bFM0P_RTC_WTTR_TM5                     *((volatile unsigned int*)(0x42760394UL))
#define bFM0P_RTC_WTTR_TM6                     *((volatile unsigned int*)(0x42760398UL))
#define bFM0P_RTC_WTTR_TM7                     *((volatile unsigned int*)(0x4276039CUL))
#define bFM0P_RTC_WTTR_TM8                     *((volatile unsigned int*)(0x427603A0UL))
#define bFM0P_RTC_WTTR_TM9                     *((volatile unsigned int*)(0x427603A4UL))
#define bFM0P_RTC_WTTR_TM10                    *((volatile unsigned int*)(0x427603A8UL))
#define bFM0P_RTC_WTTR_TM11                    *((volatile unsigned int*)(0x427603ACUL))
#define bFM0P_RTC_WTTR_TM12                    *((volatile unsigned int*)(0x427603B0UL))
#define bFM0P_RTC_WTTR_TM13                    *((volatile unsigned int*)(0x427603B4UL))
#define bFM0P_RTC_WTTR_TM14                    *((volatile unsigned int*)(0x427603B8UL))
#define bFM0P_RTC_WTTR_TM15                    *((volatile unsigned int*)(0x427603BCUL))
#define bFM0P_RTC_WTTR_TM16                    *((volatile unsigned int*)(0x427603C0UL))
#define bFM0P_RTC_WTTR_TM17                    *((volatile unsigned int*)(0x427603C4UL))
#define bFM0P_RTC_WTCLKS_WTCLKS                *((volatile unsigned int*)(0x42760400UL))
#define bFM0P_RTC_WTCLKM_WTCLKM0               *((volatile unsigned int*)(0x42760420UL))
#define bFM0P_RTC_WTCLKM_WTCLKM1               *((volatile unsigned int*)(0x42760424UL))
#define bFM0P_RTC_WTCAL_WTCAL0                 *((volatile unsigned int*)(0x42760480UL))
#define bFM0P_RTC_WTCAL_WTCAL1                 *((volatile unsigned int*)(0x42760484UL))
#define bFM0P_RTC_WTCAL_WTCAL2                 *((volatile unsigned int*)(0x42760488UL))
#define bFM0P_RTC_WTCAL_WTCAL3                 *((volatile unsigned int*)(0x4276048CUL))
#define bFM0P_RTC_WTCAL_WTCAL4                 *((volatile unsigned int*)(0x42760490UL))
#define bFM0P_RTC_WTCAL_WTCAL5                 *((volatile unsigned int*)(0x42760494UL))
#define bFM0P_RTC_WTCAL_WTCAL6                 *((volatile unsigned int*)(0x42760498UL))
#define bFM0P_RTC_WTCAL_WTCAL7                 *((volatile unsigned int*)(0x4276049CUL))
#define bFM0P_RTC_WTCAL_WTCAL8                 *((volatile unsigned int*)(0x427604A0UL))
#define bFM0P_RTC_WTCAL_WTCAL9                 *((volatile unsigned int*)(0x427604A4UL))
#define bFM0P_RTC_WTCALEN_WTCALEN              *((volatile unsigned int*)(0x427604C0UL))
#define bFM0P_RTC_WTDIV_WTDIV0                 *((volatile unsigned int*)(0x42760500UL))
#define bFM0P_RTC_WTDIV_WTDIV1                 *((volatile unsigned int*)(0x42760504UL))
#define bFM0P_RTC_WTDIV_WTDIV2                 *((volatile unsigned int*)(0x42760508UL))
#define bFM0P_RTC_WTDIV_WTDIV3                 *((volatile unsigned int*)(0x4276050CUL))
#define bFM0P_RTC_WTDIVEN_WTDIVEN              *((volatile unsigned int*)(0x42760520UL))
#define bFM0P_RTC_WTDIVEN_WTDIVRDY             *((volatile unsigned int*)(0x42760524UL))
#define bFM0P_RTC_WTCALPRD_WTCALPRD0           *((volatile unsigned int*)(0x42760580UL))
#define bFM0P_RTC_WTCALPRD_WTCALPRD1           *((volatile unsigned int*)(0x42760584UL))
#define bFM0P_RTC_WTCALPRD_WTCALPRD2           *((volatile unsigned int*)(0x42760588UL))
#define bFM0P_RTC_WTCALPRD_WTCALPRD3           *((volatile unsigned int*)(0x4276058CUL))
#define bFM0P_RTC_WTCALPRD_WTCALPRD4           *((volatile unsigned int*)(0x42760590UL))
#define bFM0P_RTC_WTCALPRD_WTCALPRD5           *((volatile unsigned int*)(0x42760594UL))
#define bFM0P_RTC_WTCOSEL_WTCOSEL              *((volatile unsigned int*)(0x42760600UL))

/* LSCRP registers */
#define bFM0P_LSCRP_LCR_PRSLD_LCR_PRSLD0       *((volatile unsigned int*)(0x42780000UL))
#define bFM0P_LSCRP_LCR_PRSLD_LCR_PRSLD1       *((volatile unsigned int*)(0x42780004UL))
#define bFM0P_LSCRP_LCR_PRSLD_LCR_PRSLD2       *((volatile unsigned int*)(0x42780008UL))
#define bFM0P_LSCRP_LCR_PRSLD_LCR_PRSLD3       *((volatile unsigned int*)(0x4278000CUL))
#define bFM0P_LSCRP_LCR_PRSLD_LCR_PRSLD4       *((volatile unsigned int*)(0x42780010UL))
#define bFM0P_LSCRP_LCR_PRSLD_LCR_PRSLD5       *((volatile unsigned int*)(0x42780014UL))

