furjie/Single-BLDC-driver-and-app/s6e1a1.h
#define bFM0P_DMAC_DMACB5_FS                   *((volatile unsigned int*)(0x42C00CE4UL))
#define bFM0P_DMAC_DMACB5_TW0                  *((volatile unsigned int*)(0x42C00CE8UL))
#define bFM0P_DMAC_DMACB5_TW1                  *((volatile unsigned int*)(0x42C00CECUL))
#define bFM0P_DMAC_DMACB5_MS0                  *((volatile unsigned int*)(0x42C00CF0UL))
#define bFM0P_DMAC_DMACB5_MS1                  *((volatile unsigned int*)(0x42C00CF4UL))
#define bFM0P_DMAC_DMACA6_TC0                  *((volatile unsigned int*)(0x42C00E00UL))
#define bFM0P_DMAC_DMACA6_TC1                  *((volatile unsigned int*)(0x42C00E04UL))
#define bFM0P_DMAC_DMACA6_TC2                  *((volatile unsigned int*)(0x42C00E08UL))
#define bFM0P_DMAC_DMACA6_TC3                  *((volatile unsigned int*)(0x42C00E0CUL))
#define bFM0P_DMAC_DMACA6_TC4                  *((volatile unsigned int*)(0x42C00E10UL))
#define bFM0P_DMAC_DMACA6_TC5                  *((volatile unsigned int*)(0x42C00E14UL))
#define bFM0P_DMAC_DMACA6_TC6                  *((volatile unsigned int*)(0x42C00E18UL))
#define bFM0P_DMAC_DMACA6_TC7                  *((volatile unsigned int*)(0x42C00E1CUL))
#define bFM0P_DMAC_DMACA6_TC8                  *((volatile unsigned int*)(0x42C00E20UL))
#define bFM0P_DMAC_DMACA6_TC9                  *((volatile unsigned int*)(0x42C00E24UL))
#define bFM0P_DMAC_DMACA6_TC10                 *((volatile unsigned int*)(0x42C00E28UL))
#define bFM0P_DMAC_DMACA6_TC11                 *((volatile unsigned int*)(0x42C00E2CUL))
#define bFM0P_DMAC_DMACA6_TC12                 *((volatile unsigned int*)(0x42C00E30UL))
#define bFM0P_DMAC_DMACA6_TC13                 *((volatile unsigned int*)(0x42C00E34UL))
#define bFM0P_DMAC_DMACA6_TC14                 *((volatile unsigned int*)(0x42C00E38UL))
#define bFM0P_DMAC_DMACA6_TC15                 *((volatile unsigned int*)(0x42C00E3CUL))
#define bFM0P_DMAC_DMACA6_BC0                  *((volatile unsigned int*)(0x42C00E40UL))
#define bFM0P_DMAC_DMACA6_BC1                  *((volatile unsigned int*)(0x42C00E44UL))
#define bFM0P_DMAC_DMACA6_BC2                  *((volatile unsigned int*)(0x42C00E48UL))
#define bFM0P_DMAC_DMACA6_BC3                  *((volatile unsigned int*)(0x42C00E4CUL))
#define bFM0P_DMAC_DMACA6_IS0                  *((volatile unsigned int*)(0x42C00E5CUL))
#define bFM0P_DMAC_DMACA6_IS1                  *((volatile unsigned int*)(0x42C00E60UL))
#define bFM0P_DMAC_DMACA6_IS2                  *((volatile unsigned int*)(0x42C00E64UL))
#define bFM0P_DMAC_DMACA6_IS3                  *((volatile unsigned int*)(0x42C00E68UL))
#define bFM0P_DMAC_DMACA6_IS4                  *((volatile unsigned int*)(0x42C00E6CUL))
#define bFM0P_DMAC_DMACA6_IS5                  *((volatile unsigned int*)(0x42C00E70UL))
#define bFM0P_DMAC_DMACA6_ST                   *((volatile unsigned int*)(0x42C00E74UL))
#define bFM0P_DMAC_DMACA6_PB                   *((volatile unsigned int*)(0x42C00E78UL))
#define bFM0P_DMAC_DMACA6_EB                   *((volatile unsigned int*)(0x42C00E7CUL))
#define bFM0P_DMAC_DMACB6_EM                   *((volatile unsigned int*)(0x42C00E80UL))
#define bFM0P_DMAC_DMACB6_SS0                  *((volatile unsigned int*)(0x42C00EC0UL))
#define bFM0P_DMAC_DMACB6_SS1                  *((volatile unsigned int*)(0x42C00EC4UL))
#define bFM0P_DMAC_DMACB6_SS2                  *((volatile unsigned int*)(0x42C00EC8UL))
#define bFM0P_DMAC_DMACB6_CI                   *((volatile unsigned int*)(0x42C00ECCUL))
#define bFM0P_DMAC_DMACB6_EI                   *((volatile unsigned int*)(0x42C00ED0UL))
#define bFM0P_DMAC_DMACB6_RD                   *((volatile unsigned int*)(0x42C00ED4UL))
#define bFM0P_DMAC_DMACB6_RS                   *((volatile unsigned int*)(0x42C00ED8UL))
#define bFM0P_DMAC_DMACB6_RC                   *((volatile unsigned int*)(0x42C00EDCUL))
#define bFM0P_DMAC_DMACB6_FD                   *((volatile unsigned int*)(0x42C00EE0UL))
#define bFM0P_DMAC_DMACB6_FS                   *((volatile unsigned int*)(0x42C00EE4UL))
#define bFM0P_DMAC_DMACB6_TW0                  *((volatile unsigned int*)(0x42C00EE8UL))
#define bFM0P_DMAC_DMACB6_TW1                  *((volatile unsigned int*)(0x42C00EECUL))
#define bFM0P_DMAC_DMACB6_MS0                  *((volatile unsigned int*)(0x42C00EF0UL))
#define bFM0P_DMAC_DMACB6_MS1                  *((volatile unsigned int*)(0x42C00EF4UL))
#define bFM0P_DMAC_DMACA7_TC0                  *((volatile unsigned int*)(0x42C01000UL))
#define bFM0P_DMAC_DMACA7_TC1                  *((volatile unsigned int*)(0x42C01004UL))
#define bFM0P_DMAC_DMACA7_TC2                  *((volatile unsigned int*)(0x42C01008UL))
#define bFM0P_DMAC_DMACA7_TC3                  *((volatile unsigned int*)(0x42C0100CUL))
#define bFM0P_DMAC_DMACA7_TC4                  *((volatile unsigned int*)(0x42C01010UL))
#define bFM0P_DMAC_DMACA7_TC5                  *((volatile unsigned int*)(0x42C01014UL))
#define bFM0P_DMAC_DMACA7_TC6                  *((volatile unsigned int*)(0x42C01018UL))
#define bFM0P_DMAC_DMACA7_TC7                  *((volatile unsigned int*)(0x42C0101CUL))
#define bFM0P_DMAC_DMACA7_TC8                  *((volatile unsigned int*)(0x42C01020UL))
#define bFM0P_DMAC_DMACA7_TC9                  *((volatile unsigned int*)(0x42C01024UL))
#define bFM0P_DMAC_DMACA7_TC10                 *((volatile unsigned int*)(0x42C01028UL))
#define bFM0P_DMAC_DMACA7_TC11                 *((volatile unsigned int*)(0x42C0102CUL))
#define bFM0P_DMAC_DMACA7_TC12                 *((volatile unsigned int*)(0x42C01030UL))
#define bFM0P_DMAC_DMACA7_TC13                 *((volatile unsigned int*)(0x42C01034UL))
#define bFM0P_DMAC_DMACA7_TC14                 *((volatile unsigned int*)(0x42C01038UL))
#define bFM0P_DMAC_DMACA7_TC15                 *((volatile unsigned int*)(0x42C0103CUL))
#define bFM0P_DMAC_DMACA7_BC0                  *((volatile unsigned int*)(0x42C01040UL))
#define bFM0P_DMAC_DMACA7_BC1                  *((volatile unsigned int*)(0x42C01044UL))
#define bFM0P_DMAC_DMACA7_BC2                  *((volatile unsigned int*)(0x42C01048UL))
#define bFM0P_DMAC_DMACA7_BC3                  *((volatile unsigned int*)(0x42C0104CUL))
#define bFM0P_DMAC_DMACA7_IS0                  *((volatile unsigned int*)(0x42C0105CUL))
#define bFM0P_DMAC_DMACA7_IS1                  *((volatile unsigned int*)(0x42C01060UL))
#define bFM0P_DMAC_DMACA7_IS2                  *((volatile unsigned int*)(0x42C01064UL))
#define bFM0P_DMAC_DMACA7_IS3                  *((volatile unsigned int*)(0x42C01068UL))
#define bFM0P_DMAC_DMACA7_IS4                  *((volatile unsigned int*)(0x42C0106CUL))
#define bFM0P_DMAC_DMACA7_IS5                  *((volatile unsigned int*)(0x42C01070UL))
#define bFM0P_DMAC_DMACA7_ST                   *((volatile unsigned int*)(0x42C01074UL))
#define bFM0P_DMAC_DMACA7_PB                   *((volatile unsigned int*)(0x42C01078UL))
#define bFM0P_DMAC_DMACA7_EB                   *((volatile unsigned int*)(0x42C0107CUL))
#define bFM0P_DMAC_DMACB7_EM                   *((volatile unsigned int*)(0x42C01080UL))
#define bFM0P_DMAC_DMACB7_SS0                  *((volatile unsigned int*)(0x42C010C0UL))
#define bFM0P_DMAC_DMACB7_SS1                  *((volatile unsigned int*)(0x42C010C4UL))
#define bFM0P_DMAC_DMACB7_SS2                  *((volatile unsigned int*)(0x42C010C8UL))
#define bFM0P_DMAC_DMACB7_CI                   *((volatile unsigned int*)(0x42C010CCUL))
#define bFM0P_DMAC_DMACB7_EI                   *((volatile unsigned int*)(0x42C010D0UL))
#define bFM0P_DMAC_DMACB7_RD                   *((volatile unsigned int*)(0x42C010D4UL))
#define bFM0P_DMAC_DMACB7_RS                   *((volatile unsigned int*)(0x42C010D8UL))
#define bFM0P_DMAC_DMACB7_RC                   *((volatile unsigned int*)(0x42C010DCUL))
#define bFM0P_DMAC_DMACB7_FD                   *((volatile unsigned int*)(0x42C010E0UL))
#define bFM0P_DMAC_DMACB7_FS                   *((volatile unsigned int*)(0x42C010E4UL))
#define bFM0P_DMAC_DMACB7_TW0                  *((volatile unsigned int*)(0x42C010E8UL))
#define bFM0P_DMAC_DMACB7_TW1                  *((volatile unsigned int*)(0x42C010ECUL))
#define bFM0P_DMAC_DMACB7_MS0                  *((volatile unsigned int*)(0x42C010F0UL))
#define bFM0P_DMAC_DMACB7_MS1                  *((volatile unsigned int*)(0x42C010F4UL))

#ifdef __cplusplus
}
#endif

#endif /* _S6E1A1_H_ */
